MetaMapBLTDefaultData = {

    --------------------
	----- 黑翼之巢 -----
	--------------------

	BWLRazorgore = {
	    { 16918, "INV_Bracer_09", "=q4=灵风束腕",       "=q1=#m1# =ds=#c3#",         "20.41%" },
		{ 16926, "INV_Bracer_09", "=q4=卓越束腕", "=q1=#m1# =ds=#c5#",       "20.37%" },
		{ 16934, "INV_Bracer_07", "=q4=复仇护腕",           "=q1=#m1# =ds=#c8#",      "18.11%" },
		{ 16911, "INV_Bracer_02", "=q4=血牙护腕",         "=q1=#m1# =ds=#c6#",        "20.69%" },
		{ 16904, "INV_Bracer_03", "=q4=怒风护腕",         "=q1=#m1# =ds=#c1#",        "17.38%" },
		{ 16935, "INV_Bracer_17", "=q4=巨龙追猎者护腕",   "=q1=#m1# =ds=#c2#",       "19.13%" },
		{ 16943, "INV_Bracer_16", "=q4=无尽风暴护腕",     "=q1=#m1# =ds=#c7#",       " 7.54%" },
		{ 16959, "INV_Bracer_19", "=q4=愤怒护腕",        "=q1=#m1# =ds=#c9#",      "20.29%" },
		{ 16951, "INV_Bracer_18", "=q4=审判束腕",        "=q1=#m1# =ds=#c4#",      "13.61%" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 19337, "INV_Misc_Book_06", "=q4=黑龙之书", "=q1=#m1# =ds=#c8#, =ds=#s14#",           "18.37%" },
		{ 19336, "Spell_Nature_WispSplode", "=q4=奥术能量宝石", "=q1=#m1# =ds=#c2#, =ds=#s14#", "17.33%" },
		{ 0,"","","" },
		{ 19370, "INV_Shoulder_25", "=q4=黑翼衬肩", "=ds=#s3#, #a1#", "18.57%" },
		{ 19369, "INV_Gauntlets_06", "=q4=疾速进化手套",    "=ds=#s9#, #a1#",    "17.52%" },
		{ 19335, "INV_Mace_06", "=q4=碎脊者",                      "=ds=#h3#, #w6#", "10.44%" },
		{ 19334, "INV_Sword_50", "=q4=狂野之刃",                "=ds=#h2#, #w10#", " 9.76%" },
		};

	BWLVaelastrasz = {
	    { 16818, "INV_Belt_22", "=q4=灵风腰带",       "=q1=#m1# =ds=#c3#",     "19.94%" },
	    { 16925, "INV_Belt_22", "=q4=卓越腰带", "=q1=#m1# =ds=#c5#",   "18.76%" },
	    { 16933, "INV_Belt_13", "=q4=复仇腰带",          "=q1=#m1# =ds=#c8#",  "18.42%" },
		{ 16936, "INV_Belt_28", "=q4=巨龙追猎者腰带",  "=q1=#m1# =ds=#c2#",   "20.17%" },
		{ 16903, "INV_Belt_06", "=q4=怒风腰带",        "=q1=#m1# =ds=#c1#",    "16.90%" },
		{ 16910, "INV_Belt_23", "=q4=血牙腰带",        "=q1=#m1# =ds=#c6#",    "19.69%" },
		{ 16944, "INV_Belt_14", "=q4=无尽风暴腰带",    "=q1=#m1# =ds=#c7#",   " 6.93%" },
		{ 16960, "INV_Belt_09", "=q4=愤怒腰带",    "=q1=#m1# =ds=#c9#",  "20.03%" },
		{ 16952, "INV_Belt_27", "=q4=审判腰带",        "=q1=#m1# =ds=#c4#",  "12.23%" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 19339, "Spell_Nature_WispHeal", "=q4=思维加速宝石", "=q1=#m1# =ds=#c3#, =ds=#s14#", "18.96%" },
		{ 19340, "INV_Misc_Rune_06", "=q4=变形符文", "=q1=#m1# =ds=#c1#, =ds=#s14#",    "17.66%" },
		{ 0,"","","" },
		{ 19372, "INV_Helmet_10", "=q4=无尽怒气头盔",                   "=ds=#s1#, #a4#",      "16.76%" },
		{ 19346, "INV_Weapon_Shortblade_29", "=q4=龙牙之刃",            "=ds=#h1#, #w4#", " 9.40%" },
		{ 19348, "INV_Shield_20", "=q4=红龙防护者",              "=ds=#w8#", " 8.57%" },
		{ 19371, "INV_Jewelry_Necklace_12", "=q4=龙魂坠饰", "=ds=#s2#",             "18.56%" },
		};

	BWLLashlayer = {
		{ 16912, "INV_Boots_07", "=q4=灵风长靴",              "=q1=#m1# =ds=#c3#",       "17.17%" },
		{ 16919, "INV_Boots_07", "=q4=卓越长靴",        "=q1=#m1# =ds=#c5#",     "14.61%" },
		{ 16927, "INV_Boots_05", "=q4=复仇战靴",                 "=q1=#m1# =ds=#c8#",    "15.32%" },
		{ 16898, "INV_Boots_08", "=q4=怒风长靴",               "=q1=#m1# =ds=#c1#",      "13.79%" },
		{ 16906, "INV_Boots_08", "=q4=血牙长靴",               "=q1=#m1# =ds=#c6#",      "15.66%" },
		{ 16941, "INV_Boots_Plate_07", "=q4=巨龙追猎者胫甲", "=q1=#m1# =ds=#c2#",     "17.78%" },
		{ 16949, "INV_Boots_Plate_06", "=q4=无尽风暴胫甲",   "=q1=#m1# =ds=#c7#",     " 5.57%" },
		{ 16965, "INV_Boots_Plate_04", "=q4=愤怒马靴",       "=q1=#m1# =ds=#c9#",    "16.84%" },
		{ 16957, "INV_Boots_Plate_09", "=q4=审判马靴",      "=q1=#m1# =ds=#c4#",    "11.28%" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 20383, "Spell_Shadow_CurseOfTounges", "=q4=勒什雷尔的头颅", "=ds=#m2#",   "100%" },
		{ 19342, "INV_Misc_Idol_03", "=q4=毒性图腾",         "=q1=#m1# =ds=#c6#, =ds=#s14#",   "15.06%" },
		{ 19341, "INV_Misc_Gem_Pearl_05", "=q4=生命宝石",    "=q1=#m1# =ds=#c9#, =ds=#s14#", "14.27%" },
		{ 0,"","","" },
		{ 19374, "INV_Bracer_07", "=q4=奥术精准护腕",               "=ds=#s8#, #a1#",   "15.03%" },
		{ 19373, "INV_Shoulder_14", "=q4=黑龙肩铠",                  "=ds=#s3#, #a3#", "17.25%" },
		{ 19351, "INV_Sword_49", "=q4=玛达拉斯，黑龙军团的符文之剑", "=ds=#h1#, #w10#", " 9.62%" },
		{ 19350, "INV_Weapon_Bow_09", "=q4=击心者",                         "=ds=#w2#",            " 8.45%" },
		};

	BWLFiremaw = {
		{ 16913, "INV_Gauntlets_14", "=q4=灵风手套",           "=q1=#m1# =ds=#c3#",     "7.37%" },
		{ 16920, "INV_Gauntlets_14", "=q4=卓越护手", "=q1=#m1# =ds=#c5#",   "6.01%" },
		{ 16928, "INV_Gauntlets_19", "=q4=复仇手套",              "=q1=#m1# =ds=#c8#",  "5.28%" },
		{ 16907, "INV_Gauntlets_21", "=q4=血牙手套",            "=q1=#m1# =ds=#c6#",    "6.84%" },
		{ 16940, "INV_Gauntlets_10", "=q4=巨龙追猎者护手",   "=q1=#m1# =ds=#c2#",   "6.13%" },
		{ 16899, "INV_Gauntlets_25", "=q4=怒风护手",        "=q1=#m1# =ds=#c1#",    "5.34%" },
		{ 16948, "INV_Gauntlets_11", "=q4=无尽风暴护手",     "=q1=#m1# =ds=#c7#",   "2.13%" },
		{ 16964, "INV_Gauntlets_10", "=q4=愤怒护手",          "=q1=#m1# =ds=#c9#",  "5.93%" },
		{ 16956, "INV_Gauntlets_29", "=q4=审判护手",         "=q1=#m1# =ds=#c4#",  "3.58%" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
    { 19343, "INV_Scroll_08", "=q4=盲目光芒卷轴",   "=q1=#m1# =ds=#c4#, =ds=#s14#", " 9.17%" },
		{ 19344, "INV_Misc_Gem_03", "=q4=自然之盟水晶", "=q1=#m1# =ds=#c7#, =ds=#s14#",  " 4.03%" },
		{ 19400, "INV_Belt_10", "=q4=火喉之握",                        "=ds=#s10#, #a1#",           "14.75%" },
        { 19399, "INV_Chest_Cloth_50", "=q4=黑灰长袍",                   "=ds=#s5#, #a1#",           "15.00%" },
        { 19398, "INV_Misc_Cape_18", "=q4=火喉披风",                   "=ds=#s4#",                   "15.39%" },
        { 19396, "INV_Belt_16", "=q4=紧绷的龙皮腰带",                    "=ds=#s10#, #a2#",         " 5.44%" },
        { 19401, "INV_Pants_Mail_19", "=q4=首领锁链腿甲",      "=ds=#s11#, #a3#",             " 5.37%" },
        { 19402, "INV_Pants_Plate_16", "=q4=堕落十字军腿甲", "=ds=#s11#, #a4#",            " 9.50%" },
        { 19394, "INV_Shoulder_23", "=q4=龙爪肩铠",               "=ds=#s3#, #a4#",        " 6.76%" },
        { 0,"","","" },
		{ 19365, "INV_Weapon_ShortBlade_27", "=q4=黑龙之爪",    "=ds=#h3#, #w13#", "15.97%" },
		{ 19355, "INV_Staff_13", "=q4=暗影之翼",                "=ds=#h2#, #w9#",        " 3.70%" },
		{ 19353, "INV_Axe_10", "=q4=龙爪巨斧",                      "=ds=#h2#, #w1#",          " 3.18%" },
		{ 0,"","","" },
		{ 19397, "INV_Jewelry_Ring_43", "=q4=黑石之戒",               "=ds=#s13#",           " 5.98%" },
		{ 19395, "INV_Misc_Gem_Topaz_02", "=q4=恢复宝石",              "=ds=#s14#",                " 5.30%" },
		};

	BWLEbonroc = {
		{ 16913, "INV_Gauntlets_14", "=q4=灵风手套",           "=q1=#m1# =ds=#c3#",    "6.44%" },
		{ 16920, "INV_Gauntlets_14", "=q4=卓越护手", "=q1=#m1# =ds=#c5#",  "6.59%" },
		{ 16928, "INV_Gauntlets_19", "=q4=复仇手套",              "=q1=#m1# =ds=#c8#", "7.15%" },
		{ 16907, "INV_Gauntlets_21", "=q4=血牙手套",            "=q1=#m1# =ds=#c6#",   "7.07%" },
		{ 16940, "INV_Gauntlets_10", "=q4=巨龙追猎者护手",   "=q1=#m1# =ds=#c2#",  "6.91%" },
		{ 16899, "INV_Gauntlets_25", "=q4=怒风护手",        "=q1=#m1# =ds=#c1#",   "6.32%" },
		{ 16948, "INV_Gauntlets_11", "=q4=无尽风暴护手",     "=q1=#m1# =ds=#c7#",  "1.93%" },
		{ 16964, "INV_Gauntlets_10", "=q4=愤怒护手",          "=q1=#m1# =ds=#c9#", "6.19%" },
		{ 16956, "INV_Gauntlets_29", "=q4=审判护手",         "=q1=#m1# =ds=#c4#", "4.45%" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 19345, "Spell_Holy_BlessingOfProtection", "=q4=庇护者", "=q1=#m1# =ds=#c5#, =ds=#s14#", "16.47%" },
		{ 19407, "INV_Gauntlets_27", "=q4=黑焰手套",              "=ds=#s9#, #a1#",   "16.59%" },
		{ 19405, "INV_Chest_Leather_08", "=q4=玛法里奥的祝福", "=ds=#s5#, #a2#",  "17.03%" },
		{ 19396, "INV_Belt_16", "=q4=紧绷的龙皮腰带",                 "=ds=#s10#, #a2#",  " 5.99%" },
		{ 19394, "INV_Shoulder_23", "=q4=龙爪肩铠",            "=ds=#s3#, #a4#", " 5.68%" },
		{ 0,"","","" },
		{ 19353, "INV_Axe_10", "=q4=龙爪巨斧",                   "=ds=#h2#, #w1#",   " 3.60%" },
		{ 19368, "INV_Weapon_Rifle_02", "=q4=龙息手持火炮",     "=ds=#w5#",             " 8.58%" },
        { 19355, "INV_Staff_13", "=q4=暗影之翼",             "=ds=#h2#, #w9#", " 2.77%" },
        { 0,"","","" },
		{ 19403, "INV_Jewelry_Ring_34", "=q4=专注指环", "=ds=#s13#",    "14.63%" },
		{ 19397, "INV_Jewelry_Ring_43", "=q4=黑石之戒",            "=ds=#s13#",    " 5.99%" },
		{ 19406, "INV_Misc_Bone_06", "=q4=龙牙饰物",             "=ds=#s14#",         "17.41%" },
		{ 19395, "INV_Misc_Gem_Topaz_02", "=q4=恢复宝石",           "=ds=#s14#",         " 5.62%" },
		};

	BWLFlamegor = {
		{ 16913, "INV_Gauntlets_14", "=q4=灵风手套",           "=q1=#m1# =ds=#c3#",     "6.91%" },
		{ 16920, "INV_Gauntlets_14", "=q4=卓越护手", "=q1=#m1# =ds=#c5#",   "6.47%" },
		{ 16928, "INV_Gauntlets_19", "=q4=复仇手套",              "=q1=#m1# =ds=#c8#",  "6.65%" },
		{ 16907, "INV_Gauntlets_21", "=q4=血牙手套",            "=q1=#m1# =ds=#c6#",    "6.41%" },
		{ 16940, "INV_Gauntlets_10", "=q4=巨龙追猎者护手",   "=q1=#m1# =ds=#c2#",   "6.73%" },
		{ 16899, "INV_Gauntlets_25", "=q4=怒风护手",        "=q1=#m1# =ds=#c1#",    "5.66%" },
		{ 16948, "INV_Gauntlets_11", "=q4=无尽风暴护手",     "=q1=#m1# =ds=#c7#",   "2.72%" },
		{ 16964, "INV_Gauntlets_10", "=q4=愤怒护手",          "=q1=#m1# =ds=#c9#",  "6.63%" },
		{ 16956, "INV_Gauntlets_29", "=q4=审判护手",         "=q1=#m1# =ds=#c4#",  "3.64%" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 19430, "INV_Misc_Cape_16", "=q4=纯净思想斗篷",         "=ds=#s4#",            "17.50%" },
		{ 19396, "INV_Belt_16", "=q4=紧绷的龙皮腰带",                "=ds=#s10#, #a2#",  " 6.41%" },
		{ 19433, "INV_Pants_Mail_17", "=q4=灰烬护腿",           "=ds=#s11#, #a3#",      "18.73%" },
		{ 19394, "INV_Shoulder_23", "=q4=龙爪肩铠",           "=ds=#s3#, #a4#", " 5.95%" },
		{ 0,"","","" },
		{ 19353, "INV_Axe_10", "=q4=龙爪巨斧",                  "=ds=#h2#, #w1#",   " 3.79%" },
        { 19355, "INV_Staff_13", "=q4=暗影之翼",            "=ds=#h2#, #w9#", " 2.66%" },
		{ 19357, "INV_Mace_05", "=q4=悲哀使者",                       "=ds=#h2#, #w6#",  " 9.07%" },
		{ 19367, "INV_Wand_11", "=q4=巨龙之触",                      "=ds=#w12#",            " 9.06%" },
		{ 0,"","","" },
		{ 19431, "INV_Misc_ArmorKit_10", "=q4=斯泰林的甲虫壳", "=ds=#s14#",         "17.02%" },
		{ 19397, "INV_Jewelry_Ring_43", "=q4=黑石之戒",           "=ds=#s13#",    " 6.25%" },
		{ 19432, "INV_Jewelry_Ring_37", "=q4=源力之环",     "=ds=#s13#",    "18.69%" },
		{ 19395, "INV_Misc_Gem_Topaz_02", "=q4=恢复宝石",          "=ds=#s14#",         " 5.46%" },
		};

	BWLChromaggus = {
	    { 16917, "INV_Shoulder_32", "=q4=灵风衬肩",          "=q1=#m1# =ds=#c3#",     "18.09%" },
	    { 16924, "INV_Shoulder_02", "=q4=卓越肩铠", "=q1=#m1# =ds=#c5#",   "17.83%" },
	    { 16932, "INV_Shoulder_19", "=q4=复仇肩铠",          "=q1=#m1# =ds=#c8#",  "16.26%" },
		{ 16937, "INV_Shoulder_10", "=q4=巨龙追猎者肩甲",  "=q1=#m1# =ds=#c2#",   "16.20%" },
		{ 16902, "INV_Shoulder_07", "=q4=怒风肩甲",        "=q1=#m1# =ds=#c1#",    "14.63%" },
		{ 16832, "INV_Shoulder_23", "=q4=血牙肩甲",        "=q1=#m1# =ds=#c6#",    "17.03%" },
		{ 16945, "INV_Shoulder_33", "=q4=无尽风暴肩饰",     "=q1=#m1# =ds=#c7#",   " 6.73%" },
		{ 16953, "INV_Shoulder_37", "=q4=愤怒肩铠",        "=q1=#m1# =ds=#c4#",  "10.97%" },
		{ 16961, "INV_Shoulder_34", "=q4=审判肩铠",         "=q1=#m1# =ds=#c9#",  "16.83%" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 19388, "INV_Belt_13", "=q4=安格莉斯塔之握",                "=ds=#s10#, #a1#",      "16.86%" },
		{ 19385, "INV_Pants_Cloth_19", "=q4=强能护腿",        "=ds=#s11#, #a1#",       "16.27%" },
        { 19391, "INV_Boots_Cloth_01", "=q4=闪光之鞋",           "=ds=#s12#, #a1#",       "17.46%" },
        { 19386, "INV_Misc_Cape_01", "=q4=源质丝线披风",   "=ds=#s4#",              "18.93%" },
		{ 19390, "INV_Gauntlets_19", "=q4=紧绷的龙皮手套",      "=ds=#s9#, #a2#",    "18.84%" },
		{ 19389, "INV_Shoulder_08", "=q4=紧绷的龙皮护肩", "=ds=#s3#, #a2#", "16.89%" },
		{ 19393, "INV_Belt_21", "=q4=首领锁链腰带",    "=ds=#s10#, #a3#",       " 6.17%" },
		{ 19392, "INV_Belt_11", "=q4=堕落十字军腰带",    "=ds=#s10#, #a4#",      "10.97%" },
		{ 19387, "INV_Boots_Plate_04", "=q4=多彩长靴",           "=ds=#s12#, #a4#",       "16.46%" },
		{ 0,"","","" },
		{ 19352, "INV_Sword_51", "=q4=多彩之剑",    "=ds=#h1#, #w10#",   " 9.05%" },
		{ 19347, "INV_Weapon_Shortblade_28", "=q4=克洛玛古斯之爪",  "=ds=#h1#, #w4#",  " 8.39%" },
		{ 19349, "INV_Shield_17", "=q4=源质壁垒",  "=ds=#w8#",  " 8.04%" },
		{ 19361, "INV_Weapon_Crossbow_09", "=q4=埃瑟利苏尔，惩戒之弩", "=ds=#w3#", " 7.51%" },
        };

	BWLNefarian = {
		{ 16916, "INV_Chest_Cloth_03", "=q4=灵风长袍",            "=q1=#m1# =ds=#c3#",     "14.03%" },
		{ 16931, "INV_Chest_Leather_01", "=q4=卓越法袍",             "=q1=#m1# =ds=#c8#",  "12.46%" },
		{ 16923, "INV_Chest_Cloth_03", "=q4=复仇法袍",      "=q1=#m1# =ds=#c5#",   "14.83%" },
		{ 16905, "INV_Chest_Cloth_07", "=q4=血牙胸甲",        "=q1=#m1# =ds=#c6#",    "14.21%" },
        { 16897, "INV_Chest_Chain_16", "=q4=怒风胸甲",        "=q1=#m1# =ds=#c1#",    "11.89%" },
		{ 16942, "INV_Chest_Chain_03", "=q4=巨龙追猎者胸甲", "=q1=#m1# =ds=#c2#",   "13.30%" },
		{ 16950, "INV_Chest_Chain_11", "=q4=无尽风暴胸甲",   "=q1=#m1# =ds=#c7#",   " 5.65%" },
		{ 16966, "INV_Chest_Plate16", "=q4=愤怒胸甲",         "=q1=#m1# =ds=#c9#",  "15.06%" },
		{ 16958, "INV_Chest_Plate03", "=q4=审判胸甲",        "=q1=#m1# =ds=#c4#",  " 9.24%" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 19003, "INV_Misc_Head_Dragon_Black", "=q4=奈法利安的头颅", "=ds=#m2#", " 100%" },
		{ 19383,"INV_Jewelry_Necklace_18","=q4=屠龙大师勋章","=q1=#m4# =ds=#s2#" },
		{ 19366,"INV_Misc_Orb_03","=q4=屠龙大师宝珠","=q1=#m4# =ds=#s15#" },
		{ 19384,"INV_Jewelry_Ring_41","=q4=屠龙大师之戒","=q1=#m4# =ds=#s13#" },
		{ 19375, "INV_Helmet_52", "=q4=密苏尔达，夺魂者的头饰", "=ds=#s1#, #a1#",     "14.80%" },
		{ 19378, "INV_Misc_Cape_20", "=q4=龙王披风",              "=ds=#s4#",            "14.95%" },
		{ 19381, "INV_Boots_Cloth_05", "=q4=暗影烈焰长靴",          "=ds=#s12#, #a2#",   "15.70%" },
		{ 19380, "INV_Belt_18", "=q4=塞拉赞恩之链",                          "=ds=#s10#, #a3#",     "16.82%" },
		{ 0,"","","" },
		{ 19364, "INV_Sword_50", "=q4=阿什坎迪，兄弟会之剑",  "=ds=#h2#, #w10#", " 7.21%" },
		{ 19360, "INV_Mace_06", "=q4=洛卡米尔·伊洛曼希斯",                      "=ds=#h3#, #w6#", " 6.98%" },
		{ 19363, "INV_Axe_12", "=q4=克鲁索洛克恩，混乱之刃",                "=ds=#h1#, #w1#",   " 7.00%" },
		{ 19356, "INV_Staff_06", "=q4=暗影烈焰法杖",                "=ds=#h2#, #w9#", " 7.27%" },
		{ 0,"","","" },
		{ 19382, "INV_Jewelry_Ring_42", "=q4=纯源质指环",              "=ds=#s13#",    "15.15%" },
		{ 19376, "INV_Jewelry_Ring_40", "=q4=阿基迪罗斯的清算之戒",    "=ds=#s13#",    "13.93%" },
        { 19377, "INV_Jewelry_Necklace_17", "=q4=普瑞斯托的阴谋饰物", "=ds=#s2#",          "14.33%" },
        { 19379, "INV_Stone_15", "=q4=奈萨里奥之泪",                        "=ds=#s14#",         "14.26%" },
        };
        
    BWLTrashMobs = {
        { 19437, "INV_Boots_Cloth_03", "=q4=纯净思想长靴",         "=ds=#s12#, #a1#",     "2.33%" },
        { 19438, "INV_Boots_Cloth_16", "=q4=林格的暴风雪长靴",        "=ds=#s12#, #a1#",     "4.42%" },
        { 19436, "INV_Misc_Cape_11", "=q4=飞龙披风",         "=ds=#s4#",            "2.53%" },
        { 19439, "INV_Chest_Leather_03", "=q4=交织暗影外衣",    "=ds=#s5#, #a2#",  "4.62%" },
        { 19362, "INV_Axe_15", "=q4=末日之刃",                           "=ds=#h1#, #w1#",   "1.67%" },
        { 19358, "INV_Mace_05", "=q4=龙人之槌",                        "=ds=#h2#, #w6#",  "2.30%" },
        { 19354, "INV_Axe_21", "=q4=巨龙复仇者",                      "=ds=#h2#, #w1#",   "5.96%" },
        { 19435, "INV_Wand_06", "=q4=精华收集者",                     "=ds=#w12#",            "1.61%" },
        { 19434, "INV_Jewelry_Ring_24", "=q4=黑暗统御指环",        "=ds=#s13#",    "1.57%" },
        };

	-----------------
	-- Molten Core --
	-----------------

	MCLucifron = {
	    { 16800, "INV_Boots_07", "=q4=奥术师便鞋",         "=q1=#m1# =ds=#c3#",     "12.06%" },
	  	{ 16805, "INV_Gauntlets_19", "=q4=恶魔之心手套",    "=q1=#m1# =ds=#c8#",  "14.89%" },
		{ 16829, "INV_Boots_08", "=q4=塞纳里奥长靴",         "=q1=#m1# =ds=#c1#",    "10.72%" },
		{ 16837, "INV_Boots_Plate_06", "=q4=大地之怒长靴",  "=q1=#m1# =ds=#c7#",   " 4.16%" },
		{ 16863, "INV_Gauntlets_10", "=q4=力量护手", "=q1=#m1# =ds=#c9#",  "16.40%" },
		{ 16859, "INV_Boots_Plate_09", "=q4=秩序之源战靴", "=q1=#m1# =ds=#c4# ", " 7.20%" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 18872, "INV_Pants_08", "=q4=法力风暴护腿",           "=ds=#s11#, #a1#", " 1.93%" },
		{ 19145, "INV_Chest_Cloth_18", "=q4=波动长袍", "=ds=#s5#, #a1#", " 1.84%" },
		{ 19146, "INV_Bracer_04", "=q4=稳固护腕",    "=ds=#s8#, #a2#", " 1.95%" },
		{ 18875, "INV_Pants_12", "=q4=火蜥蜴鳞片短裤",       "=ds=#s11#, #a2#", " 2.00%" },
		{ 18870, "INV_Helmet_18", "=q4=生命赐予者头盔",       "=ds=#s1#, #a3#", " 1.09%" },
		{ 18861, "INV_Pants_04", "=q4=召火腿甲",         "=ds=#s11#, #a4#", " 2.15%" },
		{ 18878, "INV_Weapon_ShortBlade_07", "=q4=巫术匕首", "=ds=#h3#, #w4#", " 2.23%" },
		{ 17077, "INV_Staff_13", "=q4=赤红震荡者",              "=ds=#w12#", " 1.60%" },
		{ 18879, "INV_Jewelry_Ring_14", "=q4=沉重的黑铁戒指",  "=ds=#s13#", " 2.04%" },
        { 19147, "INV_Jewelry_Ring_38", "=q4=法术能量之戒",   "=ds=#s13#", " 2.23%" },
		{ 17109, "INV_Jewelry_Necklace_10", "=q4=启示项链", "=ds=#s2#", "12.61%" },
        { 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
        { 16665, "INV_Misc_Book_11", "=q2=秘典:宁神射击", "=q1=#m1# =ds=#c2#", "100%" },
		};
        
	MCMagmadar = {
		{ 16796, "INV_Pants_08", "=q4=奥术师护腿",    "=q1=#m1# =ds=#c3#", "14.57%" },
		{ 16814, "INV_Pants_08", "=q4=预言短裤",    "=q1=#m1# =ds=#c5#", "14.33%" },
		{ 16810, "INV_Pants_Cloth_14", "=q4=恶魔之心短裤", "=q1=#m1# =ds=#c8#", "13.75%" },
		{ 16822, "INV_Pants_06", "=q4=夜幕杀手短裤",    "=q1=#m1# =ds=#c6#", "13.83%" },
		{ 16847, "INV_Pants_Mail_03", "=q4=巨人追猎者护腿", "=q1=#m1# =ds=#c2#", "13.28%" },
		{ 16835, "INV_Pants_06", "=q4=塞纳里奥护腿",    "=q1=#m1# =ds=#c1#", "12.90%" },
		{ 16843, "INV_Pants_03", "=q4=大地之怒腿甲",  "=q1=#m1# =ds=#c7#", " 4.73%" },
		{ 16855, "INV_Pants_04", "=q4=秩序之源腿铠", "=q1=#m1# =ds=#c4#", " 8.54%" },
		{ 16867, "INV_Pants_04", "=q4=力量腿铠",   "=q1=#m1# =ds=#c9#", "13.97%" },
		{ 0,"","","" },
        { 0,"","","" },
        { 0,"","","" },
        { 0,"","","" },
        { 0,"","","" },
        { 0,"","","" },
		{ 19136, "INV_Belt_11", "=q4=燃魔腰带",                 "=ds=#s10#, #a1#", " 4.79%" },
		{ 18823, "INV_Gauntlets_23", "=q4=古代熔火皮手套",      "=ds=#s9#, #a2#", " 6.18%" },
		{ 18829, "INV_Shoulder_04", "=q4=地核护肩",           "=ds=#s3#, #a3#", " 2.10%" },
		{ 19144, "INV_Boots_Chain_05", "=q4=烈焰行者重靴", "=ds=#s12#, #a3#", " 1.86%" },
		{ 19143, "INV_Gauntlets_26", "=q4=烈焰守卫护手",          "=ds=#s9#, #a4#", " 5.48%" },
		{ 18824, "INV_Boots_Plate_08", "=q4=岩浆长靴",        "=ds=#s12#, #a4#", " 3.22%" },
        { 18861, "INV_Pants_04", "=q4=召火腿甲",              "=ds=#s11#, #a4#", " 3.98%" },
		{ 17073, "INV_Hammer_04", "=q4=震地者",                      "=ds=#h2#, #w6#", "16.75%" },
		{ 18822, "INV_Sword_28", "=q4=黑曜石之刃",              "=ds=#h2#, #w10#", " 5.68%" },
		{ 18203, "INV_Misc_MonsterClaw_04", "=q4=艾斯卡达尔的右爪", "=ds=#h3#, #w13#", "17.82%" },
		{ 17069, "INV_Weapon_Bow_08", "=q4=速射强弓",               "=ds=#w2#", "16.37%" },
		{ 19142, "INV_Misc_Book_09", "=q4=火焰符文魔典",               "=ds=#s15#", " 5.42%" },
		{ 17065, "INV_Jewelry_Amulet_03", "=q4=稳固之力勋章", "=ds=#s2#", "14.05%" },
		{ 18821, "INV_Jewelry_Ring_07", "=q4=迅击戒指",          "=ds=#s13#", " 5.79%" },
		{ 18820, "INV_Misc_StoneTablet_11", "=q4=短暂能量护符", "=ds=#s14#", " 5.55%" },
		};
        
	MCGehennas = {
	    { 16812, "INV_Gauntlets_14", "=q4=预言手套",     "=q1=#m1# =ds=#c5#", "18.65%" },
		{ 16826, "INV_Gauntlets_21", "=q4=夜幕杀手手套",     "=q1=#m1# =ds=#c6#", "19.47%" },
		{ 16849, "INV_Boots_Chain_13", "=q4=巨人追猎者长靴", "=q1=#m1# =ds=#c2#", "14.54%" },
		{ 16839, "INV_Gauntlets_11", "=q4=大地之怒护手",    "=q1=#m1# =ds=#c7#", " 7.38%" },
		{ 16862, "INV_Boots_Plate_04", "=q4=力量马靴",    "=q1=#m1# =ds=#c9#", "14.48%" },
		{ 16860, "INV_Gauntlets_29", "=q4=秩序之源护手",   "=q1=#m1# =ds=#c4#", "11.77%" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 18872, "INV_Pants_08", "=q4=法力风暴护腿",           "=ds=#s11#, #a1#", " 3.37%" },
		{ 19145, "INV_Chest_Cloth_18", "=q4=波动长袍", "=ds=#s5#, #a1#", " 3.83%" },
		{ 18875, "INV_Pants_12", "=q4=火蜥蜴鳞片短裤",       "=ds=#s11#, #a2#", " 3.57%" },
		{ 19146, "INV_Bracer_04", "=q4=稳固护腕",    "=ds=#s8#, #a2#", " 3.53%" },
		{ 18870, "INV_Helmet_18", "=q4=生命赐予者头盔",       "=ds=#s1#, #a3#", " 1.77%" },
		{ 18861, "INV_Pants_04", "=q4=召火腿甲",         "=ds=#s11#, #a4#", " 3.48%" },
		{ 18878, "INV_Weapon_ShortBlade_07", "=q4=巫术匕首", "=ds=#h3#, #w4#", " 3.79%" },
		{ 17077, "INV_Staff_13", "=q4=赤红震荡者",              "=ds=#w12#", " 3.34%" },
		{ 18879, "INV_Jewelry_Ring_14", "=q4=沉重的黑铁戒指",  "=ds=#s13#", " 3.78%" },
		{ 19147, "INV_Jewelry_Ring_38", "=q4=法术能量之戒",   "=ds=#s13#", " 3.78%" },
		};
        
	MCGarr = {
	    { 16795, "INV_Helmet_53", "=q4=奥术师头冠",        "=q1=#m1# =ds=#c3#", "11.31%" },
	    { 16813, "INV_Helmet_34", "=q4=预言头饰",   "=q1=#m1# =ds=#c5#", "11.36%" },
	    { 16808, "INV_Helmet_08", "=q4=恶魔之心角饰",        "=q1=#m1# =ds=#c8#", "10.62%" },
		{ 16846, "INV_Helmet_05", "=q4=巨人追猎者头盔", "=q1=#m1# =ds=#c2#", "11.57%" },
		{ 16834, "INV_Helmet_09", "=q4=塞纳里奥头盔",         "=q1=#m1# =ds=#c1#", "11.51%" },
		{ 16821, "INV_Helmet_41", "=q4=夜幕杀手头巾",     "=q1=#m1# =ds=#c6#", "10.38%" },
		{ 16842, "INV_Helmet_09", "=q4=大地之怒头盔",      "=q1=#m1# =ds=#c7#", " 3.91%" },
		{ 16866, "INV_Helmet_09", "=q4=力量头盔",         "=q1=#m1# =ds=#c9#", "11.39%" },
		{ 16854, "INV_Helmet_05", "=q4=秩序之源头盔",       "=q1=#m1# =ds=#c4#", " 7.23%" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 18564, "Spell_Ice_Lament", "=q5=逐风者禁锢之颅", "=q1=#m3#", " 3.74%" },
		{ 19019, "INV_Sword_39", "=q5=雷霆之怒, 逐风者的祝福之剑", "=q1=#m4#" },
		{ 19136, "INV_Belt_11", "=q4=燃魔腰带",                 "=ds=#s10#, #a1#", " 4.80%" },
		{ 18823, "INV_Gauntlets_23", "=q4=古代熔火皮手套",      "=ds=#s9#, #a2#", " 5.23%" },
		{ 19144, "INV_Boots_Chain_05", "=q4=烈焰行者重靴", "=ds=#s12#, #a3#", " 1.48%" },
        { 18829, "INV_Shoulder_04", "=q4=地核护肩",           "=ds=#s3#, #a3#", " 1.68%" },
		{ 19143, "INV_Gauntlets_26", "=q4=烈焰守卫护手",          "=ds=#s9#, #a4#", " 3.84%" },
		{ 18824, "INV_Boots_Plate_08", "=q4=岩浆长靴",        "=ds=#s12#, #a4#", " 3.05%" },
		{ 18861, "INV_Pants_04", "=q4=召火腿甲",              "=ds=#s11#, #a4#", " 2.82%" },
		{ 18822, "INV_Sword_28", "=q4=黑曜石之刃",              "=ds=#h2#, #w10#", " 4.09%" },
		{ 18832, "INV_Sword_15", "=q4=残忍利刃",                   "=ds=#h1#, #w10#", "13.27%" },
		{ 17071, "INV_Weapon_ShortBlade_18", "=q4=血腥撕裂者",        "=ds=#h1#, #w4#", "11.21%" },
		{ 17105, "INV_Hammer_05", "=q4=光环石锤",                 "=ds=#h1#, #w6#", "12.67%" },
		{ 17066, "INV_Shield_10", "=q4=钻孔虫之碟",                  "=ds=#w8#", "11.85%" },
		{ 19142, "INV_Misc_Book_09", "=q4=火焰符文魔典",           "=ds=#s15#", " 3.69%" },
		{ 18821, "INV_Jewelry_Ring_07", "=q4=迅击戒指",          "=ds=#s13#", " 4.48%" },
		{ 18820, "INV_Misc_StoneTablet_11", "=q4=短暂能量护符", "=ds=#s14#", " 4.13%" },
		};
        
	MCShazzrah = {
		{ 16801, "INV_Gauntlets_14", "=q4=奥术师手套", "=q1=#m1# =ds=#c3#", "19.59%" },
		{ 16803, "INV_Boots_Cloth_05", "=q4=恶魔之心便鞋", "=q1=#m1# =ds=#c8#", "15.28%" },
		{ 16811, "INV_Gauntlets_07", "=q4=预言之靴", "=q1=#m1# =ds=#c5#", "14.90%" },
		{ 16831, "INV_Gauntlets_07", "=q4=塞纳里奥手套", "=q1=#m1# =ds=#c1#", "19.53%" },
		{ 16852, "INV_Gauntlets_10", "=q4=巨人追猎者手套", "=q1=#m1# =ds=#c2#", "18.58%" },
		{ 16824, "INV_Gauntlets_08", "=q4=夜幕杀手长靴", "=q1=#m1# =ds=#c6#", "15.58%" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 19145, "INV_Chest_Cloth_18", "=q4=波动长袍", "=ds=#s5#, #a1#", " 1.97%" },
		{ 18872, "INV_Pants_08", "=q4=法力风暴护腿",           "=ds=#s11#, #a1#", " 1.84%" },
		{ 18875, "INV_Pants_12", "=q4=火蜥蜴鳞片短裤",       "=ds=#s11#, #a2#", " 1.81%" },
		{ 19146, "INV_Bracer_04", "=q4=稳固护腕",    "=ds=#s8#, #a2#", " 1.85%" },
		{ 18870, "INV_Helmet_18", "=q4=生命赐予者头盔",       "=ds=#s1#, #a3#", " 0.78%" },
		{ 18861, "INV_Pants_04", "=q4=召火腿甲",         "=ds=#s11#, #a4#", " 2.22%" },
		{ 18878, "INV_Weapon_ShortBlade_07", "=q4=巫术匕首", "=ds=#h3#, #w4#", " 2.27%" },
        { 17077, "INV_Staff_13", "=q4=赤红震荡者",              "=ds=#w12#", " 3.32%" },
		{ 18879, "INV_Jewelry_Ring_14", "=q4=沉重的黑铁戒指",  "=ds=#s13#", " 1.72%" },
		{ 19147, "INV_Jewelry_Ring_38", "=q4=法术能量之戒",   "=ds=#s13#", " 1.99%" },
		};
        
	MCGeddon = {
		{ 16797, "INV_Shoulder_02", "=q4=奥术师衬肩", "=q1=#m1# =ds=#c3#", "19.92%" },
		{ 16807, "INV_Shoulder_23", "=q4=恶魔之心护肩", "=q1=#m1# =ds=#c8#", "19.78%" },
		{ 16836, "INV_Shoulder_07", "=q4=塞纳里奥肩甲", "=q1=#m1# =ds=#c1#", "19.52%" },
		{ 16856, "INV_Shoulder_20", "=q4=秩序之源肩铠", "=q1=#m1# =ds=#c4#", "12.62%" },
		{ 16844, "INV_Shoulder_29", "=q4=大地之怒肩饰", "=q1=#m1# =ds=#c7#", " 7.29%" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 18563, "Spell_Ice_Lament", "=q5=逐风者禁锢之颅", "=q1=#m3#", " 3.78%" },
		{ 19019, "INV_Sword_39", "=q5=雷霆之怒, 逐风者的祝福之剑", "=q1=#m4#" },
		{ 19136, "INV_Belt_11", "=q4=燃魔腰带",                 "=ds=#s10#, #a1#", " 2.44%" },
		{ 18823, "INV_Gauntlets_23", "=q4=古代熔火皮手套",      "=ds=#s9#, #a2#", " 3.04%" },
		{ 19144, "INV_Boots_Chain_05", "=q4=烈焰行者重靴", "=ds=#s12#, #a3#", " 1.00%" },
        { 18829, "INV_Shoulder_04", "=q4=地核护肩",           "=ds=#s3#, #a3#", " 1.04%" },
		{ 19143, "INV_Gauntlets_26", "=q4=烈焰守卫护手",          "=ds=#s9#, #a4#", " 2.61%" },
        { 18824, "INV_Boots_Plate_08", "=q4=岩浆长靴",        "=ds=#s12#, #a4#", " 1.48%" },
        { 18861, "INV_Pants_04", "召火腿甲",                  "=ds=#s11#, #a4#", " 1.77%" },
		{ 18822, "INV_Sword_28", "=q4=黑曜石之刃",              "=ds=#h2#, #w10#", " 2.70%" },
		{ 19142, "INV_Misc_Book_09", "=q4=火焰符文魔典",           "=ds=#s15#", " 2.59%" },
		{ 18820, "INV_Misc_StoneTablet_11", "=q4=短暂能量护符", "=ds=#s14#", " 2.68%" },
		{ 17110, "INV_Jewelry_Ring_21", "=q4=魔法导师的封印",      "=ds=#s13#", "21.93%" },
		{ 18821, "INV_Jewelry_Ring_07", "=q4=迅击戒指",          "=ds=#s13#", " 2.61%" },
		};
        
	MCGolemagg = {
		{ 16798, "INV_Chest_Cloth_03", "=q4=奥术师长袍", "=q1=#m1# =ds=#c3#", "16.51%" },
		{ 16815, "INV_Chest_Cloth_03", "=q4=预言法袍", "=q1=#m1# =ds=#c5#", "15.65%" },
		{ 16809, "INV_Chest_Cloth_09", "=q4=恶魔之心长袍", "=q1=#m1# =ds=#c8#", "15.66%" },
		{ 16820, "INV_Chest_Cloth_07", "=q4=夜幕杀手胸甲", "=q1=#m1# =ds=#c6#", "16.76%" },
		{ 16833, "INV_Chest_Cloth_06", "=q4=塞纳里奥胸甲", "=q1=#m1# =ds=#c1#", "15.21%" },
		{ 16845, "INV_Chest_Chain_03", "=q4=巨人追猎者胸甲", "=q1=#m1# =ds=#c2#", "15.83%" },
		{ 16841, "INV_Chest_Chain_11", "=q4=大地之怒外衣", "=q1=#m1# =ds=#c7#", " 6.08%" },
		{ 16865, "INV_Chest_Plate16", "=q4=力量胸甲", "=q1=#m1# =ds=#c9#", "15.28%" },
		{ 16853, "INV_Chest_Plate03", "=q4=秩序之源胸甲", "=q1=#m1# =ds=#c4#", " 9.53%" },
		{ 0,"","","" },
        { 0,"","","" },
        { 0,"","","" },
        { 0,"","","" },
		{ 17203, "Spell_Fire_SealOfFire", "=q4=萨弗隆铁锭",      "=q1=#m3#", "11.98%" },
		{ 17182, "INV_Hammer_Unique_Sulfuras", "=q5=萨弗拉斯，炎魔拉格纳罗斯之手", "=q1=#m4#" },
		{ 19136, "INV_Belt_11", "=q4=燃魔腰带",                 "=ds=#s10#, #a1#", " 2.18%" },
		{ 18823, "INV_Gauntlets_23", "=q4=古代熔火皮手套",      "=ds=#s9#, #a2#", " 2.65%" },
		{ 19144, "INV_Boots_Chain_05", "=q4=烈焰行者重靴", "=ds=#s12#, #a3#", " 1.00%" },
		{ 18829, "INV_Shoulder_04", "=q4=地核护肩",           "=ds=#s3#, #a3#", " 1.20%" },
		{ 19143, "INV_Gauntlets_26", "=q4=烈焰守卫护手",          "=ds=#s9#, #a4#", " 2.17%" },
		{ 18824, "INV_Boots_Plate_08", "=q4=岩浆长靴",        "=ds=#s11#, #a4#", " 1.69%" },
		{ 18861, "INV_Pants_04", "=q4=召火腿甲",              "=ds=#s11#, #a4#", " 1.44%" },
		{ 18822, "INV_Sword_28", "=q4=黑曜石之刃",              "=ds=#h2#, #w10#", " 2.89%" },
		{ 17103, "INV_Sword_39", "=q4=碧空之歌",               "=ds=#h3#, #w10#", "17.59%" },
		{ 18842, "INV_Staff_13", "=q4=统御法杖",                "=ds=#h2#, #w9#", "18.95%" },
		{ 17072, "INV_Weapon_Rifle_09", "=q4=爆击猎枪",       "=ds=#w5#", "17.83%" },
		{ 18821, "INV_Jewelry_Ring_07", "=q4=迅击戒指",          "=ds=#s13#", " 2.26%" },
		{ 19142, "INV_Misc_Book_09", "=q4=火焰符文魔典",           "=ds=#s15#", " 2.46%" },
		{ 18820, "INV_Misc_StoneTablet_11", "=q4=短暂能量护符", "=ds=#s14#", " 2.91%" },
		};
        
	MCSulfuron = {
		{ 16816, "INV_Shoulder_02", "=q4=预言衬肩", "=q1=#m1# =ds=#c5#", "21.06%" },
		{ 16823, "INV_Shoulder_25", "=q4=夜幕杀手护肩", "=q1=#m1# =ds=#c6#", "20.66%" },
		{ 16848, "INV_Shoulder_10", "=q4=巨人追猎者肩饰", "=q1=#m1# =ds=#c2#", "19.64%" },
		{ 16868, "INV_Shoulder_15", "=q4=力量肩铠", "=q1=#m1# =ds=#c9#", "21.14%" },
		{ 0,"","","" },
		{ 0,"","","" },
        { 0,"","","" },
		{ 0,"","","" },
        { 0,"","","" },
		{ 0,"","","" },
        { 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 19145, "INV_Chest_Cloth_18", "=q4=波动长袍", "=ds=#s5#, #a1#", " 2.80%" },
		{ 18872, "INV_Pants_08", "=q4=法力风暴护腿",           "=ds=#s11#, #a1#", " 2.54%" },
		{ 19146, "INV_Bracer_04", "=q4=稳固护腕",    "=ds=#s8#, #a2#", " 2.70%" },
		{ 18875, "INV_Pants_12", "=q4=火蜥蜴鳞片短裤",       "=ds=#s11#, #a2#", " 2.58%" },
		{ 18870, "INV_Helmet_18", "=q4=生命赐予者头盔",       "=ds=#s1#, #a3#", " 1.26%" },
		{ 18861, "INV_Pants_04", "=q4=召火腿甲",         "=ds=#s11#, #a4#", " 2.54%" },
		{ 17077, "INV_Staff_13", "=q4=赤红震荡者",              "=ds=#w12#", " 2.26%" },
		{ 17074, "INV_Spear_08", "=q4=暗影之击",                 "=ds=#w7#", "23.50%" },
		{ 18878, "INV_Weapon_ShortBlade_07", "=q4=巫术匕首", "=ds=#h3#, #w4#", " 2.53%" },
		{ 18879, "INV_Jewelry_Ring_14", "=q4=沉重的黑铁戒指",  "=ds=#s13#", " 2.32%" },
		{ 19147, "INV_Jewelry_Ring_38", "=q4=法术能量之戒",   "=ds=#s13#", " 2.39%" },
		};
        
	MCMajordomo = {
		{ 18811, "INV_Misc_Cape_18", "=q4=防火披风",              "=ds=#s4#", "15.12%" },
		{ 18808, "INV_Gauntlets_03", "=q4=眠火手套", "=ds=#s9#, #a1#", "15.36%" },
		{ 18809, "INV_Belt_12", "=q4=耳语秘言腰带",         "=ds=#s10#, #a1#", "15.93%" },
		{ 19139, "INV_Shoulder_23", "=q4=火焰卫士护肩",           "=ds=#s3#, #a2#", "15.87%" },
		{ 18810, "INV_Shoulder_18", "=q4=狂野肩铠",         "=ds=#s3#, #a2#", "16.91%" },
		{ 18812, "INV_Bracer_02", "=q4=真龙护腕",      "=ds=#s8#, #a3#", "18.04%" },
		{ 18806, "INV_Boots_Plate_09", "=q4=熔火胫甲",        "=ds=#s12#, #a4#", "16.53%" },
		{ 18805, "INV_Weapon_ShortBlade_11", "=q4=熔火犬牙",     "=ds=#h1#, #w4#", "16.06%" },
		{ 18803, "INV_Gizmo_02", "=q4=芬克的熔岩挖掘器",            "=ds=#h2#, #w6#", "12.43%" },
		{ 19140, "INV_Jewelry_Ring_39", "=q4=灼烧指环",          "=ds=#s13#", "15.10%" },
        { 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
        { 0,"","","" },
		{ 0,"","","" },
		{ 18703, "Spell_Nature_ResistNature", "=q4=远古石叶", "=ds=#m2# =q1=#m1# =ds=#c2#", "35.25%" },
        { 18714, "INV_Misc_Quiver_03", "=q4=龙筋箭袋", "=q1=#m1# =ds=#c2#, #e9#" },
        { 18713, "INV_Weapon_Bow_01", "=q4=伦鲁迪洛尔,上古守护者的长弓", "=q1=#m1# =ds=#c2#, #w2#" },
        { 18715, "INV_Staff_21", "=q4=罗克迪洛尔,上古守护者的手杖", "=q1=#m1# =ds=#c2#, #w9#" },
        { 0,"","","" },
		{ 18646, "Spell_Holy_MindSooth", "=q4=神圣之眼", "=ds=#m2# =q1=#m1# =ds=#c5#", "28.30%" },
        { 18608, "INV_Staff_30", "=q4=祝福", "=q1=#m1# =ds=#c5#, #w9#" },
        { 18609, "INV_Staff_12", "=q4=咒逐", "=q1=#m1# =ds=#c5#, #w9#" },
		};
        
	MCRagnaros = {
		{ 16915, "INV_Pants_08", "=q4=灵风短裤", "=q1=#m1# =ds=#c3#(t2)", "17.37%" },
		{ 16922, "INV_Pants_08", "=q4=卓越护腿", "=q1=#m1# =ds=#c5#(t2)", "17.30%" },
		{ 16930, "INV_Pants_07", "=q4=复仇护腿", "=q1=#m1# =ds=#c8#(t2)", "16.87%" },
		{ 16909, "INV_Pants_06", "=q4=血牙短裤", "=q1=#m1# =ds=#c6#(t2)", "17.18%" },
		{ 16901, "INV_Pants_06", "=q4=怒风腿甲", "=q1=#m1# =ds=#c1#(t2)", "15.49%" },
		{ 16938, "INV_Pants_03", "=q4=巨龙追猎者腿甲", "=q1=#m1# =ds=#c2#(t2)", "16.02%" },
		{ 16946, "INV_Pants_03", "=q4=无尽风暴护腿", "=q1=#m1# =ds=#c7#(t2)", " 5.97%	" },
		{ 16962, "INV_Pants_04", "=q4=愤怒腿铠", "=q1=#m1# =ds=#c9#(t2)", "17.23%" },
		{ 16954, "INV_Pants_04", "=q4=审判腿铠", "=q1=#m1# =ds=#c4#(t2)", "10.81%" },
		{ 0,"","","" },
		{ 17204, "INV_Misc_Gem_Pearl_05", "=q5=萨弗拉斯之眼", "=q1=#m3#", " 3.42%" },
		{ 17182, "INV_Hammer_Unique_Sulfuras", "=q5=萨弗拉斯, 拉格纳罗斯之手", "=q1=#m4#" },
		{ 0,"","","" },
		{ 19017, "Spell_Fire_SelfDestruct", "=q5=火焰之王的精华", "=q1=#m3#", " 0.46%" },
		{ 19019, "INV_Sword_39", "=q5=雷霆之怒, 逐风者的祝福之剑", "=q1=#m4#" },
		{ 17102, "INV_Misc_Cape_17", "=q4=环雾披风",    "=ds=#s4#", "14.31%" },
		{ 17107, "INV_Misc_Cape_08", "=q4=龙血斗篷",            "=ds=#s4#", "15.32%" },
		{ 18817, "INV_Crown_02", "=q4=毁灭王冠",               "=ds=#s1#, #a3#", "16.75%" },
		{ 19137, "INV_Belt_29", "=q4=冲击束带",                    "=ds=#s10#, #a4#", "13.18%" },
		{ 17104, "INV_Axe_09", "=q4=脊骨收割者",                        "=ds=#h2#, #w1#", " 4.63%" },
		{ 17076, "INV_Sword_12", "=q4=削骨之刃",                  "=ds=#h2#, #w10#", " 5.12%" },
		{ 18816, "INV_Sword_48", "=q4=毁灭之刃",                  "=ds=#h1#, #w4#", "15.90%" },
		{ 17106, "INV_Shield_08", "=q4=玛利斯达尔防御者",               "=ds=#w8#", "13.88%" },
		{ 18815, "Spell_Fire_Fire", "=q4=纯焰精华",       "=ds=#s14#", "17.80%" },
		{ 18814, "INV_Jewelry_Amulet_05", "=q4=火焰之王的项圈",   "=ds=#s2#", "16.08%" },
		{ 19138, "INV_Jewelry_Ring_36", "=q4=萨弗拉斯指环",            "=ds=#s13#", "15.64%" },
		{ 17063, "INV_Jewelry_Ring_15", "=q4=埃古雷亚指环",             "=ds=#s13#", "14.81%" },
		{ 17082, "INV_Misc_Orb_05", "=q4=烈焰碎片",              "=ds=#s14#", " 4.65%" },
		};

	MCTrashMobs = {
		{ 16802, "INV_Belt_30", "=q4=奥术师腰带",       "=q1=#m1# =ds=#c3#", "0.16%"  },
		{ 16817, "INV_Belt_22", "=q4=预言束带",  "=q1=#m1# =ds=#c5#", "0.18%" },
		{ 16806, "INV_Belt_13", "=q4=恶魔之心腰带",       "=q1=#m1# =ds=#c8#", "0.19%" },
		{ 16827, "INV_Belt_23", "=q4=夜幕杀手腰带",    "=q1=#m1# =ds=#c6#", "0.15%" },
		{ 16828, "INV_Belt_06", "=q4=塞纳里奥腰带",       "=q1=#m1# =ds=#c1#", "0.16%" },
		{ 16851, "INV_Belt_28", "=q4=巨人追猎者腰带", "=q1=#m1# =ds=#c2#", "0.17%" },
		{ 16838, "INV_Belt_14", "=q4=大地之怒腰带",      "=q1=#m1# =ds=#c7#", "0.07%" },
		{ 16864, "INV_Belt_09", "=q4=力量腰带",       "=q1=#m1# =ds=#c9#", "0.16%" },
		{ 16858, "INV_Belt_27", "=q4=秩序之源腰带",     "=q1=#m1# =ds=#c4#", "0.10%" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 16799, "INV_Belt_29", "=q4=奥术师护腕",        "=q1=#m1# =ds=#c3#", "0.16%" },
		{ 16819, "INV_Pants_08", "=q4=预言臂甲",   "=q1=#m1# =ds=#c5#", "0.16%" },
		{ 16804, "INV_Bracer_07", "=q4=恶魔之心护腕",       "=q1=#m1# =ds=#c8#", "0.16%" },
		{ 16825, "INV_Bracer_02", "=q4=夜幕杀手护腕",  "=q1=#m1# =ds=#c6#", "0.17%" },
		{ 16830, "INV_Bracer_03", "=q4=塞纳里奥护腕",       "=q1=#m1# =ds=#c1#", "0.17%" },
		{ 16850, "INV_Bracer_17", "=q4=巨人追猎者护腕", "=q1=#m1# =ds=#c2#", "0.18%" },
		{ 16840, "INV_Pants_03", "=q4=大地之怒护腕",       "=q1=#m1# =ds=#c7#", "0.06%" },
		{ 16861, "INV_Bracer_19", "=q4=力量护腕",       "=q1=#m1# =ds=#c9#", "0.16%" },
		{ 16857, "INV_Bracer_18", "=q4=秩序之源护腕",     "=q1=#m1# =ds=#c4#", "0.11%" },
		};

    MCRANDOMBOSSDROPPS = {
	    { 18264, "INV_Scroll_05", "=q3=设计图:元素磨刀石", "=ds=#p2# #m14#", "1.02%" },
	    { 18262, "INV_Stone_02", "=q2=元素磨刀石",         "=ds=#e12#" },
	    { 0,"","","" },
	    { 18292, "INV_Scroll_05", "=q3=结构图:火核狙击步枪", "=ds=#p5# #m14#", "0.96%" },
	    { 18282, "INV_Weapon_Rifle_05", "=q4=火核狙击步枪",      "=ds=#w5#" },
	    { 0,"","","" },
	    { 18291, "INV_Scroll_05", "=q3=结构图:力反馈盾牌",     "=ds=#p5# #m14#", "0.92%" },
        { 18168, "Spell_Arcane_PortalDarnassus", "=q4=力反馈盾牌", "=ds=#w8#" },
        { 0,"","","" },
        { 18290, "INV_Scroll_05", "=q3=结构图: 比兹尼克 247x128 精确瞄准镜", "=ds=#p5# #m14#", "0.11%" },
        { 18283, "INV_Misc_Spyglass_02", "=q3=比兹尼克 247x128 精确瞄准镜",     "=ds=#e13#" },
        { 0,"","","" },
	    { 18259, "INV_Misc_Note_01", "=q3=公式: 附魔武器-法术能量", "=ds=#p4# #m14#", "0.85%" },
	    { 0,"","","" },
        { 0,"","","" },
	    { 18252, "INV_Scroll_05", "=q3=图样: 熔火护甲片", "=ds=#p7# #m14#", "0.85%" },
	    { 18251, "INV_Misc_ArmorKit_05", "=q3=熔火护甲片",   "=ds=#e12#" },
	    { 0,"","","" },
	    { 18265, "INV_Scroll_05", "=q3=图样: 光芒护腕", "=ds=#p8# #m14#", "0.72%" },
	    { 18263, "INV_Bracer_09", "=q4=光芒护腕",          "=ds=#s8#, #a1#" },
	    { 0,"","","" },
	    { 21371, "INV_Scroll_05", "=q3=图样: 熔火恶魔布包",       "=ds=#p8# #m14#", "0.33%" },
	    { 21342, "INV_Misc_Bag_CoreFelclothBag", "=q4=熔火恶魔布包", "=ds=#m11# #e10# =q1=#m1# #c8#" },
	    { 0,"","","" },
	    { 18257, "INV_Scroll_05", "=q3=配方: 特效活力药水", "=ds=#p1# #m14#", "0.76%" },
        { 18253, "INV_Potion_47", "=q1=特效活力药水",         "=ds=#e1#" },
	    { 0,"","","" },
        { 18260, "INV_Misc_Note_01", "=q3=公式: 附魔武器-治疗能力", "=ds=#p4# #m14#", "0.75%" },
	    };

	-------------------
	-- Onyxia's Lair --
	-------------------

	Onyxia = {
	    { 16914, "INV_Helmet_70", "=q4=灵风头冠",       "=q1=#m1# =ds=#c3#", "14.09%" },
	    { 16921, "INV_Helmet_24", "=q4=卓越之环",  "=q1=#m1# =ds=#c5#", " 13.39%" },
	    { 16929, "INV_Helmet_08", "=q4=复仇骨帽",       "=q1=#m1# =ds=#c8#", " 13.54%" },
		{ 16900, "INV_Helmet_09", "=q4=怒风头巾",        "=q1=#m1# =ds=#c1#", " 13.08%" },
		{ 16908, "INV_Helmet_41", "=q4=血牙头巾",         "=q1=#m1# =ds=#c6#", " 13.21%" },
		{ 16939, "INV_Helmet_05", "=q4=巨龙追猎者头盔",   "=q1=#m1# =ds=#c2#", " 13.91%" },
		{ 16947, "INV_Helmet_69", "=q4=无尽风暴头盔",   "=q1=#m1# =ds=#c7#", "  4.86%" },
		{ 16963, "INV_Helmet_71", "=q4=愤怒头盔",          "=q1=#m1# =ds=#c9#", " 13.65%" },
		{ 16955, "INV_Helmet_74", "=q4=审判头冠",        "=q1=#m1# =ds=#c4#", "  8.64%" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 18705, "Spell_Holy_DispelMagic", "=q4=成年黑龙的肌腱", "=q1=#m1# =ds=#c2# =q1=#m3#", "    24.53%" },
		{ 18713, "INV_Weapon_Bow_01", "=q4=伦鲁迪洛尔,上古守护者的长弓", "=q1=#m4# =ds=#w2#" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 17078, "INV_Misc_Cape_16", "=q4=萨菲隆斗篷",              "=ds=#s4#", "15.28%" },
		{ 17068, "INV_Axe_09", "=q4=死亡召唤者",                       "=ds=#h1#, #w1#", "4.31%" },
		{ 17075, "INV_Sword_18", "=q4=放血者维斯卡格",          "=ds=#h1#, #w10#", " 4.00%" },
		{ 17067, "INV_Misc_Book_07", "=q4=上古角石魔典", "=ds=#s15#", "  16.07%" },
		{ 18813, "INV_Jewelry_Ring_13", "=q4=禁锢之戒",           "=ds=#s13#", "  16.28%" },
		{ 17064, "INV_Misc_MonsterScales_15", "=q4=龙鳞碎片",  "=ds=#s14#", "   4.08%" },
		{ 18205, "INV_Belt_12", "=q4=艾斯卡达尔的项圈",                "=ds=#s2#", "  14.88%" },
		{ 0,"","","" },
		{ 17966,"INV_Misc_Bag_22","=q2=奥妮克希亚皮袋","=ds=#e10#", "100%"},
		{ 0,"","","" },
		{ 0,"","","" },
		{ 18423, "INV_Misc_Head_Dragon_01", "=q4=奥妮克希亚的头颅",      "=ds=#m2#", "100%" },
		{ 18403, "INV_Jewelry_Ring_27", "=q4=屠龙者的徽记", "=q1=#m4# =ds=#s13#" },
		{ 18404, "INV_Jewelry_Necklace_09", "=q4=奥妮克希亚龙牙坠饰", "=q1=#m4# =ds=#s2#" },
		{ 18406, "Spell_Shadow_LifeDrain", "=q4=奥妮克希亚龙血护符", "=q1=#m4# =ds=#s14#" },
		};

	---------------
	-- Zul'Gurub --
	---------------

    ZGJeklik = {
		{ 19717, "INV_Bracer_18", "=q4=原始哈卡莱护臂", 	"=ds=#m3#", " 11.41%" },
		{ 19716, "INV_Bracer_05", "=q4=原始哈卡莱护腕", 	"=ds=#m3#", " 11.02%" },
		{ 19718, "INV_Bracer_14", "=q4=原始哈卡莱直柱", 	"=ds=#m3#", " 10.84%" },
		{ 19721, "INV_Shoulder_19", "=q4=原始哈卡莱披肩", 	"=ds=#m3#", "  5.89%" },
		{ 19720, "INV_Belt_07", "=q4=原始哈卡莱腰带",         "=ds=#m3#", "  5.80%" },
		{ 19719, "INV_Belt_12", "=q4=原始哈卡莱束带", 		"=ds=#m3#", "  5.56%" },
		{ 19724, "INV_Chest_Chain_12", "=q4=原始哈卡莱之盾", 	"=ds=#m3#", "  2.33%" },
		{ 19723, "INV_Shirt_07", "=q4=原始哈卡莱套索", 	    "=ds=#m3#", "  2.32%" },
		{ 19722, "INV_Banner_01", "=q4=原始哈卡莱徽章", 	    "=ds=#m3#", "  2.17%" },
        { 0,"","","" },
        { 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
        { 19918, "INV_Mace_19", "=q4=耶克里克之锤", 		"=ds=#h2#, #w6#", "	3.96%" },
        { 0,"","","" },
        { 19928, "INV_Shoulder_09", "=q3=万灵护肩",      "=ds=#s3#, #a2#", "  3.39%" },
		{ 20262, "INV_Boots_Chain_11", "=q3=海怒长靴",          "=ds=#s12#, #a3#", "  4.31%" },
        { 20265, "INV_Boots_Plate_03", "=q3=和平守护者长靴",     "=ds=#s12#, #a4#", "  6.99%" },
        { 19915, "INV_Shield_22", "=q3=祖利安防御者",            "=ds=#w8#", " 11.36%" },
		{ 19923, "INV_Jewelry_Necklace_03", "=q3=耶克里克的蛋白石护符", "=ds=#s2#", " 12.22%" },
		{ 19920, "INV_Jewelry_Ring_47", "=q3=首领指环", "=ds=#s13#", "11.89%" },
		};

	ZGVenoxis = {
		{ 19716, "INV_Bracer_05", "=q4=原始哈卡莱护腕", 	"=ds=#m3#", "11.01%" },
		{ 19718, "INV_Bracer_14", "=q4=原始哈卡莱直柱", 	"=ds=#m3#", "10.55%" },
		{ 19717, "INV_Bracer_18", "=q4=原始哈卡莱护臂", 	"=ds=#m3#", " 10.18%" },
		{ 19720, "INV_Belt_07", "=q4=原始哈卡莱腰带",         "=ds=#m3#", " 5.93%" },
		{ 19721, "INV_Shoulder_19", "=q4=原始哈卡莱披肩", 	"=ds=#m3#", " 5.67%" },
		{ 19719, "INV_Belt_12", "=q4=原始哈卡莱束带", 		"=ds=#m3#", " 5.52%" },
		{ 19722, "INV_Banner_01", "=q4=原始哈卡莱徽章",    	"=ds=#m3#", " 2.18%" },
		{ 19723, "INV_Shirt_07", "=q4=原始哈卡莱套索", 	    "=ds=#m3#", " 2.02%" },
		{ 19724, "INV_Chest_Chain_12", "=q4=原始哈卡莱之盾", 	"=ds=#m3#", " 2.00%" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
        { 0,"","","" },
        { 19903, "INV_Weapon_Shortblade_31", "=q4=温诺希斯之牙", "=ds=#h3#, #w4#", " 3.68%" },
        { 19904, "INV_Chest_Plate08", "=q4=符文血甲", "=ds=#s5#, #a3#", "3.70%" },
		{ 0,"","","" },
        { 19907, "INV_Misc_Cape_10", "=q3=祖利安虎皮披风", 	"=ds=#s4#", "12.09%" },
		{ 19906, "INV_Boots_Chain_04", "=q3=浴血软鞋", "=ds=#s12#, #a2#", " 11.36%" },
		{ 19900, "INV_Axe_34", "=q3=祖利安石斧",           "=ds=#h2#, #w1#", "11.89%" },
		{ 19905, "INV_Jewelry_Ring_46", "=q3=赞吉尔指环", 	    "=ds=#s13#", "  6.99%" },
		};

	ZGMarli = {
		{ 19720, "INV_Belt_07", "=q4=原始哈卡莱腰带",         "=ds=#m3#", "13.69%" },
		{ 19719, "INV_Belt_12", "=q4=原始哈卡莱束带", 		"=ds=#m3#", "13.69%" },
		{ 19721, "INV_Shoulder_19", "=q4=原始哈卡莱披肩", 	"=ds=#m3#", "13.64%" },
		{ 19718, "INV_Bracer_14", "=q4=原始哈卡莱直柱", 	"=ds=#m3#", " 6.55%" },
		{ 19716, "INV_Bracer_05", "=q4=原始哈卡莱护腕", 	"=ds=#m3#", " 6.49%" },
		{ 19717, "INV_Bracer_18", "=q4=原始哈卡莱护臂", 	"=ds=#m3#", " 6.31%" },
		{ 19722, "INV_Banner_01", "=q4=原始哈卡莱徽章", 	    "=ds=#m3#", " 2.56%" },
		{ 19723, "INV_Shirt_07", "=q4=原始哈卡莱套索",   	"=ds=#m3#", " 2.55%" },
		{ 19724, "INV_Chest_Chain_12", "=q4=原始哈卡莱之盾", 	"=ds=#m3#", " 2.30%" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
        { 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
        { 20032, "INV_Chest_Cloth_25", "=q4=仪祭海袍", "=ds=#s5#, #a1#", "4.46%" },
		{ 19927, "INV_Wand_06", "=q4=玛尔里之触", 		"=ds=#w12#", "4.35%" },
		{ 0,"","","" },
        { 19919, "INV_Boots_Chain_04", "=q3=血污胫甲",  "=ds=#s12#, #a3#", "11.89%" },
		{ 19930, "INV_ZulGurubTrinket", "=q3=玛尔里之眼", 	    "=ds=#s14#", "12.09%" },
		{ 19871, "INV_Jewelry_Necklace_21", "=q3=保护之符", "=ds=#s2#", "11.36%" },
		{ 19925, "INV_Jewelry_Ring_44", "=q3=巨魔族长指环", 			"=ds=#s13#", " 6.99%" },
		};

    ZGMandokir = {
        { 19723, "INV_Shirt_07", "=q4=原始哈卡莱套索",          "=ds=#m3#", " 12.94%" },
        { 19724, "INV_Chest_Chain_12", "=q4=原始哈卡莱之盾",      "=ds=#m3#", " 12.07%" },
        { 19722, "INV_Banner_01", "=q4=原始哈卡莱徽章",          "=ds=#m3#", " 11.56%" },
        { 19720, "INV_Belt_07", "=q4=原始哈卡莱腰带",              "=ds=#m3#", "  6.65%" },
        { 19719, "INV_Belt_12", "=q4=原始哈卡莱束带",            "=ds=#m3# ", " 6.55%" },
        { 19721, "INV_Shoulder_19", "=q4=原始哈卡莱披肩",         "=ds=#m3# ", " 6.52%" },
        { 19716, "INV_Bracer_05", "=q4=原始哈卡莱护腕",        "=ds=#m3# ", " 2.98%" },
        { 19718, "INV_Bracer_14", "=q4=原始哈卡莱直柱",       "=ds=#m3# ", " 2.65%" },
        { 19717, "INV_Bracer_18", "=q4=原始哈卡莱护臂",       "=ds=#m3# ", " 2.48%" },
        { 0,"","","" },
        { 22637,"INV_ZulGurubTrinket","=q3=原始哈卡莱神像","=ds=#m3#" },
        { 0,"","","" },
        { 0,"","","" },
        { 0,"","","" },
        { 0,"","","" },
        { 19866, "INV_Sword_55", "=q4=哈卡莱战刃",         "=ds=#h4#, #w10#", " 3.96%" },
        { 19874, "INV_Weapon_Halberd_12", "=q4=惩戒长戟",     "=ds=#w7#", "  6.35%" },
        { 19867, "INV_Sword_54", "=q4=血领主庇护者",            "=ds=#h3#, #w10#", " 5.83%" },
        { 20038, "INV_Waepon_Bow_ZulGrub_D_01", "=q4=曼多基尔之刺", "=ds=#w2#", "  5.96%" },
        { 19872, "Ability_Mount_Raptor", "=q4=拉扎什迅猛龙",   "=ds=#e7#", " 0.43%" },
        { 0,"","","" },
        { 19895, "INV_Pants_Cloth_14", "=q3=淡血褶裙",          "=ds=#s11#, #a1#", " 13.50%" },
        { 19870, "INV_Misc_Cape_18", "=q3=哈卡莱血披风",           "=ds=#s4#", "12.54%" },
        { 19877, "INV_Pants_Mail_14", "=q3=万灵护腿",         "=ds=#s11#, #a2#", " 12.14%" },
        { 19869, "INV_Gauntlets_26", "=q3=浴血护手",         "=ds=#s9#, #a2#", "   12.87%" },
        { 19878, "INV_Shoulder_01", "=q3=浸血肩铠",        "=ds=#s9#, #a4#", "  12.31%" },
        { 19873, "INV_Jewelry_Ring_39", "=q3=督军的红色指环",  "=ds=#s13#", "  12.28%" },
        { 19893, "INV_Jewelry_Ring_46", "=q3=赞吉尔的徽记",            "=ds=#s13#", "  13.11%" },
        { 19863, "INV_Jewelry_Ring_47", "=q3=始祖徽记",         "=ds=#s13#", "  12.32%" },
        };

    ZGGrilek = {
        { 19961, "INV_Mace_04", "=q3=格里雷克的磨具", "=ds=#h1#, #w6#", "43.90%" },
        { 19962, "INV_Axe_24", "=q3=格里雷克的刻刀",   "=ds=#h2#, #w1#", "41.99%" },
        { 0,"","","" },
        { 19939, "INV_Potion_26", "=q2=格里雷克之血", "=ds=#m3#", "100%" },
        };

    ZGHazzarah = {
        { 19967, "INV_Wand_05", "=q3=心灵凋零者",   "=ds=#w12#", "45.49%" },
        { 19968, "INV_Sword_01", "=q3=烈焰惩戒者", "=ds=#h3#, #w10#", "38.37%" },
        { 0,"","","" },
        { 19942, "INV_Misc_Bandage_16", "=q2=哈扎拉尔的梦境之丝", "=ds=#m3#", "100%" },
        };

    ZGRenataki = {
        { 19963, "INV_Spear_03", "=q3=疯狂草叉",    "=ds=#w7#", "45.51%" },
        { 19964, "INV_Sword_37", "=q3=雷纳塔基的灵魂之管", "=ds=#h3#, #w10#", "40.06%" },
        { 0,"","","" },
        { 19940, "INV_Misc_MonsterFang_01", "=q2=雷纳塔基之牙", "=ds=#m3#", "100%" },
        };

    ZGWushoolay = {
        { 19965, "INV_Sword_37", "=q3=乌苏雷的火钳",                 "=ds=#h3#, #w4#", "45.21%" },
        { 19993, "INV_Waepon_Bow_ZulGrub_D_02", "=q3=噩运猎弓", "=ds=#w2#", "40.96%" },
        { 0,"","","" },
        { 19941, "INV_Misc_MonsterTail_02", "=q2=乌苏雷之鬃", "=ds=#m3#", "100%" },
        };

	ZGGahzranka = {
        { 19945, "INV_Helmet_46", "=q4=弗洛的眼罩", "=ds=#s1#, #a2#", " 8,82%" },
        { 19944, "INV_Fishingpole_02", "=q4=纳特·帕格的鱼类终结者", "=ds=#h2#, #w9#", " 2.39%" },
        { 0,"","","" },
        { 19946, "INV_Spear_04", "=q3=提古勒的鱼叉", "=ds=#w7#", "29.22%" },
        { 19947, "INV_Gizmo_09", "=q3=纳特·帕格的卷尺", "=ds=#s14#", " 28.20%" },
        { 0,"","","" },
        { 22739, "INV_Misc_Book_07", "=q3=秘典：变形术：龟", "=ds=#e20# #m1# #c3#" },
        };

	ZGThekal = {
        { 19720, "INV_Belt_07", "=q4=原始哈卡莱腰带",        "=ds=#m3#", " 14.95%" },
        { 19721, "INV_Shoulder_19", "=q4=原始哈卡莱披肩",   "=ds=#m3#", " 13.74%" },
        { 19719, "INV_Belt_12", "=q4=原始哈卡莱束带",      "=ds=#m3#", " 12.95" },
        { 19716, "INV_Bracer_05", "=q4=原始哈卡莱护腕",  "=ds=#m3#", " 6.60%" },
	    { 19718, "INV_Bracer_14", "=q4=原始哈卡莱直柱", "=ds=#m3#", " 6.56%" },
	    { 19717, "INV_Bracer_18", "=q4=原始哈卡莱护臂", "=ds=#m3#", " 6.45%" },
	    { 0,"","","" },
	    { 0,"","","" },
	    { 0,"","","" },
        { 0,"","","" },
        { 0,"","","" },
        { 0,"","","" },
	    { 0,"","","" },
	    { 0,"","","" },
        { 0,"","","" },
        { 19897, "INV_Boots_Cloth_09", "=q4=背叛者长靴", "=ds=#s12#, #a1#", " 5.83%" },
	    { 19896, "INV_Weapon_Hand_01", "=q4=塞卡尔之握", "=ds=#h3#, #w13#", " 4.23%" },
	    { 19902, "Ability_Mount_JungleTiger", "=q4=迅捷祖利安猛虎", "=ds=#e7#", " 0.70%" },
	    { 0,"","","" },
        { 19899, "INV_Pants_Cloth_14", "=q3=仪式护腿", "=ds=#s11#, #a1#", "  13.41%" },
	    { 20260, "INV_Pants_Mail_06", "=q3=海怒护腿",       "=ds=#s11#, #a3#", " 4.30%" },
	    { 20266, "INV_Pants_Plate_04", "=q3=和平守护者护腿",  "=ds=#s11#, #a4#", "    8.69%" },
	    { 19901, "INV_Sword_35", "=q3=祖利安切割者",               "=ds=#h1#, #w10#", "  13.36%" },
	    { 19898, "INV_Jewelry_Ring_44", "=q3=巨魔族长徽记",          "=ds=#s13#", "  13.65%" },
        };

	ZGArlokk = {
	    { 19721, "INV_Shoulder_19", "=q4=原始哈卡莱披肩",     "=ds=#m3#", "15.49%" },
	    { 19720, "INV_Belt_07", "=q4=原始哈卡莱腰带",          "=ds=#m3#", "12.52%" },
	    { 19719, "INV_Belt_12", "=q4=原始哈卡莱束带",        "=ds=#m3#", " 13.17%" },
	    { 19716, "INV_Bracer_05", "=q4=原始哈卡莱护腕",    "=ds=#m3#", "  6.94%" },
	    { 19717, "INV_Bracer_18", "=q4=原始哈卡莱护臂",   "=ds=#m3#", "  6.65%" },
	    { 19718, "INV_Bracer_14", "=q4=原始哈卡莱直柱",   "=ds=#m3#", "  6.21%" },
	    { 19722, "INV_Banner_01", "=q4=原始哈卡莱徽章",      "=ds=#m3#", "  2.75%" },
	    { 19723, "INV_Shirt_07", "=q4=原始哈卡莱套索",      "=ds=#m3#", "   2.60%" },
	    { 19724, "INV_Chest_Chain_12", "=q4=原始哈卡莱之盾",  "=ds=#m3#", "   2.41%" },
	    { 0,"","","" },
	    { 0,"","","" },
	    { 0,"","","" },
        { 0,"","","" },
	    { 0,"","","" },
	    { 0,"","","" },
        { 19910, "INV_Weapon_Hand_01", "=q4=娅尔罗之握",       "=ds=#h4#, #w13#", "  3.62%" },
	    { 19909, "INV_Staff_35", "=q4=娅尔罗的意志",             "=ds=#h2#, #w9#", "  5.14%" },
        { 0,"","","" },
        { 19913, "INV_Boots_Plate_06", "=q3=浸血胫甲",   "=ds=#s12#, #a4#", "  13.29%" },
	    { 19912, "INV_Jewelry_Ring_39", "=q3=督军的玛瑙指环", "=ds=#s13#", "  13.95%" },
	    { 19922, "INV_Misc_Bone_DwarfSkull_01", "=q3=娅尔罗的巫毒棒", "=ds=#s15#", "13.66%" },
	    { 19914, "INV_Misc_Bag_14", "=q3=豹皮背包",        "=ds=#e10#", " 14.03%" },
        };

	ZGJindo = {
        { 19723, "INV_Shirt_07", "=q4=原始哈卡莱套索",     "=ds=#m3#", " 13.56%" },
	    { 19722, "INV_Banner_01", "=q4=原始哈卡莱徽章",     "=ds=#m3#", "13.48%" },
 	    { 19724, "INV_Chest_Chain_12", "=q4=原始哈卡莱之盾", "=ds=#m3#", " 12.09%" },
	    { 19721, "INV_Shoulder_19", "=q4=原始哈卡莱披肩",    "=ds=#m3#", "  7.30%" },
	    { 19719, "INV_Belt_12", "=q4=原始哈卡莱束带",       "=ds=#m3#", "  6.37%" },
	    { 19720, "INV_Belt_07", "=q4=原始哈卡莱腰带",         "=ds=#m3#", "  6.10%" },
	    { 19716, "INV_Bracer_05", "=q4=原始哈卡莱护腕",   "=ds=#m3#", "  2.85%" },
	    { 19717, "INV_Bracer_18", "=q4=原始哈卡莱护臂",  "=ds=#m3#", "  2.70%" },
	    { 19718, "INV_Bracer_14", "=q4=原始哈卡莱直柱",  "=ds=#m3#", "  2.36%" },
        { 0,"","","" },
        { 22637,"INV_ZulGurubTrinket","=q3=原始哈卡莱神像","=ds=#m3#" },
        { 0,"","","" },
        { 0,"","","" },
        { 0,"","","" },
        { 0,"","","" },
        { 19884, "INV_Staff_33", "=q4=金度的裁决",                "=ds=#h2#, #w9#", "  8.36%" },
	    { 19890, "INV_Mace_17", "=q4=金度的妖器",                    "=ds=#h3#, #w6#", "   8.08%" },
	    { 19891, "INV_Misc_Bag_10_Black", "=q4=金度的厄运袋", "=ds=#s15#", "   7.70%" },
	    { 19885, "INV_Jewelry_Ring_45", "=q4=金度的邪眼",          "=ds=#s2#", "   6.82%" },
	    { 0,"","","" },
        { 19888, "INV_Misc_Cape_21", "=q3=督军的拥抱",     "=ds=#s4#", " 12.72%" },
	    { 19886, "INV_Mask_02", "=q3=妖术师头巾",          "=ds=#s1#, #a1#", " 12.11%" },
	    { 19929, "INV_Gauntlets_16", "=q3=淡血手套",     "=ds=#s9#, #a1#", " 11.75%" },
	    { 19889, "INV_Pants_Leather_09", "=q3=浴血护腿", "=ds=#s11#, #a2#", "  11.97%" },
	    { 19892, "INV_Boots_Chain_13", "=q3=万灵长靴",          "=ds=#s12#, #a2#", "  12.28%" },
	    { 19875, "INV_Helmet_39", "=q3=血污头巾",             "=ds=#s1#, #a3#", "  13.73%" },
	    { 19887, "INV_Pants_Mail_09", "=q3=血污腿甲",    "=ds=#s11#, #a3#", "  11.11%" },
	    { 19894, "INV_Gauntlets_14", "=q3=浸血护手",      "=ds=#s9#, #a4#", "  12.93%" },
	    };

	ZGHakkar = {
	    { 19857, "INV_Misc_Cape_22", "=q4=吞噬披风",       "=ds=#s4#", "  11.65%" },
	    { 20257, "INV_Gauntlets_30", "=q4=海怒护手",          "=ds=#s9#, #a3#", "  4.11%" },
	    { 19855, "INV_Pants_Plate_21", "=q4=浸血腿甲",    "=ds=#s11#, #a4#", " 10.52%" },
	    { 20264, "INV_Gauntlets_10", "=q4=和平守护者护手",      "=ds=#s9#, #a4#", "   7.37%" },
	    { 0, "", "", "", "" },
	    { 19864, "INV_Sword_18", "=q4=血之召唤者",                    "=ds=#h3#, #w10#", " 7.69%" },
	    { 19859, "INV_Weapon_Shortblade_30", "=q4=无面者之牙", "=ds=#h1#, #w4#", " 7.33%" },
	    { 19854, "INV_Sword_55", "=q4=辛洛斯,诸界的毁灭者",  "=ds=#h2#, #w10#", " 6.78%" },
	    { 19852, "INV_Axe_35", "=q4=上古哈卡莱之斧",        "=ds=#h1#, #w1#", "  6.62%" },
	    { 19865, "INV_Sword_55", "=q4=哈卡莱战刃",        "=ds=#h3#, #w10#", "  3.67%" },
	    { 19853, "INV_Weapon_Rifle_10", "=q4=古拉巴什矮人摧毁者", "=ds=#w5#", "  6.12%" },
	    { 19861, "INV_Wand_09", "=q4=混乱之触",                  "=ds=#w12#", " 7.24%" },
	    { 19862, "INV_Shield_12", "=q4=血神徽记",        "=ds=#w8#", "9.99%" },
	    { 19876, "INV_Jewelry_Necklace_19", "=q4=堕灵者项链", "=ds=#s2#", "  10.11%" },
	    { 19856, "INV_Jewelry_Necklace_22", "=q4=哈卡之眼",   "=ds=#s2#", "12.02%" },
      { 19802, "INV_Misc_Gem_Bloodstone_02", "=q4=哈卡之心",  "=ds=#m2#!", " 100.00%" },
	    { 19950, "INV_Jewelry_Necklace_13", "=q4=赞达拉英雄护符", "#m4#" },
	    { 19949, "INV_Jewelry_Necklace_13", "=q4=赞达拉英雄勋章",  "#m4#" },
	    { 19948, "INV_Jewelry_Necklace_13", "=q4=赞达拉英雄徽记",      "#m4#" },
	    };

    ZGShared = {
        { 22721, "INV_Jewelry_Ring_16", "=q4=惩戒指环", "=ds=#s13#" };
        { 22722, "INV_Jewelry_Ring_20", "=q4=古拉巴什狂暴者徽记", "=ds=#s13#" };
        { 0, "", "", "", "" },
        { 22711, "INV_Misc_Cape_16", "=q3=哈卡莱崇拜者披风", "=ds=#s4#" },
        { 22716, "INV_Belt_01", "=q3=无尽潜能腰带", "=ds=#s10#, #a1#" },
        { 22720, "INV_Helmet_61", "=q3=祖利安头饰", "=ds=#s1#, #a1#" },
        { 22715, "INV_Gauntlets_10", "=q3=被折磨者的手套", "=ds=#s9#, #a3#" },
        { 22712, "INV_Misc_Cape_16", "=q3=部族之力", "=ds=#s4#" },
        { 22718, "INV_Helmet_41", "=q3=浸血面具", "=ds=#s1#, #a2#" },
        { 22714, "INV_Gauntlets_31", "=q3=祭祀护手", "=ds=#s9#, #a4#" },
        { 22713, "INV_Waepon_Bow_ZulGrub_D_01", "=q3=祖利安典礼权杖", "=ds=#h1#, #w6#" },
        };    
        
     ZGTrash = {
        { 20261, "INV_Belt_26", "=q3=暗影豹皮腰带", "=ds=#s10#, #a2#" },
        { 20259, "INV_Gauntlets_25", "=q3=暗影豹皮手套", "=ds=#s9#, #a2#" },
        { 20263, "INV_Helmet_25", "=q3=古拉巴什头盔", "=ds=#s1#, #a4#" },
        { 19908, "INV_Mace_08", "=q3=惩击节杖", "=ds=#h1# #w6#" },
        { 20258, "INV_Staff_34", "=q3=祖利安仪祭法杖", "=ds=#h2# #w9#" },
        { 19921, "INV_Axe_08", "=q3=[随机前缀]之祖利安利斧", "=ds=#h1# #w1# =q1=随机前缀" },
        };
     
     ZGEnchants = {
        { 19790, "Spell_Nature_Reincarnation", "=q3=灵魂的安抚", "=ds=#c1#" },
        { 19788, "Spell_Shadow_ImpPhaseShift", "=q3=不祥的妖术", "=ds=#c8#" },
        { 19787, "Spell_Shadow_DetectLesserInvisibility", "=q3=魔法的视域", "=ds=#c3#" },
        { 19786, "Spell_Nature_Purge", "=q3=巫毒的警觉", "=ds=#c7#" },
        { 19789, "Spell_Holy_HolyProtection", "=q3=预言的光环", "=ds=#c5#" },
        { 19784, "Spell_Shadow_ScourgeBuild", "=q3=死亡的拥抱", "=ds=#c6#" },
        { 19785, "Spell_Nature_ForceOfNature", "=q3=猎鹰的召唤", "=ds=#c2#" },
        { 19782, "Spell_Holy_SealOfWrath", "=q3=力量的证明", "=ds=#c9#" },
        { 19783, "Spell_Holy_PrayerOfHealing", "=q3=调和的徽记", "=ds=#c4#" },
        { 0, "", "", "", "" },
        { 0, "", "", "", "" },
        { 0, "", "", "", "" },
        { 0, "", "", "", "" },
        { 0, "", "", "", "" },
        { 0, "", "", "", "" },
        { 20077, "INV_Misc_ArmorKit_08", "=q3=赞达拉力量徽记", "=ds=#s3# #e11#" },
        { 20076, "INV_Jewelry_Ring_46", "=q3=赞达拉魔精徽记", "=ds=#s3# #e11#" },
        { 20078, "Spell_Holy_PowerWordShield", "=q3=赞达拉宁静徽记", "=ds=#s3# #e11#" },
        { 0, "", "", "", "" },
        { 22635, "Spell_Nature_SpiritArmor", "=q3=野性戒卫", "=ds=#s1#/#s11# #e11#" },
        };
        
	----------------------------
	-- The Ruins of Ahn'Qiraj --
	----------------------------

	AQ20Kurinnaxx = {
	    { 21499, "INV_Chest_Cloth_17", "=q4=流沙外套", "=ds=#s5#, #a1#", "7.34%"},
		{ 21498, "INV_Weapon_ShortBlade_12", "=q4=其拉祭祀匕首", "=ds=#h1#, #w4#", "7.53%"},
		{ 0,"","","" },
		{ 21500, "INV_Belt_05", "=q3=裁决腰带",             "=ds=#s10#, #a1#", "14.84%" },
		{ 21501, "INV_Gauntlets_24", "=q3=固化异种虫皮手套", "=ds=#s9#, #a2#", "12.91%" },
		{ 21502, "INV_Bracer_19", "=q3=沙漠掠夺者护臂",           "=ds=#s8#, #a3#", "13.79%" },
		{ 21503, "INV_Belt_13", "=q3=沙漠掠夺者腰带",             "=ds=#s10#, #a4#", "14.38%" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 20889, "INV_Bracer_18", "=q3=其拉帝王披风",                  "#m3#", "30.83%" },
		{ 20885, "INV_Qiraj_DrapeMartial", "=q3=其拉军用披风",       "#m3#", "30.25%" },
		{ 20884, "INV_Qiraj_RingMagisterial", "=q3=其拉将领戒指", "#m3#", "7.98%" },
		{ 20888, "INV_Qiraj_RingCeremonial", "=q3=其拉典礼戒指",   "#m3#", "7.80%" },
		};

	AQ20CAPTIAN = {
	    { 21810, "INV_Boots_Cloth_05", "=q3=游荡牧民之靴", "=ds=#s12#, #a1#", "3.11%" },
        { 21806, "INV_Hammer_04", "=q3=其拉威严之锤", "=ds=#h2#, #w6#", "3.04%" },
        { 21809, "INV_Jewelry_Necklace_14", "=q3=遗忘虫群之怒", "=ds=#s2#", "3.20%" },
	    };

	AQ20Rajaxx = {
		{ 21493, "INV_Boots_08", "=q4=前锋之靴",   "=ds=#s12#, #a2#", "8.13%" },
		{ 21492, "INV_Sword_56", "=q4=其拉屠戮者", "=ds=#h2#, #w10#", "10.04%" },
		{ 0,"","","" },
		{ 21496, "INV_Bracer_13", "=q3=其拉指挥官护腕",            "=ds=#s8#, #a1#", "15.79%" },
		{ 21494, "INV_Belt_25", "=q3=南风之握",                      "=ds=#s10#, #a2#", "15.13%" },
		{ 21497, "INV_Boots_Chain_11", "=q3=其拉将军长靴",     "=ds=#s12#, #a3#", "15.45%" },
		{ 21495, "INV_Pants_Plate_15", "=q3=其拉指挥官腿甲", "=ds=#s11#, #a4#", "15.47" },
		{ 0, "", "", "" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 20889, "INV_Bracer_18", "=q3=其拉帝王披风",                  "#m3#", "36.51%" },
		{ 20885, "INV_Qiraj_DrapeMartial", "=q3=其拉军用披风",       "#m3#", "33.97%" },
		{ 20884, "INV_Qiraj_RingMagisterial", "=q3=其拉将领戒指", "#m3#", "8.82%" },
		{ 20888, "INV_Qiraj_RingCeremonial", "=q3=其拉典礼戒指",   "#m3#", "8.56%" },
		};

	AQ20Moam = {
	    { 21472, "INV_Helmet_62", "=q4=尘风头巾",                  "=ds=#s1#, #a1#", "7.76%" },
	    { 21467, "INV_Chest_Leather_07", "=q4=厚重异种虫胸甲", "=ds=#s5#, #a2#", "6.76%" },
	    { 21479, "INV_Gauntlets_31", "=q4=恒定护手",    "=ds=#s9#, #a4#", "7.12%" },
		{ 21471, "INV_Mace_21", "=q4=狂暴专注之爪",     "=ds=#s15#", "7.39%" },
		{ 0,"","","" },
		{ 21468, "INV_Shoulder_25", "=q3=玛兹纳迪尔衬肩",           "=ds=#s3#, #a1#", "15.86%" },
		{ 21470, "INV_Misc_Cape_16", "=q3=救世主披风",          "=ds=#s4#", "14.23%" },
		{ 21474, "INV_Shoulder_29", "=q3=几丁质护肩",      "=ds=#s3#, #a2#", "15.25%" },
		{ 21469, "INV_Gauntlets_05", "=q3=南风护手",       "=ds=#s9#, #a2#", "15.28%" },
		{ 21455, "INV_Helmet_01", "=q3=南风头盔",                  "=ds=#s1#, #a2#", "14.08%" },
		{ 21476, "INV_Pants_Mail_15", "=q3=黑曜石鳞片护腿",    "=ds=#s11#, #a3#", "6.81%" },
		{ 21475, "INV_Pants_Plate_01", "=q3=毁灭者腿甲", "=ds=#s11#, #a4#", "10.39%" },
		{ 21477, "INV_Jewelry_Ring_AhnQiraj_04", "=q3=愤怒之戒",     "=ds=#s13#", "14.42%" },
		{ 21473, "INV_Misc_Eye_01", "=q3=莫阿姆之眼",                   "=ds=#s14#", "14.74%" },
		{ 0, "", "", "" },
		{ 20886, "INV_Qiraj_HiltSpiked", "=q4=其拉尖刺刀柄",           "#m3#", "36.38%" },
		{ 20890, "INV_Qiraj_HiltOrnate", "=q4=其拉装饰刀柄",           "#m3#", "33.16%" },
		{ 20884, "INV_Qiraj_RingMagisterial", "=q3=其拉将领戒指", "#m3#", "7.56%" },
		{ 20888, "INV_Qiraj_RingCeremonial", "=q3=其拉典礼戒指",   "#m3#", "8.34%" },
        { 0, "", "", "" },
        { 22220, "INV_Scroll_05", "=q3=设计图：毁灭者的黑暗之握", "=ds=#p2# #m14#", "4.11%" },
        { 22194, "INV_Gauntlets_31", "=q4=毁灭者的黑暗之握", "=ds=#s9#, #a3#" },
		};

	AQ20Buru = {
		{ 21487, "INV_Gauntlets_12", "=q4=粘液鳞片护手", "=ds=#s9#, #a3#", "2.64%" },
		{ 21486, "INV_Gauntlets_30", "=q4=虫群手套",    "=ds=#s9#, #a4#", "5.22%" },
		{ 21485, "INV_Shield_22", "=q4=布鲁的颅骨碎片",     "=ds=#w8#", "7.88%" },
		{ 0,"","","" },
		{ 21489, "INV_Boots_Cloth_05", "=q3=流沙跋涉者",                    "=ds=#s12#, #a1#", "15.95%" },
		{ 21491, "INV_Bracer_03", "=q3=缀鳞吞咽者护腕",             "=ds=#s8#, #a2#", "16.51%" },
		{ 21490, "INV_Boots_Plate_04", "=q3=粘液长靴",                       "=ds=#s12#, #a4#", "15.99%" },
		{ 21488, "INV_Misc_AhnQirajTrinket_02", "=q3=虫刺雕像", "=ds=#s14#", "17.22%" },
		{ 0, "", "", "" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 20886, "INV_Qiraj_HiltSpiked", "=q4=其拉尖刺刀柄",           "#m3#", "8.31%" },
		{ 20890, "INV_Qiraj_HiltOrnate", "=q4=其拉装饰刀柄",           "#m3#", "8.98%" },
		{ 20889, "INV_Bracer_18", "=q3=其拉帝王披风",                  "#m3#", "9.77%" },
		{ 20885, "INV_Qiraj_DrapeMartial", "=q3=其拉军用披风",       "#m3#", "9.84%" },
		{ 20884, "INV_Qiraj_RingMagisterial", "=q3=其拉将领戒指", "#m3#", "26.98%" },
		{ 20888, "INV_Qiraj_RingCeremonial", "=q3=其拉典礼戒指",   "#m3#", "25.58%" },
		};

	AQ20Ayamiss = {
		{ 21479, "INV_Gauntlets_31", "=q4=恒定护手", "=ds=#s9#, #a4#", "6.18%" },
		{ 21466, "INV_Mace23", "=q4=阿亚米斯之刺",               "=ds=#h3#, #w6#", "2.06%" },
		{ 21478, "INV_Weapon_Bow_13", "=q4=紧绷肌腱之弓",         "=ds=#w2#", "10.14%" },
		{ 0,"","","" },
		{ 21484, "INV_Helmet_15", "=q3=再生头盔",                        "=ds=#s1#, #a2#", "15.85%" },
		{ 21480, "INV_Gauntlets_10", "=q3=缀鳞异种虫护手",            "=ds=#s9#, #a3#", "17.10%" },
		{ 21482, "INV_Boots_Chain_02", "=q3=灼沙长靴",           "=ds=#s12#, #a3#", "4.92%" },
		{ 21481, "INV_Boots_Plate_05", "=q3=沙漠保护者长靴",      "=ds=#s12#, #a4#", "11.08%" },
		{ 21483, "INV_Jewelry_Ring_AhnQiraj_05", "=q3=沙漠强风之戒", "=ds=#s13#", "16.32%" },
		{ 0, "", "", "" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 20886, "INV_Qiraj_HiltSpiked", "=q4=其拉尖刺刀柄",           "#m3#", "8.24%" },
		{ 20890, "INV_Qiraj_HiltOrnate", "=q4=其拉装饰刀柄",           "#m3#", "8.21%" },
		{ 20889, "INV_Bracer_18", "=q3=其拉帝王披风",                  "#m3#", "8.85%" },
		{ 20885, "INV_Qiraj_DrapeMartial", "=q3=其拉军用披风",       "#m3#", "10.97%" },
		{ 20884, "INV_Qiraj_RingMagisterial", "=q3=其拉将领戒指", "#m3#", "26.98%" },
		{ 20888, "INV_Qiraj_RingCeremonial", "=q3=其拉典礼戒指",   "#m3#", "27.50%" },
		};

	AQ20Ossirian = {
	    { 21464, "INV_Bracer_07", "=q4=无疤者镣铐",           "=ds=#s8#, #a1#", "12.62%" },
	    { 21461, "INV_Pants_Cloth_06", "=q4=黑色暴风雪护腿", "=ds=#s11#, #a1#", "12.83%" },
	    { 21462, "INV_Gauntlets_19", "=q4=黑暗智慧手套",            "=ds=#s9#, #a1#", "11.89%" },
	    { 21456, "INV_Misc_Cape_06", "=q4=沙漠风暴披风",                  "=ds=#s4#", "10.89%" },
		{ 21458, "INV_Gauntlets_24", "=q4=新生护手",            "=ds=#s9#, #a2#", "13.25%" },
		{ 21454, "INV_Shoulder_18", "=q4=符文岩石护肩",             "=ds=#s3#, #a3#", "4.10%" },
		{ 21463, "INV_Belt_18", "=q4=奥斯里安的束缚",                    "=ds=#s10#, #a3#", "12.27%" },
		{ 21460, "INV_Helmet_09", "=q4=统御头盔",                  "=ds=#s1#, #a4#", "12.18%" },
		{ 21457, "INV_Bracer_19", "=q4=野蛮护腕",                "=ds=#s8#, #a4#", "10.74%" },
		{ 21453, "INV_Shoulder_28", "=q4=霍鲁斯衬肩",            "=ds=#s3#, #a4#", "6.96%" },
		{ 21452, "INV_Staff_12", "=q4=废墟法杖",                   "=ds=#h2#, #w9#", "10.32%" },
		{ 21715, "INV_Mace_24", "=q4=磨砂战锤",                  "=ds=#h1#, #w6#", "5.95%" },
		{ 21459, "INV_Weapon_Crossbow_06", "=q4=迫近末日之弩",  "=ds=#w3#", "6.12%" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 21220, "Ability_Hunter_Pet_Owl", "=q4=无疤者奥斯里安的头颅", "=ds=#m2#", "100.00%" },
		{ 21504, "INV_Jewelry_Necklace_AhnQiraj_03", "=q4=流沙护符", "=q1=#m4#: =ds=#s2#" },
		{ 21507, "INV_Jewelry_Necklace_AhnQiraj_03", "=q4=流沙咒符", "=q1=#m4#: =ds=#s2#" },
		{ 21505, "INV_Jewelry_Necklace_AhnQiraj_03", "=q4=流沙颈饰", "=q1=#m4#: =ds=#s2#" },
		{ 21506, "INV_Jewelry_Necklace_AhnQiraj_03", "=q4=流沙坠饰", "=q1=#m4#: =ds=#s2#" },
		{ 0, "", "", "" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 0,"","","" },
		{ 20886, "INV_Qiraj_HiltSpiked", "=q4=其拉尖刺刀柄",           "#m3#", "35.27%" },
		{ 20890, "INV_Qiraj_HiltOrnate", "=q4=其拉装饰刀柄",           "#m3#", "30.69%" },
		{ 20884, "INV_Qiraj_RingMagisterial", "=q3=其拉将领戒指", "#m3#", "9.65%" },
		{ 20888, "INV_Qiraj_RingCeremonial", "=q3=其拉典礼戒指",   "#m3#", "8.53%" },
		};

    AQ20Andorov = {
        { 22219, "INV_Scroll_03", "=q1=设计图：碎裂黑曜石盾牌", "=ds=#p2# #m14#"},
        { 22221, "INV_Scroll_03", "=q1=设计图：黑曜石锁甲", "=ds=#p2# #m14#" },
        { 0,"","","" },
        { 0,"","","" },
        { 0,"","","" },
        { 0,"","","" },
        { 0,"","","" },
        { 0,"","","" },
        { 0,"","","" },
        { 0,"","","" },
        { 0,"","","" },
        { 0,"","","" },
        { 0,"","","" },
        { 0,"","","" },
        { 0,"","","" },
        { 22198, "INV_Shield_22", "=q4=碎裂黑曜石盾牌",  "=ds=#w8#"},
        { 22191, "INV_Chest_Chain_17", "=q4=黑曜石锁甲", "=ds=#s5# #a3#" },
        };  

    AQ20ClassBooks = {
        { 21294, "INV_Misc_Book_11", "=q3=书卷：治疗之触 XI",                   "=q1=#m1# =ds=#c1#", "4.12%" },
        { 21296, "INV_Misc_Book_11", "=q3=书卷：回春术 XI",                    "=q1=#m1# =ds=#c1#", "4.20%" },
        { 21295, "INV_Misc_Book_11", "=q3=书卷：星火术 VII",                       "=q1=#m1# =ds=#c1#", "4.00%" },
        { 21306, "INV_Misc_Book_02", "=q3=指南：毒蛇钉刺 IX",                    "=q1=#m1# =ds=#c2#", "4.85%" },
        { 21304, "INV_Misc_Book_02", "=q3=指南：多重射击 V",                        "=q1=#m1# =ds=#c2#", "4.66%" },
        { 21307, "INV_Misc_Book_02", "=q3=指南：雄鹰守护 VII",              "=q1=#m1# =ds=#c2#", "4.65%" },
        { 21279, "INV_Misc_Book_07", "=q3=秘典：火球术 XII",                       "=q1=#m1# =ds=#c3#", "5.15%" },
        { 21214, "INV_Misc_Book_07", "=q3=秘典：寒冰箭 XI",                       "=q1=#m1# =ds=#c3#", "5.10%" },
        { 21280, "INV_Misc_Book_07", "=q3=秘典：奥术飞弹 VIII",               "=q1=#m1# =ds=#c3#", "5.03%" },
        { 21288, "INV_Misc_Book_08", "=q3=圣契：智慧祝福 VI",             "=q1=#m1# =ds=#c4#", "3.50%" },
        { 21289, "INV_Misc_Book_08", "=q3=圣契：力量祝福 VII",             "=q1=#m1# =ds=#c4#", "3.07%" },
        { 21290, "INV_Misc_Book_08", "=q3=圣契：圣光术 IX",                     "=q1=#m1# =ds=#c4#", "3.09%" },
        { 21284, "INV_Misc_Book_09", "=q3=圣典：强效治疗术 V",                    "=q1=#m1# =ds=#c5#", "5.15%" },
        { 21287, "INV_Misc_Book_09", "=q3=圣典：治疗祷言 V",               "=q1=#m1# =ds=#c5#", "4.89%" },
        { 21285, "INV_Misc_Book_09", "=q3=圣典：恢复 X",                           "=q1=#m1# =ds=#c5#", "4.91%" },
        { 21300, "INV_Misc_Book_10", "=q3=手册：背刺 IX",                    "=q1=#m1# =ds=#c6#", "4.29%" },
        { 21303, "INV_Misc_Book_10", "=q3=手册：佯攻 V",                        "=q1=#m1# =ds=#c6#", "4.79%" },
        { 21302, "INV_Misc_Book_10", "=q3=手册：致命毒药 V",                "=q1=#m1# =ds=#c6#", "5.47%" },
        { 21291, "INV_Misc_StoneTablet_11", "=q3=石板：治疗波 X",            "=q1=#m1# =ds=#c7#", "2.05%" },
        { 21292, "INV_Misc_StoneTablet_11", "=q3=石板：大地之力图腾 V", "=q1=#m1# =ds=#c7#", "1.67%" },
        { 21293, "INV_Misc_StoneTablet_11", "=q3=石板：风之优雅图腾 III",    "=q1=#m1# =ds=#c7#", "1.81%" },
        { 21281, "INV_Misc_Book_06", "=q3=魔典：暗影箭 X",                 "=q1=#m1# =ds=#c8#", "4.23%" },
        { 21283, "INV_Misc_Book_06", "=q3=魔典：腐蚀术 VII",                "=q1=#m1# =ds=#c8#", "3.82%" },
        { 21282, "INV_Misc_Book_06", "=q3=魔典：献祭 VIII",                 "=q1=#m1# =ds=#c8#", "4.51%" },
        { 21298, "INV_Misc_Book_03", "=q3=教程：战斗怒吼 VII",                "=q1=#m1# =ds=#c9#", "4.84%" },
        { 21299, "INV_Misc_Book_03", "=q3=教程：复仇 VI",                      "=q1=#m1# =ds=#c9#", "4.78%" },
        { 21297, "INV_Misc_Book_03", "=q3=教程：英勇打击 IX",                "=q1=#m1# =ds=#c9#", "4.83%" },
        };


    ----------------------------
	-- The Temple of Ahn'Qiraj --
	----------------------------

    AQ40Skeram = {
        { 21708, "INV_Bracer_12", "=q4=甲虫鳞片护腕",                 "=ds=#s8#, #a2#", "12.85%" },
        { 21698, "INV_Pants_Leather_11", "=q4=浸没护腿",              "=ds=#s11#, #a2#", " 10.99%" },
        { 21705, "INV_Boots_Chain_06", "=q4=堕落先知长靴",          "=ds=#s12#, #a3#", "3.33%" },
        { 21699, "INV_Shoulder_14", "=q4=障碍护肩",                       "=ds=#s3#, #a3#", "11.50%" },
        { 21706, "INV_Boots_Plate_06", "=q4=坚定意志长靴",         "=ds=#s12#, #a4#", "12.23%" },
        { 21814, "INV_Chest_Plate02", "=q4=灭绝胸甲",           "=ds=#s5#, #a4#", "11.01%" },
        { 21704, "INV_Boots_Plate_08", "=q4=救赎预言长靴",       "=ds=#s12#, #a4#", "7.75%" },
        { 0,"","","" },
        { 21703, "INV_Mace_21", "=q4=棘枝战锤",                            "=ds=#h2#, #w6#", "7.14%	" },
        { 21128, "INV_Staff_01", "=q4=其拉预言者法杖",               "=ds=#h2#, #w9#", " 6.32%" },
        { 21707, "INV_Jewelry_Ring_AhnQiraj_04", "=q4=风暴思绪之戒",   "=ds=#s13#", "12.57%" },
        { 21702, "INV_Jewelry_Necklace_12", "=q4=邪恶守卫咒符",          "=ds=#s2#", "12.20%" },
        { 21700, "INV_Jewelry_Necklace_AhnQiraj_01", "=q4=其拉守护者坠饰", "=ds=#s2#", "11.57%" },
        { 21701, "INV_Misc_Cape_02", "=q4=强烈仇恨披风",                   "=ds=#s4#", "11.81%" },
        { 0,"","","" },
        { 21237, "INV_Staff_20", "=q4=其拉帝王徽记", "=ds=#m3#              	", "1.74%" },
        { 21273, "INV_Staff_20", "=q4=神圣其拉侍僧法杖", "=q1=#m4#, =ds=#w9#" },
        { 21275, "INV_Staff_20", "=q4=神圣其拉占卜法杖", "=q1=#m4#, =ds=#w9#" },
        { 21268, "INV_Mace_24", "=q4=神圣其拉战锤", "=q1=#m4#, =ds=#h2#, #w6#" },
        { 0,"","","" },
        { 21232, "INV_Staff_24", "=q4=其拉帝王武器", "=ds=#m3#            ", "1.32%" },
        { 21242, "INV_Axe_26", "=q4=神圣其拉战斧", "=q1=#m4#, =ds=#w1#" },
        { 21272, "INV_Weapon_Rifle_11", "=q4=神圣其拉火枪", "=q1=#m4#, =ds=#w5#" },
        { 21244, "INV_Weapon_Shortblade_35", "=q4=神圣其拉短剑", "=q1=#m4#, =ds=#w4#" },
        { 21269, "INV_Shield_23", "=q4=神圣其拉壁垒", "=q1=#m4#, =ds=#w8#" },
        { 0,"","","" },
        { 22222, "INV_Scroll_05", "=q3=设计图：厚重黑曜石胸甲", "=ds=#p2# #m14#", "5.00%" },
        { 22196, "INV_Chest_Chain_17", "=q4=厚重黑曜石胸甲", "=ds=#s5#, #a4#", },
        };

    AQ40Vem = {
        { 21694, "INV_Shoulder_05", "=q4=三重衬肩",                 "=ds=#s3#, #a1# =q2=#m5#" },
        { 21696, "INV_Chest_Cloth_22", "=q4=执政者长袍",    "=ds=#s5#, #a1# =q2=#m5#" },
        { 21697, "INV_Misc_Cape_18", "=q4=神性披风",           "=ds=#s4# =q2=#m5#" },
        { 21693, "INV_Helmet_06", "=q4=吞噬者之衣",            "=ds=#s1#, #a2# =q2=#m5#" },
        { 21692, "INV_Belt_18", "=q4=蔓延腰带",                       "=ds=#s10#, #a4# =q2=#m5#" },
        { 21695, "INV_Jewelry_Ring_AhnQiraj_04", "=q4=安格莉丝塔的触摸", "=ds=#s13# =q2=#m5#" },
        { 0,"","","" },
        { 21237, "INV_Staff_20", "=q4=其拉帝王徽记",           "=ds=#m3# =q2=#m5#" },
        { 21232, "INV_Staff_24", "=q4=其拉帝王武器",         "=ds=#m3# =q2=#m5#" },
        { 0,"","","" },
        { 21680, "INV_Chest_Cloth_45", "=q4=处决者的外衣",        "=ds=#s5#, #a2# =q2=克里勋爵" },
        { 21681, "INV_Jewelry_Ring_AhnQiraj_05", "=q4=吞噬者之戒", "=ds=#s13# =q2=克里勋爵" },
        { 21685, "INV_Misc_AhnQirajTrinket_01", "=q4=石化甲虫",      "=ds=#s14# =q2=克里勋爵" },
        { 21603, "INV_Wand_06", "=q4=其拉贵族魔杖",               "=ds=#w12# =q2=克里勋爵" },
        { 0,"","","" },
        { 21689, "INV_Gauntlets_23", "=q4=埃布鲁手套",             "=ds=#s9#, #a2# =q2=维姆" },
        { 21691, "INV_Gauntlets_11", "=q4=沾满软泥的护手",      "=ds=#s9#, #a4# =q2=维姆" },
        { 21688, "INV_Boots_Plate_01", "=q4=堕落英雄长靴", "=ds=#s12#, #a4# =q2=维姆" },
        { 21690, "INV_Jewelry_Necklace_20", "=q4=安格莉丝塔的护符",   "=ds=#s2# =q2=维姆" },
        { 0,"","","" },
        { 21686, "INV_Shoulder_02", "=q4=精神力量衬肩",      "=ds=#s3#, #a1# =q2=亚尔基公主" },
        { 21682, "INV_Gauntlets_21", "=q4=胆汁护手",      "=ds=#s9#, #a2# =q2=亚尔基公主" },
        { 21684, "INV_Shoulder_28", "=q4=沙漠狂暴衬肩",  "=ds=#s3#, #a3# =q2=亚尔基公主 (#m6#)" },
        { 21683, "INV_Shoulder_29", "=q4=沙漠远征衬肩", "=ds=#s3#, #a4# =q2=亚尔基公主 (#m7#)" },
        { 21687, "INV_Jewelry_Ring_24", "=q4=奥库的黑暗之戒",  "=ds=#s13# =q2=亚尔基公主" },
        };

    AQ40Sartura = {
        { 21676, "INV_Pants_Cloth_02", "=q4=腐烂虫群护腿",    "=ds=#s11#, #a1#", "13.02%" },
        { 21648, "INV_Boots_Cloth_07", "=q4=平静长靴",                   "=ds=#s12#, #a1#", "7.64%" },
        { 21671, "INV_Chest_Cloth_26", "=q4=作战卫士长袍",           "=ds=#s5#, #a1#", " 13.30%" },
        { 21675, "INV_Belt_15", "=q4=厚重其拉腰带",                     "=ds=#s10#, #a2#", "13.26%	" },
        { 21672, "INV_Gauntlets_17", "=q4=强制者手套",                "=ds=#s9#, #a2#", " 11.87%" },
        { 21669, "INV_Helmet_01", "=q4=爬藤头盔",                      "=ds=#s1#, #a2#", "12.33%" },
        { 21668, "INV_Pants_Mail_15", "=q4=缀鳞其拉狂暴护腿",      "=ds=#s11#, #a3#", "4.03%" },
        { 21667, "INV_Pants_Plate_11", "=q4=闪耀光芒腿甲",         "=ds=#s11#, #a4#", " 7.44%" },
        { 21674, "INV_Gauntlets_31", "=q4=坚定信念护手", "=ds=#s9#, #a4#", " 11.07%" },
        { 21673, "INV_Misc_MonsterClaw_03", "=q4=异种虫爪",                "=ds=#h3#, #w13#", "7.16%" },
        { 21666, "INV_QirajIdol_War", "=q4=沙尔图拉的力量",                     "=ds=#s15#", "6.47%" },
        { 21678, "INV_Jewelry_Necklace_AhnQiraj_04", "=q4=纯洁项链",   "=ds=#s2#", "14.21%" },
        { 21670, "INV_Misc_AhnQirajTrinket_04", "=q4=虫群卫士徽章",   "=ds=#s14#", "13.22%" },
        { 0,"","","" },
        { 0,"","","" },
        { 21237, "INV_Staff_20", "=q4=其拉帝王徽记", "=ds=#m3#            ", "4.01%" },
        { 21273, "INV_Staff_20", "=q4=神圣其拉侍僧法杖", "=q1=#m4#, =ds=#w9#" },
        { 21275, "INV_Staff_20", "=q4=神圣其拉占卜法杖", "=q1=#m4#, =ds=#w9#" },
        { 21268, "INV_Mace_24", "=q4=神圣其拉战锤", "=q1=#m4#, =ds=#h2#, #w6#" },
        { 0,"","","" },
        { 21232, "INV_Staff_24", "=q4=其拉帝王武器", "=ds=#m3#            ", "4.02%" },
        { 21242, "INV_Axe_26", "=q4=神圣其拉战斧", "=q1=#m4#, =ds=#w1#" },
        { 21272, "INV_Weapon_Rifle_11", "=q4=神圣其拉火枪", "=q1=#m4#, =ds=#w5#" },
        { 21244, "INV_Weapon_Shortblade_35", "=q4=神圣其拉短剑", "=q1=#m4#, =ds=#w4#" },
        { 21269, "INV_Shield_23", "=q4=神圣其拉壁垒", "=q1=#m4#, =ds=#w8#" },
        };

    AQ40Fankriss = {
        { 21663, "INV_Chest_Cloth_23", "=q4=守护圣徒长袍",       "=ds=#s5#, #a1#", "12.95%	" },
        { 21627, "INV_Misc_Cape_20", "=q4=隐没秘密披风",             "=ds=#s4#", " 12.51%" },
        { 21645, "INV_Boots_04", "=q4=掘洞者之靴",                   "=ds=#s12#, #a2#", " 14.04%" },
        { 21665, "INV_Shoulder_30", "=q4=邪恶复仇衬肩",             "=ds=#s3#, #a2#", "13.25%" },
        { 21651, "INV_Pants_Mail_10", "=q4=缀鳞沙漠掠夺者护腿",         "=ds=#s11#, #a3#", "12.91%" },
        { 21652, "INV_Chest_Plate09", "=q4=异种虫壳护胸",        "=ds=#s5#, #a4#", "10.29%" },
        { 21639, "INV_Shoulder_29", "=q4=冷酷者肩铠",          "=ds=#s3#, #a4#", " 14.78%" },
        { 21650, "INV_Sword_59", "=q4=上古其拉撕裂者",                    "=ds=#h1#, #w10#", " 7.19%" },
        { 21635, "INV_Weapon_Halberd_AhnQiraj", "=q4=沙漠掠夺者之刺",   "=ds=#w7#", " 6.61%" },
        { 0,"","","" },
        { 21647, "INV_Misc_AhnQirajTrinket_03", "=q4=沙漠掠夺者塑像", "=ds=#s14#", " 13.82%" },
        { 21664, "INV_Jewelry_Necklace_AhnQiraj_02", "=q4=尖刺颈饰",        "=ds=#s2#", "12.63%" },
        { 22402, "INV_Relics_LibramofGrace", "=q4=优雅圣契",              "=ds=#s16#", " 4.21%" },
        { 22396, "INV_Relics_TotemofLife", "=q4=生命图腾",                  "=ds=#s16#", " 1.69%" },
        { 0,"","","" },
        { 21237, "INV_Staff_20", "=q4=其拉帝王徽记", "=ds=#m3#              	", "4.84%" },
        { 21273, "INV_Staff_20", "=q4=神圣其拉侍僧法杖", "=q1=#m4#, =ds=#w9#" },
        { 21275, "INV_Staff_20", "=q4=神圣其拉占卜法杖", "=q1=#m4#, =ds=#w9#" },
        { 21268, "INV_Mace_24", "=q4=神圣其拉战锤", "=q1=#m4#, =ds=#h2#, #w6#" },
        { 0,"","","" },
        { 21232, "INV_Staff_24", "=q4=其拉帝王武器", "=ds=#m3#              	", "4.09%" },
        { 21242, "INV_Axe_26", "=q4=神圣其拉战斧", "=q1=#m4#, =ds=#w1#" },
        { 21272, "INV_Weapon_Rifle_11", "=q4=神圣其拉火枪", "=q1=#m4#, =ds=#w5#" },
        { 21244, "INV_Weapon_Shortblade_35", "=q4=神圣其拉短剑", "=q1=#m4#, =ds=#w4#" },
        { 21269, "INV_Shield_23", "=q4=神圣其拉壁垒", "=q1=#m4#, =ds=#w8#" },
        };

    AQ40Viscidus = {
        { 21648, "INV_Boots_Cloth_07", "=q4=平静长靴",                   "=ds=#s12#, #a1#", "7.64%" },
        { 21624, "INV_Gauntlets_26", "=q4=卡利姆多护手",               "=ds=#s9#, #a3#", " 3.90%" },
        { 21626, "INV_Pants_Mail_11", "=q4=粘液护腿",              "=ds=#s11#, #a3#", "13.66%" },
        { 21623, "INV_Gauntlets_26", "=q4=正义勇士护手", "=ds=#s9#, #a4#", " 5.37%" },
        { 21622, "INV_Sword_58", "=q4=锋利的异种虫腿",                "=ds=#h3#, #w10#", " 15.12%" },
        { 0,"","","" },
        { 21625, "INV_Misc_AhnQirajTrinket_06", "=q4=甲虫胸针",            "=ds=#s14#", "21.46%" },
        { 21677, "INV_jewelry_ring_AhnQiraj_01", "=q4=其拉之怒", "=ds=#s13#", "2.93%	" },
        { 22399, "INV_Relics_IdolofHealth", "=q4=健康神像",               "=ds=#s16#", "7.32%" },
        { 0,"","","" },
        { 20932, "INV_Qiraj_BindingsDominance", "=q4=其拉统御腕轮", "=q1=#m3#, #m1# =ds=#c8#, #c3#, #c7#, #c1#, #c4#", "100%	" },
        { 20928, "INV_Qiraj_BindingsCommand", "=q4=其拉命令腕轮", "=q1=#m3#, #m1# =ds=#c5#, #c6#, #c9#, #c2#", "100%" },
        { 0,"","","" },
        { 0,"","","" },
        { 0,"","","" },
        { 0,"","","" },
        { 21237, "INV_Staff_20", "=q4=其拉帝王徽记", "=ds=#m3#              	", "3.19%" },
        { 21273, "INV_Staff_20", "=q4=神圣其拉侍僧法杖", "=q1=#m4#, =ds=#w9#" },
        { 21275, "INV_Staff_20", "=q4=神圣其拉占卜法杖", "=q1=#m4#, =ds=#w9#" },
        { 21268, "INV_Mace_24", "=q4=神圣其拉战锤", "=q1=#m4#, =ds=#h2#, #w6#" },
        { 0,"","","" },
        { 21232, "INV_Staff_24", "=q4=其拉帝王武器", "=ds=#m3#            ", "6.86%" },
        { 21242, "INV_Axe_26", "=q4=神圣其拉战斧", "=q1=#m4#, =ds=#w1#" },
        { 21272, "INV_Weapon_Rifle_11", "=q4=神圣其拉火枪", "=q1=#m4#, =ds=#w5#" },
        { 21244, "INV_Weapon_Shortblade_35", "=q4=神圣其拉短剑", "=q1=#m4#, =ds=#w4#" },
        { 21269, "INV_Shield_23", "=q4=神圣其拉壁垒", "=q1=#m4#, =ds=#w8#" },
        };

    AQ40Huhuran = {
        { 21619, "INV_Gauntlets_17", "=q4=救世者手套",          "=ds=#s9#, #a1#", "12.01%" },
        { 21621, "INV_Misc_Cape_01", "=q4=金巢披风",       "=ds=#s4#", "12.56%" },
        { 21617, "INV_Gauntlets_17", "=q4=黄蜂外壳护手",             "=ds=#s9#, #a2#", "11.97%" },
        { 21618, "INV_Bracer_02", "=q4=虫巢污染者护腕",          "=ds=#s8#, #a4#", "10.34%" },
        { 21616, "INV_Weapon_Bow_14", "=q4=哈霍兰之刺",             "=ds=#w2#", " 5.71%" },
        { 0,"","","" },
        { 21620, "INV_Jewelry_Ring_AhnQiraj_01", "=q4=殉难者之戒", "=ds=#s13#", " 12.97%" },
        { 0,"","","" },
        { 20932, "INV_Qiraj_BindingsDominance", "=q4=其拉统御腕轮", "=q1=#m3#, #m1# =ds=#c8#, #c3#, #c7#, #c1#, #c4#", "100%" },
        { 20928, "INV_Qiraj_BindingsCommand", "=q4=其拉命令腕轮", "=q1=#m3#, #m1# =ds=#c5#, #c6#, #c9#, #c2#", "100%" },
        { 0,"","","" },
        { 0,"","","" },
        { 0,"","","" },
        { 0,"","","" },
        { 0,"","","" },
        { 21237, "INV_Staff_20", "=q4=其拉帝王徽记", "=ds=#m3#              	", "4.31%" },
        { 21273, "INV_Staff_20", "=q4=神圣其拉侍僧法杖", "=q1=#m4#, =ds=#w9#" },
        { 21275, "INV_Staff_20", "=q4=神圣其拉占卜法杖", "=q1=#m4#, =ds=#w9#" },
        { 21268, "INV_Mace_24", "=q4=神圣其拉战锤", "=q1=#m4#, =ds=#h2#, #w6#" },
        { 0,"","","" },
        { 21232, "INV_Staff_24", "=q4=其拉帝王武器", "=ds=#m3#            ", "4.11%" },
        { 21242, "INV_Axe_26", "=q4=神圣其拉战斧", "=q1=#m4#, =ds=#w1#" },
        { 21272, "INV_Weapon_Rifle_11", "=q4=神圣其拉火枪", "=q1=#m4#, =ds=#w5#" },
        { 21244, "INV_Weapon_Shortblade_35", "=q4=神圣其拉短剑", "=q1=#m4#, =ds=#w4#" },
        { 21269, "INV_Shield_23", "=q4=神圣其拉壁垒", "=q1=#m4#, =ds=#w8#" },
        };

    AQ40Emperors = {
        { 21600, "INV_Boots_Cloth_05", "=q4=显灵长靴",                 "=ds=#s12#, #a1#", "15.77%" },
        { 21602, "INV_Bracer_13", "=q4=其拉死刑手腕",               "=ds=#s8#, #a2#",  "15.95%" },
        { 21599, "INV_Gauntlets_28", "=q4=维克洛尔的毁灭手套",     "=ds=#s9#, #a3#",  "15.77%" },
        { 21598, "INV_Belt_31", "=q4=皇家其拉腰带",                        "=ds=#s10#, #a4#",  " 9.84%" },
        { 21597, "INV_Wand_10", "=q4=维克洛尔皇家节杖",                 "=ds=#s15#",  " 6.99%" },
        { 21601, "INV_jewelry_ring_AhnQiraj_01", "=q4=维克洛尔大帝之戒", "=ds=#s13#",  "17.27%" },
        { 0,"","","" },
        { 21232, "INV_Staff_24", "=q4=其拉帝王武器", "=ds=#m3#            ", "6.25%" },
        { 21242, "INV_Axe_26", "=q4=神圣其拉战斧", "=q1=#m4#, =ds=#w1#" },
        { 21272, "INV_Weapon_Rifle_11", "=q4=神圣其拉火枪", "=q1=#m4#, =ds=#w5#" },
        { 21244, "INV_Weapon_Shortblade_35", "=q4=神圣其拉短剑", "=q1=#m4#, =ds=#w4#" },
        { 21269, "INV_Shield_23", "=q4=神圣其拉壁垒", "=q1=#m4#, =ds=#w8#" },
        { 0,"","","" },
        { 20930, "INV_Bracer_18", "=q4=维克洛尔的王冠", "=q1=#m3#, #m1# =ds=#c7#, #c1#, #c6#, #c2#, #c4#", "100%	" },
        { 20926, "INV_Bracer_18", "=q4=维克尼拉斯的头饰", "=q1=#m3#, #m1# =ds=#c8#, #c3#, #c5#, #c9#", "100%" }, 
        { 21604, "INV_Bracer_13", "=q4=皇家救赎腕轮",           "=ds=#s8#, #a1#", "12.51%	" },
        { 21605, "INV_Gauntlets_19", "=q4=隐秘神殿手套",          "=ds=#s9#, #a2#",   "15.45%" },
        { 21609, "INV_Belt_11", "=q4=维克尼拉斯的再生腰带",           "=ds=#s10#, #a2#",  "13.35%" },
        { 21607, "INV_Belt_32", "=q4=堕落帝王的拥抱",               "=ds=#s10#, #a3#",   "2.72%" },
        { 21606, "INV_Belt_34", "=q4=堕落帝王腰带",                "=ds=#s10#, #a4#",  "12.22%" },
        { 21679, "INV_Sword_56", "=q4=卡利姆多的复仇",                       "=ds=#h2#, #w10#",   " 9.25%" },
        { 21608, "INV_Jewelry_Necklace_AhnQiraj_01", "=q4=维克尼拉斯的咒符", "=ds=#s2#",  "14.25%" },
        { 0,"","","" },
        { 21237, "INV_Staff_20", "=q4=其拉帝王徽记", "=ds=#m3#              	", "5.00%" },
        { 21273, "INV_Staff_20", "=q4=神圣其拉侍僧法杖", "=q1=#m4#, =ds=#w9#" },
        { 21275, "INV_Staff_20", "=q4=神圣其拉占卜法杖", "=q1=#m4#, =ds=#w9#" },
        { 21268, "INV_Mace_24", "=q4=神圣其拉战锤", "=q1=#m4#, =ds=#h2#, #w6#" },
        { 0,"","","" },
        { 20726, "INV_Misc_Note_01", "=q3=公式：附魔手套 - 威胁", "=ds=#p4# #m14#", " 5.89%" },
        { 20735, "INV_Misc_Note_01", "=q3=公式：附魔披风 - 狡诈", "=ds=#p4# #m14#", " 7.57%" },
        };

    AQ40Ouro = {
        { 21611, "INV_Bracer_13", "=q4=掘地虫护腕", "=ds=#s8#, #a1#", "24.44%" },
        { 21615, "INV_Helmet_51", "=q4=瑞格贝托的帽子", "=ds=#s1#, #a1#", "28.63%" },
        { 23557, "INV_Weapon_Rifle_10", "=q4=巨虫的幼体", "=ds=#w5#", "3.95%" },
        { 21610, "INV_Shield_24", "=q4=虫鳞阻挡者", "=ds=#w8#", "16.54%" },
        { 23558, "INV_Shield_23","=q4=穴居虫之壳", "=ds=#s14#", "2.80%" },
        { 23570, "INV_Misc_EngGizmos_19", "=q4=沙虫之毒", "=ds=#s14#", "2.90%" },
        { 0,"","","" },
        { 20927, "INV_Qiraj_OuroHide", "=q4=奥罗的外皮", "=q1=#m3#, #m1# =ds=#c3#, #c5#, #c6#, #c9#", "100%" },
        { 20931, "INV_Qiraj_SkinSandworm", "=q4=巨型沙虫的皮", "=q1=#m3#, #m1# =ds=#c8#, #c7#, #c1#, #c2#, #c4#", "100%" },
        { 0,"","","" },
        { 0,"","","" },
        { 0,"","","" },
        { 0,"","","" },
        { 0,"","","" },
        { 0,"","","" },
        { 21237, "INV_Staff_20", "=q4=其拉帝王徽记", "=ds=#m3#              	", "5.20%" },
        { 21273, "INV_Staff_20", "=q4=神圣其拉侍僧法杖", "=q1=#m4#, =ds=#w9#" },
        { 21275, "INV_Staff_20", "=q4=神圣其拉占卜法杖", "=q1=#m4#, =ds=#w9#" },
        { 21268, "INV_Mace_24", "=q4=神圣其拉战锤", "=q1=#m4#, =ds=#h2#, #w6#" },
        { 0,"","","" },
        { 21232, "INV_Staff_24", "=q4=其拉帝王武器", "=ds=#m3#            ", "4.10%" },
        { 21242, "INV_Axe_26", "=q4=神圣其拉战斧", "=q1=#m4#, =ds=#w1#" },
        { 21272, "INV_Weapon_Rifle_11", "=q4=神圣其拉火枪", "=q1=#m4#, =ds=#w5#" },
        { 21244, "INV_Weapon_Shortblade_35", "=q4=神圣其拉短剑", "=q1=#m4#, =ds=#w4#" },
        { 21269, "INV_Shield_23", "=q4=神圣其拉壁垒", "=q1=#m4#, =ds=#w8#" },
        };

    AQ40CThun = {
        { 0,"","","" },
        { 22730, "INV_Belt_12", "=q4=眼柄腰带",            "=ds=#s10#, #a1#", "10.41%" },
        { 21582, "INV_Belt_31", "=q4=上古之神的拥抱",           "=ds=#s10#, #a1#", "15.04%" },
        { 21585, "INV_Gauntlets_17", "=q4=黑暗风暴护手",      "=ds=#s9#, #a1#", "13.63%" },
        { 21583, "INV_Misc_Cape_02", "=q4=明晰披风",          "=ds=#s4#", "14.45%" },
        { 22731, "INV_Misc_Cape_18", "=q4=被吞噬者的披风",     "=ds=#s4#", "16.34%" },
        { 21586, "INV_Belt_26", "=q4=无尽痛苦腰带",     "=ds=#s10#, #a2#", "11.24%" },
        { 21581, "INV_Gauntlets_31", "=q4=毁灭护手", "=ds=#s9#, #a4#", "12.04%" },
        { 21126, "INV_Weapon_Shortblade_33", "=q4=死亡之钉",     "=ds=#h1#, #w4#", "6.84%" },
        { 21134, "INV_Axe_24", "=q4=疯狂黑暗之刃",           "=ds=#h2#, #w1#", "5.93%" },
        { 21839, "INV_Mace22", "=q4=虚妄预言者节杖",    "=ds=#h3#, #w6#", "4.75%" },
        { 21579, "INV_Misc_AhnQirajTrinket_05", "=q4=克苏恩的触须", "=ds=#s14#", "12.18%" },
        { 21596, "INV_Jewelry_Ring_AhnQiraj_06", "=q4=屠神者之戒", "=ds=#s13#", "11.83%" },
        { 22732, "INV_Jewelry_Necklace_AhnQiraj_04", "=q4=克苏恩的印记", "=ds=#s2#", "10.62%" },
        { 0,"","","" },
        { 0,"","","" },
        { 20933, "INV_Qiraj_HuskOldGod", "=q4=上古之神的外鞘", "=q1=#m3#, #m1# =ds=#c8#, #c3#, #c1#, #c5#", "100%" },
        { 20929, "INV_Qiraj_CarapaceOldGod", "=q4=上古之神的甲壳", "=q1=#m3#, #m1# =ds=#c7#, #c6#, #c9#, #c2#, #c4#", "100%" },
        { 0,"","","" },
        { 21221, "Spell_Shadow_DetectInvisibility", "=q4=克苏恩之眼", "=ds=#m2#!", "100%" },
        { 0,"","","" },
        { 21712, "INV_Jewelry_Necklace_AhnQiraj_02", "=q4=堕落神明咒符", "=q1=#m4# =ds=#s2#" },
        { 21710, "INV_Misc_Cape_10", "=q4=堕落神明披风",                  "=q1=#m4# =ds=#s4#" },
        { 21709, "INV_Jewelry_Ring_AhnQiraj_02", "=q4=堕落神明之戒",       "=q1=#m4# =ds=#s13#" },
        { 0,"","","" },
        { 22734, "INV_QirajIdol_Sun", "=q5=埃提耶什的杖柄末端", "=ds=#m3#" },
        { 22632, "INV_Staff_Medivh", "=q5=埃提耶什,守护者的传说之杖", "=ds=#m4#, =q1=#m1# =ds=#c1#"},
        { 22589, "INV_Staff_Medivh", "=q5=埃提耶什,守护者的传说之杖", "=ds=#m4#, =q1=#m1# =ds=#c3#"},
        { 22631, "INV_Staff_Medivh", "=q5=埃提耶什,守护者的传说之杖", "=ds=#m4#, =q1=#m1# =ds=#c5#"},
        { 22630, "INV_Staff_Medivh", "=q5=埃提耶什,守护者的传说之杖", "=ds=#m4#, =q1=#m1# =ds=#c8#"},
        };

    AQ40Trash = {
        { 21838, "INV_Chest_Cloth_48", "=q4=晋升衣饰",       "=ds=#s5#, #a1#", "0.20%" },
        { 21888, "INV_Gauntlets_14", "=q4=不朽手套",          "=ds=#s9#, #a1#", "0.16%" },
        { 21889, "INV_Gauntlets_19", "=q4=救赎预言者手套", "=ds=#s9#, #a4#", "0.39%" },
        { 21856, "INV_Axe_09", "=q4=奈雷萨克,饮血者",           "=ds=#h2#, #w1#", "0.20%" },
        { 21837, "INV_Hammer_11", "=q4=阿努比萨斯战锤",                "=ds=#h1#, #w6#", "0.21%" },
        { 21891, "INV_Misc_AhnQirajTrinket_04", "=q4=坠落星辰碎片", "=ds=#s14#", "0.59%" },
        { 21836, "INV_Jewelry_Ring_34", "=q4=混乱之琉璃戒指",      "=ds=#s13#", "0.18%" },
        { 0,"","","" },
        { 0,"","","" },
        { 0,"","","" },
        { 0,"","","" },
        { 0,"","","" },
        { 0,"","","" },
        { 0,"","","" },
        { 0,"","","" },
        { 21218, "INV_Misc_QirajiCrystal_04", "=q3=蓝色其拉共鸣水晶",   "=ds=#e7#", "10.64%" },
        { 21324, "INV_Misc_QirajiCrystal_01", "=q3=黄色其拉共鸣水晶", "=ds=#e7#", "12.15%" },
        { 21323, "INV_Misc_QirajiCrystal_03", "=q3=绿色其拉共鸣水晶",  "=ds=#e7#", "11.62%" },
        { 21321, "INV_Misc_QirajiCrystal_02", "=q3=红色其拉共鸣水晶",    "=ds=#e7#", "1.39%" },
        };
      
     AQOpening = {
        { 0, "INV_Misc_Gem_Ruby_03", "=q6="..ATLASLOOT_RED_SCEPTER, "" },
        { 21530, "INV_Pants_Mail_04", "=q4=玛瑙镶饰护腿", "=ds=#s11# #a3#" },
        { 21529, "INV_Jewelry_Necklace_17", "=q4=暗影屏蔽护符", "=ds=#s2#" },
        { 0, "", "", "" },
        { 0, "INV_Misc_Gem_Emerald_03", "=q6="..ATLASLOOT_GREEN_SCEPTER, "" },
        { 21532, "INV_Boots_08", "=q4=苦力长靴", "=ds=#s12# #a2#" },
        { 21531, "INV_Jewelry_Necklace_22", "=q4=龙牙项链", "=ds=#s2#" },
        { 0, "", "", "" },
        { 0, "INV_Misc_Gem_Sapphire_03", "=q6="..ATLASLOOT_BLUE_SCEPTER, "" },
        { 21517, "INV_Helmet_63", "=q4=精神力量之侏儒头巾", "=ds=#s1# #a1#" },
        { 21527, "INV_Chest_Cloth_31", "=q4=暗水长袍", "=ds=#s5# #a1#" },
        { 21526, "INV_Jewelry_Ring_35", "=q4=冰雪深渊之戒", "=ds=#s13#" },
        { 21025, "INV_Misc_Book_02", "=q4=食谱：迪尔格的超美味奇美拉肉片", "=ds=#p3#" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "INV_Hammer_25", "=q6="..ATLASLOOT_SCEPTER, "" },
        { 21522, "INV_Weapon_ShortBlade_25", "=q4=影歌的悲伤", "=ds=#h1##w4#" },
        { 21523, "INV_Weapon_Shortblade_29", "=q4=考雷斯特拉兹之牙", "=ds=#h3##w4#" },
        { 21520, "INV_Sword_49", "=q4=拉文凯斯的遗产", "=ds=#h1##w10#" },
        { 21521, "INV_Sword_51", "=q4=红龙符文剑", "=ds=#h3##w10#" },
        };
        
    AQBroodRings = {
        { 0, "INV_Jewelry_Ring_40", "=q6="..ATLASLOOT_BROOD_CONQUEROR, "" },
        { 21201, "INV_Jewelry_Ring_40", "=q4=青铜龙军团的徽记之戒", "=ds=#s13#, #r1#" },
        { 21202, "INV_Jewelry_Ring_40", "=q4=青铜龙军团的徽记之戒", "=ds=#s13#, #r2#" },
        { 21203, "INV_Jewelry_Ring_40", "=q4=青铜龙军团的徽记之戒", "=ds=#s13#, #r3#" },
        { 21204, "INV_Jewelry_Ring_40", "=q4=青铜龙军团的徽记之戒", "=ds=#s13#, #r4#" },
        { 21205, "INV_Jewelry_Ring_40", "=q4=青铜龙军团的徽记之戒", "=ds=#s13#, #r5#" },
        { 0,"","","" },
        { 0, "INV_Jewelry_Ring_40", "=q6="..ATLASLOOT_BROOD_INVOKER, "" },
        { 21206, "INV_Jewelry_Ring_40", "=q4=青铜龙军团的徽记之戒", "=ds=#s13#, #r1#" },
        { 21207, "INV_Jewelry_Ring_40", "=q4=青铜龙军团的徽记之戒", "=ds=#s13#, #r2#" },
        { 21208, "INV_Jewelry_Ring_40", "=q4=青铜龙军团的徽记之戒", "=ds=#s13#, #r3#" },
        { 21209, "INV_Jewelry_Ring_40", "=q4=青铜龙军团的徽记之戒", "=ds=#s13#, #r4#" },
        { 21210, "INV_Jewelry_Ring_40", "=q4=青铜龙军团的徽记之戒", "=ds=#s13#, #r5#" },
        { 0,"","","" },
        { 0,"","","" },
        { 0, "INV_Jewelry_Ring_40", "=q6="..ATLASLOOT_BROOD_PROTECTOR, "" },
        { 21196, "INV_Jewelry_Ring_40", "=q4=青铜龙军团的徽记之戒", "=ds=#s13#, #r1#" },
        { 21197, "INV_Jewelry_Ring_40", "=q4=青铜龙军团的徽记之戒", "=ds=#s13#, #r2#" },
        { 21198, "INV_Jewelry_Ring_40", "=q4=青铜龙军团的徽记之戒", "=ds=#s13#, #r3#" },
        { 21199, "INV_Jewelry_Ring_40", "=q4=青铜龙军团的徽记之戒", "=ds=#s13#, #r4#" },
        { 21200, "INV_Jewelry_Ring_40", "=q4=青铜龙军团的徽记之戒", "=ds=#s13#, #r5#" },
    };
     
     -------------------
     -- AQ Enchants --
     -------------------

    AQEnchants = {
        { 20728, "INV_Misc_Note_01", "=q3=公式：附魔手套 - 冰霜能量", "=ds=#p4# #m14#" },
        { 20731, "INV_Misc_Note_01", "=q3=公式：附魔手套 - 超强敏捷", "=ds=#p4# #m14#" },
        { 20734, "INV_Misc_Note_01", "=q3=公式：附魔披风 - 潜行", "=ds=#p4# #m14#" },
        { 20729, "INV_Misc_Note_01", "=q3=公式：附魔手套 - 火焰能量", "=ds=#p4# #m14#" },
        { 20736, "INV_Misc_Note_01", "=q3=公式：附魔披风 - 躲闪", "=ds=#p4# #m14#" },
        { 20730, "INV_Misc_Note_01", "=q3=公式：附魔手套 - 治疗能量", "=ds=#p4# #m14#" },
        { 20727, "INV_Misc_Note_01", "=q3=公式：附魔手套 - 暗影能量", "=ds=#p4# #m14#" },
        };
     -------------------
     --Gnomeregan--
     -------------------

    GnViscousFallout = {
        { 9454, "INV_Boots_05", "=q3=酸性长靴",             "=ds=#s12#, #a1#", "54.02%" },
        { 9453, "INV_Weapon_ShortBlade_02", "=q3=剧毒复仇者", "=ds=#h1#, #w4#", "19.05%" },
        { 9452, "INV_Staff_15", "=q3=水藤",                  "=ds=#h2#, #w9#", "18.25%" },
        };

    GnGrubbis = {
        { 9445, "INV_Gauntlets_17", "=q3=格鲁比斯的爪子", "=ds=#s9#, #a3#", "9.22%" },
        };

    GnElectrocutioner6000 = {
        { 9447, "INV_Misc_Gear_04", "=q3=电刑器腿杆", "=ds=#s13#", "28.44%" },
        { 9446, "INV_Sword_30", "=q3=电刑器的腿",        "=ds=#h3#, #w10#", "13.19%" },
        { 0,"","","" },
        { 9448, "INV_Misc_Bandage_09", "=q2=蜘蛛坦克油布",   "=ds=#s8#, #a1#", "28.37%" },
        { 0,"","","" },
        { 6893, "INV_Misc_Key_06", "=q1=车间钥匙",            "=ds=#e14#" },
        };

    GnMekgineerThermaplugg = {
        { 9458, "INV_Shield_10", "=q3=瑟玛普拉格的中央模组",          "=ds=#w8#", "28.61%" },
        { 9461, "INV_Misc_Gear_01", "=q3=[随机前缀]之充能齿轮",  "=ds=#s13# =q1=随机前缀", "28.49%" },
        { 9459, "INV_Axe_03", "=q3=瑟玛普拉格的左臂",                 "=ds=#h2#, #w1#", "18.05%" },
        { 9492, "INV_Gizmo_01", "=q3=电磁熔合激活器", "=ds=#s1#, #a1#", "7.65%" },
        };

    GnDIAmbassador = {
        { 9456, "INV_Weapon_Rifle_02", "=q3=玻璃枪",    "=ds=#w5#", "38.01%" },
        { 9455, "INV_Bracer_09", "=q3=[随机前缀]之使者腕轮",      "=ds=#s8#, #a2# =q1=随机前缀", "33.96%" },
        { 9457, "INV_Mace_08", "=q3=皇家外交官节杖", "=ds=#h1#, #w6#", "17.79%" },
        };

    GnCrowdPummeler960 = {
        { 9449, "INV_Mace_14", "=q3=手动惩戒器",     "=ds=#h2#, #w6#", "33.14%" },
        { 0,"","","" },
        { 9450, "INV_Boots_03", "=q2=侏儒机器人操作靴", "=ds=#s12#, #a2#", "60.45%" },
        };
       
     GnTrash = {
        { 9485, "INV_Axe_14", "=q3=电流剑",              "=ds=#h1# #w1#", "0.01%" },
        { 9486, "INV_Axe_21", "=q3=增压战斧",            "=ds=#h2# #w1#", "0.02%" },
        { 9487, "INV_Weapon_Rifle_06", "=q3=高科技步枪", "=ds=#w5#", "0.01%" },
        { 9488, "INV_Hammer_08", "=q3=震荡动力战锤",     "=ds=#h1# #w6#", "0.02%" },
        { 9490, "INV_Sword_37", "=q3=高能机械切割器",    "=ds=#h2# #w10#", "0.01%" },
        { 9491, "INV_Gauntlets_16", "=q3=驾驶员手套",    "=ds=#s9#, #a1#", "0.01%" },
        { 9508, "INV_Shirt_14", "=q3=机械师罩衫",        "=ds=#s5#, #a1#", "0.02%" },
        { 9509, "INV_Pants_08", "=q3=浸油护腿",          "=ds=#s11#, #a2#", "0.01%" },
        { 9510, "INV_Boots_01", "=q3=洞窟跋涉者",        "=ds=#s12#, #a3#", "0.01%" },
        };

      -------------------
      -- TheStockade --
      -------------------

    SWStKamDeepfury = {
        { 2280, "INV_Staff_06", "=q2=黑铁手杖", "=ds=#h2#, #w9#", "0.62%" };
        };

    SWStBruegalIronknuckle = {
        { 3228, "INV_Bracer_02", "=q3=弯曲护腕",       "=ds=#s8#, #a3#", "54.73%" };
        { 2942, "INV_Gauntlets_04", "=q3=铁指虎",        "=ds=#h1#, #w13#", "18.18%" };
        { 2941, "INV_Weapon_ShortBlade_18", "=q3=监狱骨片", "=ds=#h1#, #w4#", "16.05%" };
        };

    ----------------------------
    --Blackfathom Deeps -------
    ----------------------------

    BFDGhamoora = {
        { 6907, "INV_Shirt_06", "=q3=海龟护甲",  "=ds=#s5#, #a3#", "30.59%" },
        { 0,"","","" },
        { 6908, "INV_Belt_24", "=q2=加摩拉的绳索", "=ds=#s10#, #a1#", "45.81%" },
        };

    BFDLadySarevess = {
        { 888, "INV_Gauntlets_13", "=q3=纳迦军用手套",  "=ds=#s9#, #a2#", "33.72%" },
        { 0,"","","" },
        { 11121, "INV_Sword_36", "=q2=黑水刀",      "=ds=#h3#, #w10#", "33.10%" },
        { 3078, "INV_Weapon_Bow_04", "=q2=纳迦穿心者", "=ds=#w2#", "16.87%" },
        };

    BFDGelihast = {
        { 6906, "INV_Gauntlets_10", "=q3=海藻手套",   "=ds=#s9#, #a3#", "38.24%" },
        { 0,"","","" },
        { 6905, "INV_Weapon_Halberd_06", "=q2=暗礁战斧", "=ds=#h2#, #w1#", "42.29%" },
        { 0,"","","" },
        { 1470, "INV_Misc_Bag_05", "=q1=鱼人皮包", "=ds=#m13# #e10#", "14.13%" },
        };

    BFDBaronAquanis = {
        { 16782, "Spell_Shadow_Teleport", "=q1=奇怪的水球", "=ds=#m2# (#m6#)", "90.35%" },
        };

    BFDTwilightLordKelris = {
        { 1155, "INV_Staff_06", "=q3=梦游者魔棒", "=ds=#h2#, #w9#", "45.59%" },
        { 0,"","","" },
        { 6903, "INV_Pants_02", "=q2=凝望短裤",     "=ds=#s11#, #a1#", "31.90%" },
        };

    BFDOldSerrakis = {
        { 6901, "INV_Misc_MonsterScales_03", "=q3=发光的蛇颈龙斗篷", "=ds=#s4#", "36.14%" },
        { 6904, "INV_Misc_MonsterFang_01", "=q3=瑟拉吉斯之刺",       "=ds=#h1#, #w4#", "15.34%" },
        { 0,"","","" },
        { 6902, "INV_Bracer_08", "=q2=瑟拉吉斯指环",                "=ds=#s8#, #a2#", "29.24%" },
        };

    BFDAkumai = {
        { 6910, "INV_Pants_14", "=q3=吸血短裤",         "=ds=#s11#, #a1#", "29.72%" },
        { 6911, "INV_Belt_25", "=q3=苔藓腰带",           "=ds=#s10#, #a2#", "29.01%" },
        { 6909, "INV_Sword_42", "=q3=海蛇之击", "=ds=#h2#, #w10#", "14.46%" },
        };
       
    BFDTrash = {
        { 1454, "INV_Axe_21", "=q3=执行者黑斧",             "=ds=#h1# #w1#", "0.01%" },
        { 1481, "INV_Axe_13", "=q3=冷酷之爪",               "=ds=#h1# #w1#", "0.01%" },
        { 1486, "INV_Shirt_02", "=q3=树皮夹克",             "=ds=#s5#, #a1#", "0.02%" },
        { 1491, "INV_Jewelry_Ring_14", "=q3=精准之戒",      "=ds=#s13#", "0.01%" },
        { 2271, "INV_Staff_31", "=q3=神佑先知法杖",         "=ds=#w9#", "0.02%" },
        { 2567, "INV_Weapon_ShortBlade_15", "=q3=唤灵之刃", "=ds=#h1# #w4#", "0.02%" },
        { 3413, "INV_Sword_29", "=q3=末日之刺",             "=ds=#h1# #w4#", "0.01%" },
        { 3414, "INV_Mace_08", "=q3=纹章节杖",              "=ds=#h3# #w6#", "0.01%" },
        { 3415, "INV_Staff_32", "=q3=修士法杖",             "=ds=#w9#", "0.02%" },
        { 3416, "INV_Chest_Chain", "=q3=殉难者链甲",        "=ds=#s5#, #a3#", "0.01%" },
        { 3417, "INV_Sword_13", "=q3=玉髓双刃刀",           "=ds=#h2# #w10#", "0.01%" },
        };

    ----------------------------
    -- Wailing Caverns -----------
    ----------------------------

    WCLordCobrahn = {
        { 6460, "INV_Belt_03", "=q3=考布莱恩的腰带",             "=ds=#s10#, #a3#", "16.20%" },
        { 10410, "INV_Pants_11", "=q3=尖牙护腿",      "=ds=#s11#, #a2#", "16.03%" },
        { 0, "", "", "" },
        { 6465, "INV_Chest_Cloth_36", "=q2=水蛇法袍", "=ds=#s5#, #a1#", "51.73%" },
        };

    WCLadyAnacondra = {
        { 10412, "INV_Belt_30", "=q2=尖牙腰带",       "=ds=#s10#, #a2#", "8.63%" },
        { 0, "", "", "" },
        { 5404, "INV_Shoulder_08", "=q1=坚硬的肩垫", "=ds=#s3#, #a2#", "58.61%" },
        { 6446, "INV_Misc_Bag_12", "=q1=蛇皮袋",       "=ds=#e10#", "6.61%" },
        };

    WCKresh = {
        { 13245, "INV_Shield_18", "=q3=克雷什之背",            "=ds=#w8#", "9.17%" },
        { 0, "", "", "" },
        { 6447, "INV_Shield_21", "=q1=破旧的龟壳盾牌", "=ds=#w8#", "63.66%" },
        };

    WCLordPythas = {
        { 6472, "INV_Wand_10", "=q3=毒蛇之刺",     "=ds=#h1#, #w6#", "28.24%" },
        { 0, "", "", "" },
        { 6473, "INV_Shirt_16", "=q2=尖牙铠甲", "=ds=#s5#, #a2#", "52.06%" },
        };

    WCSkum = {
        { 6449, "INV_Chest_Cloth_15", "=q3=发光的蜥蜴披风", "=ds=#s4#", "38.24%" },
        { 0, "", "", "" },
        { 6448, "INV_Weapon_ShortBlade_10", "=q2=尾钉",          "=ds=#h1#, #w4#", "39.24%" },
        };

    WCLordSerpentis = {
        { 6469, "INV_Weapon_Bow_10", "=q3=毒蛇",      "=ds=#w2#", "16.63%" },
        { 0, "", "", "" },
        { 6459, "INV_Boots_01", "=q2=野蛮锁靴",       "=ds=#s12#, #a3#", "24.39%" },
        { 5970, "INV_Gauntlets_19", "=q2=毒蛇手套",    "=ds=#s9#, #a1#", "20.96%" },
        { 10411, "INV_Boots_04", "=q2=尖牙足垫", "=ds=#s12#, #a2#", "19.07%" },
        };

   WCVerdan = {
        { 6630, "INV_Shield_10", "=q3=淡云圆盾", "=ds=#w8#", "35.38%" },
        { 6631, "INV_Staff_25", "=q3=生命之根",        "=ds=#h2# #w9#", "34.47%" },
        { 0, "", "", "" },
        { 6629, "INV_Misc_Cape_17", "=q2=蜘蛛斗篷",    "=ds=#s4#", "16.65%" },
        };

   WCMutanus = {
        { 6461, "INV_Shoulder_05", "=q3=粘液覆盖的垫肩",       "=ds=#s3#, #a1#", "22.96%" },
        { 6463, "INV_Jewelry_Ring_15", "=q3=深渊之戒",       "=ds=#s13#", "21.99%" },
        { 6627, "INV_Chest_Plate08", "=q3=穆坦努斯的胸甲", "=ds=#s5#, #a3#", "18.33%" },
        { 0, "", "", "" },
        { 10441, "INV_Stone_03", "=q1=发光的碎片",                "=ds=#m2#" },
        };

   WCDeviateFaerieDragon = {
        { 5243, "INV_Wand_11", "=q3=彩火魔杖",         "=ds=#w12#", "39.65%" };
        { 0, "", "", "" },
        { 6632, "INV_Misc_Cape_02", "=q2=灵鳞披风", "=ds=#s4#", "37.84%" };
        };
        
    WCViper = {
        { 10410, "INV_Pants_11", "=q3=尖牙护腿", "#x1#", "16.03%" },
        { 10412, "INV_Belt_30", "=q2=尖牙腰带", "#x2#", "8.64%" },
        { 10411, "INV_Boots_04", "=q2=尖牙足垫", "#x3#", "19.08%" },
        { 10413, "INV_Gauntlets_18", "=q2=尖牙手套", "#x4#", "1.20%" },
        { 6473, "INV_Shirt_16", "=q2=尖牙铠甲", "#x5#", "52.05%" },
        }; 

    ----------------------------
    -- The Deadmines ------------
    ----------------------------

    VCRhahkZor = {
        { 872, "INV_ThrowingAxe_01", "=q2=切石者",     "=ds=#h2#, #w1#", "3.13%" },
        { 0, "", "", "" },
        { 5187, "INV_Hammer_09", "=q1=拉克佐之锤", "=ds=#h2#, #w6#", "77.98%" },
        };

    VCMinerJohnson = {
        { 5443, "INV_Shield_02", "=q3=镀金圆盾", "=ds=#w8#", "37.21%" },
        { 0, "", "", "" },
        { 5444, "INV_Misc_Cape_11", "=q2=矿工斗篷",     "=ds=#s4#", "54.88%" },
        };

    VCSneed = {
        { 5194, "INV_ThrowingAxe_06", "=q3=工头战斧",     "=ds=#h2#, #w1#", "26.23%" },
        { 0, "", "", "" },
        { 5195, "INV_Gauntlets_23", "=q2=金斑手套",  "=ds=#s9#, #a1#", "62.38%" },
        { 1937, "INV_Sword_24", "=q2=电锯",                 "=ds=#h1#, #w10#", "8.75%" },
        { 0, "", "", "" },
        { 2169, "INV_Weapon_ShortBlade_05", "=q1=蜂鸣之刃", "=ds=#h1#, #w4#", "70.78%" },
        };

    VCGilnid = {
        { 1156, "INV_Jewelry_Ring_09", "=q3=豪华珠宝戒指", "=ds=#s13#", "35.02%" },
        { 0, "", "", "" },
        { 5199, "INV_Pants_02", "=q2=铁匠短裤",               "=ds=#s11#, #a2#", "51.37%" },
        };

    VCDefiasGunpowder = {
        { 5397, "INV_Head_1", "=q1=迪菲亚火药", "=ds=#m3#", "100%" },
        };

    VCCaptainGreenskin = {
        { 5201, "INV_Staff_13", "=q3=火石法杖",      "=ds=#h2#, #w9#", "34.10%" },
        { 0, "", "", "" },
        { 5200, "INV_Spear_07", "=q2=穿刺鱼叉",      "=ds=#w7#", "25.39%" },
        { 10403, "INV_Belt_26", "=q2=黑暗迪菲亚腰带", "=ds=#s10#, #a2#", "23.26%" },
        };

    VCVanCleef = {
        { 5202, "INV_Shirt_08", "=q3=海盗的罩衫",             "=ds=#s5#, #a1#", "22.86%" },
        { 5193, "INV_Misc_Cape_08", "=q3=兄弟会斗篷",     "=ds=#s4#", "21.25%" },
        { 10399, "INV_Chest_Leather_08", "=q3=黑暗迪菲亚护甲", "=ds=#s5#, #a2#", "14.77%" },
        { 5191, "INV_Sword_24", "=q3=残酷倒钩",                      "=ds=#h1#, #w10#", "14.17%" },
        { 0, "", "", "" },
        { 2874, "INV_Letter_15", "=q1=未寄出的信",               "=ds=#m2#" },
        { 3637, "INV_Misc_Head_Human_01", "=q1=范克里夫的头颅", "=ds=#m2#" },
        };

    VCMrSmite = {
        { 7230, "INV_Hammer_09", "=q3=重拳先生的大锤", "=ds=#h2#, #w6#", "17.27%" },
        { 0, "", "", "" },
        { 5192, "INV_Sword_24", "=q2=盗贼之刃",          "=ds=#h1#, #w10#", "34.96%" },
        { 5196, "INV_Axe_22", "=q2=重拳先生的战斧",           "=ds=#h1#, #w1#", "33.95%" },
        };

    VCCookie = {
        { 5198, "INV_Staff_02", "=q3=曲奇的搅汤棒",     "=ds=#w12#", "30.90%" },
        { 0, "", "", "" },
        { 5197, "INV_Fabric_Silk_02", "=q2=曲奇的吹火棍", "=ds=#h1#, #w6#", "49.62%" },
        { 0, "", "", "" },
        { 8490, "INV_Box_PetCarrier_01", "=q1=猫笼 (黑尾白猫)", "=ds=#e15#", "12.38%" },
        };
        
    VCDefias = {
        { 10399, "INV_Chest_Leather_08", "=q3=黑暗迪菲亚护甲", "#x6#", "14.77%" },
        { 10403, "INV_Belt_26", "=q2=黑暗迪菲亚腰带", "#x7#", "23.26%" },
        { 10402, "INV_Boots_05", "=q2=黑暗迪菲亚长靴", "#x8#", "1.23%" },
        { 10401, "INV_Gauntlets_18", "=q2=黑暗迪菲亚手套", "#x9#", "1.76%" },
        { 10400, "INV_Pants_12", "=q2=黑暗迪菲亚护腿", "#x9#", "1.64%" },
        }; 

    ----------------------------
    -- The Sunken Temple -------
    ----------------------------

    STTrollMinibosses = {
        { 10787, "INV_Bracer_18", "=q3=[随机前缀]之阿塔莱手套",           "=ds=#s9#, #a1# =q1=随机前缀" },
        { 10783, "INV_Shoulder_18", "=q3=[随机前缀]之阿塔莱肩甲",      "=ds=#s3#, #a2# =q1=随机前缀" },
        { 10784, "INV_Chest_Chain_05", "=q3=[随机前缀]之阿塔莱胸甲", "=ds=#s5#, #a3# =q1=随机前缀" },
        { 0, "", "", "" },
        { 10788, "INV_Belt_15", "=q2=[随机前缀]之阿塔莱束带",             "=ds=#s10#, #a4# =q1=随机前缀" },
        { 10786, "INV_Boots_01", "=q2=[随机前缀]之阿塔莱长靴",             "=ds=#s12#, #a3# =q1=随机前缀" },
        { 10785, "INV_Pants_07", "=q2=[随机前缀]之阿塔莱护腿",          "=ds=#s11#, #a2# =q1=随机前缀" },
        };

    STAtalalarion = {
        { 10800, "INV_Bracer_08", "=q3=[随机前缀]之暗水护腕",   "=ds=#s8#, #a2# =q1=随机前缀" },
        { 10798, "INV_Belt_15", "=q3=阿塔利拉恩的牙环", "=ds=#s10#, #a4#" },
        { 10799, "INV_Spear_06", "=q3=刺头之矛",               "=ds=#w7#" },
        };

    STDreamscythe = {
        { 12464, "INV_Gauntlets_19", "=q3=血火之爪",     "=ds=#s9#, #a2#", "4.99%" },
        { 10797, "INV_Sword_09", "=q3=喷火者",             "=ds=#h1#, #w10#", "4.57%" },
        { 12243, "INV_Weapon_Halberd_04", "=q3=烟熏之爪", "=ds=#w7#", "4.50%" },
        { 12465, "INV_Misc_Cape_05", "=q3=夜幕披风",      "=ds=#s4#", "4.42%" },
        { 12463, "INV_Sword_19", "=q3=龙牙之剑",        "=ds=#h2#, #w10#", "4.40%" },
        { 10796, "INV_Misc_Orb_03", "=q3=[随机前缀]之火石",         "=ds=#s15# =q1=随机前缀", "4.26%" },
        { 12466, "INV_Belt_11", "=q3=黎明尖塔束带",            "=ds=#s10#, #a1#", "4.16%" },
        { 10795, "INV_Jewelry_Ring_04", "=q3=[随机前缀]之龙爪指环", "=ds=#s13# =q1=随机前缀", "3.68%" },
        };

    STWeaver = {
        { 12463, "INV_Sword_19", "=q3=龙牙之剑",        "=ds=#h2#, #w10#", "5.00%" },
        { 10796, "INV_Misc_Orb_03", "=q3=[随机前缀]之火石",         "=ds=#s15# =q1=随机前缀", "4.47%" },
        { 10795, "INV_Jewelry_Ring_04", "=q3=[随机前缀]之龙爪指环", "=ds=#s13# =q1=随机前缀", "4.46%" },
        { 12243, "INV_Weapon_Halberd_04", "=q3=烟熏之爪", "=ds=#w7#", "4.42%" },
        { 12465, "INV_Misc_Cape_05", "=q3=夜幕披风",      "=ds=#s4#", "4.20%" },
        { 12464, "INV_Gauntlets_19", "=q3=血火之爪",     "=ds=#s9#, #a2#", "4.10%" },
        { 10797, "INV_Sword_09", "=q3=喷火者",             "=ds=#h1#, #w10#", "4.08%" },
        { 12466, "INV_Belt_11", "=q3=黎明尖塔束带",            "=ds=#s10#, #a1#", "3.89%" },
        };

    STAvatarofHakkar = {
        { 12462, "INV_Chest_Cloth_42", "=q4=风蛇的拥抱", "=ds=#s5#, #a1#", "0.15%" },
        { 0, "", "", "" },
        { 10842, "INV_Pants_14", "=q3=风鳞布裙",                  "=ds=#s11#, #a2#", "33.22%" },
        { 10846, "INV_Boots_01", "=q3=溅血胫甲",                 "=ds=#s12#, #a3#", "32.44%" },
        { 10843, "INV_Misc_Cape_05", "=q3=羽毛斗篷",              "=ds=#s4#", "31.12%" },
        { 10845, "INV_Chest_Plate08", "=q3=战士的拥抱",            "=ds=#s5#, #a4#", "30.44%" },
        { 10838, "INV_Mace_11", "=q3=哈卡之力",                    "=ds=#h3#, #w6#", "16.37%" },
        { 10844, "INV_Staff_32", "=q3=哈卡之塔",                   "=ds=#h2#, #w9#", "16.02%" },
        };

    STJammalan = {
        { 10808, "INV_Gauntlets_17", "=q3=阿塔莱预言者手套",      "=ds=#s9#, #a1#", "26.74%" },
        { 10806, "INV_Chest_Cloth_38", "=q3=阿塔莱预言者法衣", "=ds=#s5#, #a1#", "24.13%" },
        { 10807, "INV_Pants_11", "=q3=阿塔莱预言者褶裙",            "=ds=#s11#, #a1#", "23.00%" },
        };

    STOgom = {
        { 10804, "INV_Hammer_11", "=q2=诅咒之拳",   "=ds=#h1#, #w6#", "30.03%" },
        { 10805, "INV_Axe_12", "=q2=食尸者",       "=ds=#h3#, #w1#", "28.27%" },
        { 10803, "INV_Sword_38", "=q2=奥戈姆之刃", "=ds=#h3#, #w10#", "28.21%" },
        };

    STMorphaz = {
        { 12463, "INV_Sword_19", "=q3=龙牙之剑",        "=ds=#h2#, #w10#", "4.35%" },
        { 12465, "INV_Misc_Cape_05", "=q3=夜幕披风",      "=ds=#s4#", "4.29%" },
        { 10797, "INV_Sword_09", "=q3=喷火者",             "=ds=#h1#, #w10#", "4.24%" },
        { 12464, "INV_Gauntlets_19", "=q3=血火之爪",     "=ds=#s9#, #a2#", "4.21%" },
        { 10796, "INV_Misc_Orb_03", "=q3=[随机前缀]之火石",         "=ds=#s15# =q1=随机前缀", "4.18%" },
        { 12466, "INV_Belt_11", "=q3=黎明尖塔束带",            "=ds=#s10#, #a1#", "4.12%" },
        { 12243, "INV_Weapon_Halberd_04", "=q3=烟熏之爪", "=ds=#w7#", "4.09%" },
        { 10795, "INV_Jewelry_Ring_04", "=q3=[随机前缀]之龙爪指环", "=ds=#s13# =q1=随机前缀", "4.07%" },
        };

    STHazzas = {
        { 12464, "INV_Gauntlets_19", "=q3=血火之爪",     "=ds=#s9#, #a2#", "5.00%" },
        { 10796, "INV_Misc_Orb_03", "=q3=[随机前缀]之火石",         "=ds=#s15# =q1=随机前缀", "4.92%" },
        { 12463, "INV_Sword_19", "=q3=龙牙之剑",        "=ds=#h2#, #w10#", "4.58%" },
        { 12243, "INV_Weapon_Halberd_04", "=q3=烟熏之爪", "=ds=#w7#", "4.56%" },
        { 10797, "INV_Sword_09", "=q3=喷火者",             "=ds=#h1#, #w10#", "4.50%" },
        { 12465, "INV_Misc_Cape_05", "=q3=夜幕披风",      "=ds=#s4#", "4.48%" },
        { 12466, "INV_Belt_11", "=q3=黎明尖塔束带",            "=ds=#s10#, #a1#", "4.46%" },
        { 10795, "INV_Jewelry_Ring_04", "=q3=[随机前缀]之龙爪指环", "=ds=#s13# =q1=随机前缀", "4.18%" },
        };

    STEranikus = {
        { 10847, "INV_Sword_38", "=q4=龙之召唤", "=ds=#h1#, #w10#", "0.18%" },
        { 0,"","","" },
        { 10829, "INV_Jewelry_Amulet_04", "=q3=巨龙之眼",    "=ds=#s2#", "27.02%" },
        { 10833, "INV_Helmet_25", "=q3=伊兰尼库斯之角",       "=ds=#s1#, #a3#", "25.66%" },
        { 10836, "INV_Wand_04", "=q3=侵蚀魔棒",          "=ds=#w12#", "21.54%" },
        { 10835, "INV_Shield_04", "=q3=至高徽记之盾",      "=ds=#w8#", "19.17%" },
        { 10828, "INV_Weapon_ShortBlade_16", "=q3=[随机前缀]之恐惧龙指", "=ds=#h1#, #w4# =q1=随机前缀", "10.91%" },
        { 10837, "INV_Axe_07", "=q3=伊兰尼库斯之牙",          "=ds=#h3#, #w1#", "10.05%" },
        { 0,"","","" },
        { 10454, "INV_Stone_03", "=q2=伊兰尼库斯精华",      "=ds=#m2#" },
        { 10455, "INV_Stone_03", "=q2=被禁锢的伊兰尼库斯精华", "=q6=#m4# =ds=#s14#" },
        };
      
    STTrash = {
        { 10627, "INV_Staff_28", "=q3=犬牙短棒",         "=ds=#w9#", "0.02%" },
        { 10628, "INV_Sword_31", "=q3=死亡一击",         "=ds=#h2# #w10#", "0.01%" },
        { 10634, "INV_Jewelry_Ring_10", "=q3=心眼之环",  "=ds=#s13#", "0.02%" },
        { 10629, "INV_Boots_05", "=q3=迷雾行者之靴",     "=ds=#s12#, #a1#", "0.01%" },
        { 10631, "INV_Gauntlets_11", "=q3=暗水护手",     "=ds=#s9#, #a3#", "0.01%" },
        { 10626, "INV_Hammer_06", "=q3=怒火之锤",        "=ds=#h2# #w6#", "0.01%" },
        { 10633, "INV_Pants_04", "=q3=银甲护腿",         "=ds=#s11#, #a3#", "0.01%" },
        { 10632, "INV_Jewelry_Ring_03", "=q3=泥鳞护腕",  "=ds=#s8#, #a3#", "0.01%" },
        { 10801, "INV_Boots_07", "=q3=滑鳞长靴",         "=ds=#s12#, #a2#", "42.33%" },
        { 10630, "INV_Crown_01", "=q3=摄灵者之环",       "=ds=#s1#, #a1#", "0.01%" },
        { 10625, "INV_Sword_41", "=q3=隐匿之刃",         "=ds=#h1# #w4#", "0.01%" },
        { 10624, "INV_Weapon_Bow_08", "=q3=钉刺猎弓",    "=ds=#w2#", "0.02%" },
        { 10623, "INV_Axe_07", "=q3=寒冬之咬",           "=ds=#h3# #w1#", "0.01%" },
        { 0,"","","" },
        { 0,"","","" },
        { 16216, "INV_Misc_Note_01", "=q2=公式: 附魔披风 - 强效抗性", "=ds=#p4# =q2=阿塔莱巫医", "0.75%" },
        { 15733, "INV_Scroll_03", "=q3=图样: 绿龙鳞片护腿",           "=ds=#p7# =q2=黑暗虫", "1.80%" },
        { 15046, "INV_Pants_05", "=q3=绿龙鳞片护腿",                  "=ds=#s11#, #a3#" },
        };

    ----------------------------
    -- Maraudon ----------------
    ----------------------------

    MaraNoxxion = {
        { 17746, "INV_Bracer_06", "=q3=诺克赛恩的镣铐",      "=ds=#s8#, #a4#", "32.50%" },
        { 17744, "INV_Misc_Gem_Pearl_06", "=q3=诺克赛恩之心", "=ds=#s14#", "30.35%" },
        { 17745, "INV_Wand_04", "=q3=诺克赛恩魔杖",           "=ds=#w12#", "17.53%" },
        };
        
    MaraRazorlash = {
        { 17749, "INV_Shoulder_06", "=q3=树皮肩铠", "=ds=#s3#, #a2#", "22.09%" },
        { 17748, "INV_Boots_05", "=q3=腐藤便鞋",        "=ds=#s12#, #a1#", "20.60%" },
        { 0, "", "", "" },
        { 17750, "INV_Belt_25", "=q2=绿瘤束带",       "=ds=#s10#, #a1#", "22.93%" },
        { 17751, "INV_Pants_05", "=q2=藤蔓护腿",   "=ds=#s11#, #a2#", "21.65%" },
        };
        
    MaraLordVyletongue = {
        { 17754, "INV_Pants_Wolf", "=q3=恶魔欺诈者护腿", "=ds=#s11#, #a3#", "28.09%" },
        { 17755, "INV_Belt_24", "=q3=萨特之鬃",                 "=ds=#s10#, #a1#", "25.71%" },
        { 17752, "INV_Weapon_ShortBlade_09", "=q3=萨特之刺",      "=ds=#h1#, #w4#", "23.14%" },
        };
        
    MaraMeshlok = {
        { 17742, "INV_Chest_Leather_08", "=q3=蘑菇护甲", "=ds=#s5#, #a2#", "31.37%" },
        { 17741, "INV_Chest_Cloth_15", "=q3=自然的拥抱",      "=ds=#s5#, #a1#", "30.34%" },
        { 17767, "INV_Helmet_17", "=q3=花苗头饰",      "=ds=#s1#, #a3#", "28.32%" },
        };
        
    MaraCelebras = {
        { 17739, "INV_Misc_Cape_17", "=q3=丛林守护者披风", "=ds=#s4#", "30.32%" },
        { 17740, "INV_Helmet_12", "=q3=抚慰者头饰", "=ds=#s1#, #a2#", "28.59%" },
        { 17738, "Ability_Whirlwind", "=q3=塞雷布拉斯之爪",   "=ds=#h4#, #w13#", "28.22%" },
        };
        
    MaraLandslide = {
        { 17736, "INV_Gauntlets_28", "=q3=石钳护手", "=ds=#s9#, #a3#", "23.09%" },
        { 17734, "INV_Helmet_20", "=q3=山脉头盔",  "=ds=#s1#, #a4#", "20.87%" },
        { 17737, "INV_Misc_Orb_01", "=q3=云石",         "=ds=#s15#", "19.99%" },
        { 17943, "INV_Hammer_17", "=q3=石拳",         "=ds=#h3#, #w6#", "16.58%" },
        };
        
    MaraTinkererGizlock = {
        { 17718, "INV_Shield_10", "=q3=吉兹洛克的高科技圆盾", "=ds=#w8#", "30.61%" },
        { 17719, "INV_Sword_14", "=q3=发明家的聚焦剑",       "=ds=#h1#, #w10#", "27.44%" },
        { 17717, "INV_Weapon_Rifle_05", "=q3=超射程精密步枪",        "=ds=#w5#", "27.23%" },
        };
        
    MaraRotgrip = {
        { 17728, "INV_Boots_05", "=q3=白鳄长靴", "=ds=#s12#, #a2#", "26.20%" },
        { 17732, "INV_Shoulder_05", "=q3=洛特格里普衬肩",      "=ds=#s3#, #a1#", "25.73%" },
        { 17730, "INV_Axe_04", "=q3=鳄齿利斧",            "=ds=#h2#, #w1#", "19.21%" },
        };
        
    MaraPrincessTheradras = {
        { 17780, "INV_Sword_09", "=q4=无尽黑暗之刃",      "=ds=#h3#, #w4#", "0.20%" },
        { 0,"","","" },
        { 17714, "INV_Bracer_14", "=q3=岩石公主护腕", "=ds=#s8#, #a3#", "20.06%" },
        { 17713, "INV_Jewelry_Ring_17", "=q3=黑石戒指",         "=ds=#s13#", "18.92%" },
        { 17766, "INV_Hammer_10", "=q3=瑟莱德丝公主的节杖",   "=ds=#h2#, #w6#", "16.44%" },
        { 17707, "INV_Stone_01", "=q3=碎玉之心",                 "=ds=#s2#", "15.30%" },
        { 17711, "INV_Pants_04", "=q3=元素石脊护腿",   "=ds=#s11#, #a4#", "14.96%" },
        { 17710, "INV_Weapon_ShortBlade_14", "=q3=焦石飞镖",     "=ds=#h3#, #w4#", "14.24%" },
        { 17715, "INV_Crown_01", "=q3=瑟莱德丝之眼",               "=ds=#s1#, #a1#", "13.47%" },
        };

    ----------------------------
    -- ZulFarrak ---------------
    ----------------------------

    ZFAntusul = {
        { 9640, "INV_Gauntlets_26", "=q3=[随机前缀]之虎钳夹口",                "=ds=#s9#, #a4# =q1=随机前缀", "31.30%" },
        { 9641, "INV_Jewelry_Necklace_02", "=q3=活力护符",      "=ds=#s2#", "30.80%" },
        { 9639, "INV_Mace_11", "=q3=安图苏尔之手",              "=ds=#h3#, #w6#", "15.47%" },
        { 9379, "INV_Sword_45", "=q3=反击者桑萨斯",        "=ds=#h1#, #w10#", "2.10%" },
        };

    ZFWitchDoctorZumrah = {
        { 18083, "INV_Gauntlets_09", "=q3=苏玛赞护手",     "=ds=#s9#, #a1#", "24.97%" },
        { 18082, "INV_Staff_10", "=q3=祖穆拉恩的能量法杖", "=ds=#h2#, #w9#", "11.98%" },
        };
        
    ZFSezzziz = {
        { 9473, "INV_Chest_Leather_05", "=q3=霉运巫毒之皮", "=ds=#s5#, #a2#", "21.16%" },
        { 9474, "INV_Pants_05", "=q3=霉运巫毒之裙", "=ds=#s11#, #a2#", "20.96%" },
        { 9475, "INV_Spear_01", "=q3=魔鬼割皮刀", "=ds=#w7#", "20.02%" },
        { 9470, "INV_Banner_01", "=q3=大坏蛋面具", "=ds=#s1#, #a1#", "18.66%" },
        };

    ZFGahzrilla = {
        { 9469, "INV_Chest_Chain_06", "=q3=加兹瑞拉鳞片护甲", "=ds=#s5#, #a3#", "36.76%" },
        { 0, "", "", "" },
        { 9467, "INV_Misc_MonsterFang_01", "=q2=加兹瑞拉之牙",   "=ds=#h1#, #w4#", "36.83%" },
        };

    ZFDustwraith = {
        { 12471, "INV_Staff_21", "=q3=沙漠行者藤条", "=ds=#s15#", "17.71%" },
       };

    ZFChiefUkorzSandscalp = {
        { 9476, "INV_Shoulder_01", "=q3=大坏蛋肩甲",                "=ds=#s3#, #a4#", "28.17%" },
        { 9477, "INV_Staff_Goldfeathered_01", "=q3=酋长的执行者",  "=ds=#h2#, #w9#", "22.33%" },
        { 9478, "INV_Axe_07", "=q3=撕裂之锯",                                "=ds=#h3#, #w1#", "8.97%" },
        { 9479, "Ability_Mount_WhiteDireWolf", "=q3=狂乱者的拥抱", "=ds=#s1#, #a2#", "8.97%" },
        { 11086, "INV_Sword_43", "=q3=保护者迦萨斯",          "=ds=#h3#, #w10#", "1.72%" },
        };

    ZFZerillis = {
        { 12470, "INV_Bracer_04", "=q3=沙行者护足", "=ds=#s12#, #a2#", "15.55%" },
        };

    ZFTrash = {
        { 9512, "INV_Misc_Cape_05", "=q3=黑钢斗篷", "=ds=#s4#", "0.02%" },
        { 9511, "INV_Sword_40", "=q3=放血刀",       "=ds=#h1# #w10#", "0.01%" },
        { 6440, "INV_Belt_30", "=q3=刺魂者",        "=ds=#s13#", "0.01%" },
        { 9480, "INV_Spear_05", "=q3=凿眼者",       "=ds=#w7#", "0.01%" },
        { 9483, "INV_Torch_Lit", "=q3=焚化者",      "=ds=#w12#", "0.01%" },
        { 5616, "INV_Sword_31", "=q3=斩腰者",       "=ds=#h1# #w4#", "0.01%" },
        {  862, "INV_Belt_34", "=q3=符文之戒",      "=ds=#s13#", "0.02%" },
        { 9484, "INV_Pants_08", "=q3=法术震击护腿", "=ds=#s11#, #a1#", "0.01%" },
        { 9481, "INV_Axe_03", "=q3=牛头怪",         "=ds=#h2# #w1#", "0.01%" },
        { 2040, "INV_Shield_16", "=q3=巨魔保卫者",  "=ds=#w8#", "0.02%" },
        { 9482, "INV_Staff_31", "=q3=巫医藤条       ", "=ds=#w9#", "0.01%" },
        };

    ----------------------------
    -- Razorfen Downs ----------
    ----------------------------

    RFDTutenkash = {
        { 10777, "INV_Gauntlets_32", "=q3=[随机前缀]之蜘蛛手套",      "=ds=#s9#, #a2# =q1=随机前缀", "28.95%" },
        { 10776, "INV_Misc_Cape_17", "=q3=蜘蛛银丝斗篷",       "=ds=#s4#", "28.64%" },
        { 10775, "INV_Chest_Plate08", "=q3=图特卡什的甲壳", "=ds=#s5#, #a4#", "24.87%" },
        };

    RFDMordreshFireEye = {
        { 10770, "INV_Misc_Bone_ElfSkull_01", "=q3=莫德雷斯的颅骨", "=ds=#s15#", "29.59%" },
        { 10769, "INV_Misc_Orb_03", "=q3=莫德雷斯之眼",             "=ds=#s2#", "29.11%" },
        { 10771, "INV_Belt_24", "=q3=死亡法师腰带",                          "=ds=#s10#, #a1#", "27.92%" },
        };

    RFDGlutton = {
        { 10774, "INV_Shoulder_28", "=q3=血皮护肩", "=ds=#s3#, #a2#", "42.15%" },
        { 0, "", "", "" },
        { 10772, "INV_Axe_23", "=q2=暴食者之斧",        "=ds=#h1#, #w1#", "44.22%" },
        };

    RFDRagglesnout = {
        { 10767, "INV_Shield_17", "=q3=野猪之盾", "=ds=#w8#", "35.14%" },
        { 10768, "INV_Belt_11", "=q3=野猪人勇士腰带",  "=ds=#s10#, #a3#", "31.40%" },
        { 10758, "INV_Sword_45", "=q3=石猪剑",           "=ds=#h2#, #w10#", "18.51%" },
        };

    RFDAmnennar = {
        { 10762, "INV_Chest_Cloth_17", "=q3=巫妖法袍", "=ds=#s5#, #a1#", "29.52%" },
        { 10764, "INV_Chest_Plate12", "=q3=死寒护甲",   "=ds=#s5#, #a3#", "24.24%" },
        { 10763, "INV_Helmet_13", "=q3=冰铁之盔",       "=ds=#s1#, #a4#", "28.66%" },
        { 10761, "INV_Sword_34", "=q3=寒怒匕首",         "=ds=#h1#, #w4#", "13.89%" },
        { 0, "", "", "" },
        { 10765, "INV_Gauntlets_09", "=q2=白骨手指",         "=ds=#s9#, #a2#" },
        };

    RFDTrash = {
        { 10573, "INV_Sword_41", "=q3=斩骨剑",           "=ds=#h2# #w10#", "0.01%" },
        { 10582, "INV_Boots_08", "=q3=石楠皮靴",         "=ds=#s12#, #a2#", "0.02%" },
        { 10574, "INV_Misc_Cape_04", "=q3=裹尸头巾",     "=ds=#s1#, #a1#", "0.01%" },
        { 10581, "INV_Chest_Leather_08", "=q3=亡首外衣", "=ds=#s5#, #a1#", "0.02%" },
        { 10571, "INV_Misc_Bone_10", "=q3=乌黑骨棒",     "=ds=#h1# #w6#", "0.01%" },
        { 10572, "INV_Wand_01", "=q3=寒冰碎片",          "=ds=#w12# =q1=职业:=ds=法师", "0.01%" },
        { 10570, "INV_Axe_04", "=q3=杀人者",             "=ds=#h2# #w1#", "0.01%" },
        { 10567, "INV_Weapon_Bow_01", "=q3=  硬刺之弓 ", "=ds=#w2#", "0.02%" },
        { 10583, "INV_Chest_Leather_08", "=q3=硬刺皮甲", "=ds=#s5#, #a2#", "0.01%" },
        { 10584, "INV_Gauntlets_11", "=q3=强风之拳",     "=ds=#s9#, #a3#", "0.02%" },
        { 10578, "INV_Boots_01", "=q3=心灵长靴",         "=ds=#s12#, #a1#", "0.01%" },
        };

    ----------------------------
    -- Uldaman -----------------
    ----------------------------

    UldRevelosh = {
        { 9387, "INV_Boots_Plate_06", "=q2=[随机前缀]之鲁恩乌的长靴",  "=ds=#s12#, #a4# =q1=随机前缀", "20.53%" },
        { 9390, "INV_Gauntlets_17", "=q2=[随机前缀]之鲁恩乌的手套",   "=ds=#s9#, #a1# =q1=随机前缀", "20.08%" },
        { 9388, "INV_Bracer_16", "=q2=[随机前缀]之鲁恩乌的臂甲",   "=ds=#s8#, #a3# =q1=随机前缀", "19.84%" },
        { 9389, "INV_Shoulder_25", "=q2=[随机前缀]之鲁恩乌的肩甲", "=ds=#s3#, #a2# =q1=随机前缀", "18.77%" },
        };

    UldIronaya = {
        { 9409, "INV_Bracer_19", "=q3=[随机前缀]之艾隆纳亚的护腕", "=ds=#s8#, #a3# =q1=随机前缀", "32.71%" },
        { 9407, "INV_Pants_01", "=q3=石纹护腿",  "=ds=#s11#, #a1#", "31.02%" },
        { 9408, "INV_Staff_28", "=q3=铁头棒",     "=ds=#h2#, #w9#", "17.37%" },
        };

    UldAncientStoneKeeper = {
        { 9410, "INV_Gauntlets_12", "=q3=[随机前缀]之山壁之拳",       "=ds=#s9#, #a4# =q1=随机前缀", "41.61%" },
        { 0, "", "", "" },
        { 9411, "INV_Shoulder_02", "=q2=石片肩铠", "=ds=#s3#, #a3#", "43.41%" },
        };

    UldGalgannFirehammer = {
        { 11310, "INV_Shoulder_05", "=q3=烈焰先知衬肩",         "=ds=#s3#, #a1#", "17.35%" },
        { 9412, "INV_Weapon_Rifle_07", "=q3=加加恩的火枪", "=ds=#w5#", "17.10%" },
        { 0, "", "", "" },
        { 11311, "INV_Misc_Cape_08", "=q2=灰烬之鳞",         "=ds=#s4#", "36.52%" },
        { 9419, "INV_Hammer_17", "=q2=加加恩的火锤",        "=ds=#h1#, #w6#", "18.10%" },
        };

    UldGrimlok = {
        { 9415, "INV_Shirt_05", "=q3=格瑞姆洛克的部族法衣", "=ds=#s5#, #a1#", "36.51%" },
        { 9416, "INV_Spear_08", "=q3=格瑞姆洛克之矛",           "=ds=#w7#", "15.05%" },
        { 0, "", "", "" },
        { 9414, "INV_Pants_06", "=q2=油腻的护腿",           "=ds=#s11#, #a2#", "29.78%" },
        };

    UldArchaedas = {
        { 11118, "INV_Stone_15", "=q3=[随机前缀]之阿扎达斯之石", "=ds=#s13# =q1=随机前缀", "51.99%" },
        { 9413, "INV_Hammer_12", "=q3=轰石之锤",    "=ds=#h2#, #w6#", "10.94%" },
        { 9418, "INV_Sword_47", "=q3=斩石者",         "=ds=#h2#, #w10#", "10.48%" },
        };

    UldTrash = {
        { 9420, "INV_Helmet_15", "=q3=冒险者木盔",          "=ds=#s1#, #a2#", "0.01%" },
        { 9392, "INV_Sword_26", "=q3=退火钢刃",             "=ds=#h1# #w10#", "0.01%" },
        { 9393, "INV_Misc_Lantern_01", "=q3=希望信标",      "=ds=#s15#", "0.01%" },
        { 9465, "INV_Pick_01", "=q3=挖掘大师5000型",        "=ds=#h1#, #w1#", "0.01%" },
        { 9381, "INV_Staff_17", "=q3=土灵之杖",             "=ds=#w12#", "0.01%" },
        { 9397, "INV_Misc_Cape_18", "=q3=能量披风",         "=ds=#s4#", "0.01%" },
        { 9386, "INV_Torch_Lit", "=q3=挖掘者之炬",          "=ds=#h1# #w6#", "0.01%" },
        { 9424, "INV_Sword_42", "=q3=疾速之剑",             "=ds=#h1# #w10#", "0.01%" },
        { 9429, "INV_Helmet_15", "=q3=深渊矿工帽",          "=ds=#s1#, #a1#", "0.01%" },
        { 9426, "INV_Weapon_Bow_01", "=q3=浑石弓",          "=ds=#w2#", "0.01%" },
        { 9383, "INV_Axe_14", "=q3=黑曜石利斧",             "=ds=#h2# #w1#", "0.01%" },
        { 9431, "INV_Helmet_28", "=q3=教皇毡帽",            "=ds=#s1#, #a1#", "0.01%" },
        { 9425, "INV_Weapon_Halberd_08", "=q3=厄运之锤",    "=ds=#h2# #w1#", "0.01%" },
        { 9422, "INV_Musket_02", "=q3=暗炉火枪",            "=ds=#w5#", "0.01%" },
        { 9432, "INV_Bracer_14", "=q3=骨甲护腕",           "=ds=#s8#, #a4#", "0.01%" },
        { 9430, "INV_Shoulder_18", "=q3=失落年代的肩甲",    "=ds=#s3#, #a3#", "0.00%" },
        { 9406, "INV_Chest_Leather_08", "=q3=塔风皮甲",     "=ds=#s5#, #a2#", "0.01%" },
        { 9427, "INV_Misc_Bone_01", "=q3=石窟碎骨锤",       "=ds=#h1# #w6#", "0.01%" },
        { 9384, "INV_Weapon_ShortBlade_18", "=q3=石窟利刃", "=ds=#h1# #w4#", "0.01%" },
        { 9423, "INV_Hammer_07", "=q3=千斤锤",              "=ds=#h2# #w6#", "0.01%" },
        { 9391, "INV_Misc_Shovel_02", "=q3=巨铲",           "=ds=#h2# #w6# =q1=职业:=ds=战士", "0.01%" },
        { 9428, "INV_Bracer_06", "=q3=掘地腕轮",            "=ds=#s8#, #a2#", "0.01%" },
        };

    ----------------------------
    -- ScarletMonastery --------
    ----------------------------

    SMHoundmasterLoksey = {
        { 7710, "INV_Staff_18", "=q3=洛克希的教鞭", "=ds=#h2#, #w9#", "13.96%" },
        { 0, "", "", "" },
        { 7756, "INV_Gauntlets_07", "=q2=训犬手套", "=ds=#s9#, #a2#", "53.66%" },
        { 3456, "Ability_Hunter_BeastCall", "=q2=狗哨", "=ds=#e15#", "21.33%" },
        };

    SMDoan = {
        { 7714, "INV_Weapon_ShortBlade_07", "=q3=催眠之刃", "=ds=#h1#, #w4#", "39.91%" },
        { 7713, "INV_Wand_04", "=q3=幻影法杖",             "=ds=#h2#, #w9#", "38.44%" },
        { 0, "", "", "" },
        { 7711, "INV_Chest_Cloth_25", "=q2=杜安法袍",         "=ds=#s5#, #a1#", "42.86%" },
        { 7712, "INV_Shoulder_05", "=q2=杜安的衬肩",          "=ds=#s3#, #a1#", "41.96%" },
        { 7146, "INV_Misc_Key_01", "=q2=血色十字军钥匙",         "=ds=#e14#" },
        };

    SMHerod = {
        { 7718, "INV_Shoulder_01", "=q3=赫洛德的护肩",      "=ds=#s3#, #a3#", "30.82%" },
        { 7719, "INV_Helmet_25", "=q3=狂暴者头盔", "=ds=#s1#, #a3#", "30.62%" },
        { 7717, "INV_Weapon_Halberd_05", "=q3=破坏者",         "=ds=#h2#, #w1#", "12.86%" },
        { 10330, "INV_Pants_03", "=q3=血色十字军护腿",        "=ds=#s11#, #a3#", "12.75%" },
        };

    SMFairbanks = {
        { 19509, "INV_Boots_Chain_02", "=q2=生锈的锁甲战靴",   "=ds=#s12#, #a3#", "17.24%" },
        { 19508, "INV_Bracer_11", "=q2=烙印皮护腕", "=ds=#s8#, #a2#", "16.17%" },
        { 19507, "INV_Shoulder_27", "=q2=审讯者披肩",    "=ds=#s3#, #a1#", "15.94%" },
        };

    SMMograine = {
        { 7726, "INV_Shield_05", "=q3=血色指挥官之盾", "=ds=#w8#", "38.37%" },
        { 7724, "INV_Gauntlets_19", "=q3=神圣护手",       "=ds=#s9#, #a3#", "17.49%" },
        { 7723, "INV_Mace_13", "=q3=莫格莱尼的力量",                 "=ds=#h2#, #w6#", "17.13%" },
        { 10330, "INV_Pants_03", "=q3=血色十字军护腿",               "=ds=#s11#, #a3#", "12.95%" },
        };

    SMWhitemane = {
        { 7720, "INV_Helmet_12", "=q3=主教之冠",   "=ds=#s1#, #a1#", "34.01%" },
        { 7722, "INV_Jewelry_Amulet_01", "=q3=圣使护符", "=ds=#s2#", "33.23%" },
        { 7721, "INV_Hammer_02", "=q3=公正之手", "=ds=#h3#, #w6#", "18.32%" },
        };

    SMIronspine = {
        { 7686, "INV_Jewelry_Ring_04", "=q3=铁脊死灵之眼",    "=ds=#s13#", "40.08%" },
        { 7688, "INV_Chest_Plate15", "=q3=铁脊死灵之肋",  "=ds=#s5#, #a3#", "32.91%" },
        { 7687, "INV_Hammer_19", "=q3=铁脊死灵之拳",         "=ds=#h1#, #w6#", "20.34%" },
        };

    SMAzshir = {
        { 7731, "INV_Jewelry_Necklace_06", "=q3=鬼魅碎片护符", "=ds=#s2#", "32.71%" },
        { 7709, "INV_Pants_07", "=q3=荒芜护腿",              "=ds=#s11#, #a1#", "31.19%" },
        { 7708, "INV_Wand_04", "=q3=腐坏魔杖",                   "=ds=#w12#", "30.72%" },
        };

    SMFallenChampion = {
        { 7691, "INV_Helmet_28", "=q3=裹尸布", "=ds=#s1#, #a1#", "38.58%" },
        { 7690, "INV_Gauntlets_32", "=q3=乌木钳",    "=ds=#s9#, #a2#", "37.83%" },
        { 7689, "INV_Sword_12", "=q3=恐怖黎明",      "=ds=#h2#, #w10#", "19.15%" },
        };

    SMBloodmageThalnos = {
        { 7685, "INV_Misc_Orb_02", "=q3=遗忘先知宝珠", "=ds=#s15#", "47.07%" },
        { 0, "", "", "" },
        { 7684, "INV_Shoulder_05", "=q2=血法师衬肩",          "=ds=#s3#, #a1#", "48.46%" },
        };
        
    SMScarlet = {
        { 10332, "INV_Boots_02", "=q3=血色十字军战靴", "=ds=#x34#", "0.1%"},
        { 10328, "INV_Chest_Chain_07", "=q3=血色十字军护胸", "=ds=#x35#", "0.3%"},
        { 10330, "INV_Pants_03", "=q3=血色十字军护腿", "=ds=#x37#", "13.2%"},
        { 10329, "INV_Belt_06", "=q2=血色十字军腰带", "=ds=#x33#", "1.6%"},
        { 10331, "INV_Gauntlets_19", "=q2=血色十字军护手", "=ds=#x36#", "1.7%" },
        { 10333, "INV_Bracer_03", "=q2=血色十字军腕甲", "=ds=#x38#", "1.6%"},
        };

    SMTrash = {
        { 7682, "INV_Spear_01", "=q3=烙铁棍",                "=ds=#h1# #w4# =q2=#x39#", "5.56%" },
        { 0,"","","" },
        { 7759, "INV_Chest_Chain_11", "=q3=执政官护胸",      "=ds=#s5#, #a3#", "0.00%" },
        { 7728, "INV_Chest_Cloth_25", "=q3=欺诈者长袍",      "=ds=#s5#, #a1#", "0.01%" },
        { 7753, "INV_Axe_10", "=q3=溢血者",                  "=ds=#h2# #w1#", "0.01%" },
        { 7729, "INV_Weapon_Rifle_06", "=q3=穿胸步枪",       "=ds=#w5#", "0.01%" },
        { 7730, "INV_Hammer_04", "=q3=钴蓝粉碎者",           "=ds=#h2# #w6#", "0.01%" },
        { 7752, "INV_Hammer_17", "=q3=斩梦者",               "=ds=#h3# #w6#", "0.01%" },
        { 7736, "INV_Mace_11", "=q3=惩击棍棒",               "=ds=#h1# #w6#", "0.00%" },
        { 7755, "INV_Shoulder_13", "=q3=火石护肩",           "=ds=#s3#, #a2#", "0.00%" },
        { 7754, "INV_Boots_05", "=q3=前驱之靴",              "=ds=#s12#, #a2#", "0.01%" },
        { 7786, "INV_Axe_14", "=q3=劈头斧",                  "=ds=#h1# #w1#", "0.01%" },
        { 2262, "INV_Jewelry_Ring_15", "=q3=克恩印记",       "=ds=#s13#", "0.01%" },
        { 7787, "INV_Shield_02", "=q3=光辉盾牌",             "=ds=#w8#", "0.01%" },
        { 7758, "INV_Spear_08", "=q3=无情剃刀",              "=ds=#w7#", "0.00%" },
        { 5756, "INV_Weapon_ShortBlade_24", "=q3=薄刃剑",    "=ds=#h1# #w4#", "0.01%" },
        { 7761, "INV_Axe_06", "=q3=钢爪利斧",                "=ds=#h3# #w1#", "0.01%" },
        { 5819, "INV_Helmet_03", "=q3=烈焰头罩",             "=ds=#s1#, #a3#", "0.01%" },
        { 1992, "INV_Misc_Bone_OrcSkull_01", "=q3=寒沼雕像", "=ds=#s15#", "0.00%" },
        { 8225, "INV_Sword_30", "=q3=污秽穿刺者",            "=ds=#h1# #w10#", "0.01%" },
        { 8226, "INV_Sword_18", "=q3=屠夫",                  "=ds=#h3# #w10#", "0.01%" },
        { 7760, "INV_Pants_06", "=q3=统帅褶裙",              "=ds=#s11#, #a2#", "0.00%" },
        { 7727, "INV_Shoulder_23", "=q3=守卫肩铠",           "=ds=#s3#, #a2#", "0.01%" },
        { 7757, "INV_Wand_07", "=q3=风纹法杖",               "=ds=#w9#", "0.01%" },
        };

    ----------------------------
    -- 剃刀沼泽 ----------------
    ----------------------------

    RFKDeathSpeakerJargba = {
        { 2816, "INV_Mace_07", "=q3=亡语者节杖",      "=ds=#h3#, #w6#", "7.72%" },
        { 0, "", "", "" },
        { 6682, "INV_Chest_Cloth_20", "=q2=亡语者长袍", "=ds=#s5#, #a1#", "40.52%" },
        { 6685, "INV_Shoulder_09", "=q2=亡语者衬肩",   "=ds=#s3#, #a1#", "40.42%" },
        };

    RFKOverlordRamtusk = {
        { 6687, "INV_Weapon_Halbard_01", "=q3=尸体制造者", "=ds=#h2#, #w1#", "27.79%" },
        { 0, "", "", "" },
        { 6686, "INV_Helmet_09", "=q2=长牙头盔",         "=ds=#s1#, #a3#", "57.14%" },
        };

    RFKAgathelos = {
        { 6691, "INV_Misc_Bone_06", "=q3=猪牙匕首", "=ds=#h1#, #w4#", "24.85%" },
        { 0, "", "", "" },
        { 6690, "INV_Pants_14", "=q2=野兽护腿",     "=ds=#s11#, #a2#", "49.21%" },
        };

    RFKBlindHunter = {
        { 6697, "INV_Shoulder_05", "=q3=蝙蝠之翼",              "=ds=#s3#, #a1#", "27.65%" },
        { 6696, "INV_Weapon_Bow_12", "=q3=夜行者之弓",          "=ds=#w2#", "25.12%" },
        { 6695, "INV_Jewelry_Necklace_04", "=q3=冥骨护符", "=ds=#s2#", "22.24%" },
        };

    RFKCharlgaRazorflank = {
        { 6693, "INV_Misc_Bone_05", "=q3=阿迦玛甘之握", "=ds=#s13#", "32.15%" },
        { 6694, "INV_Shield_02", "=q3=阿迦玛甘之心",    "=ds=#w8#", "30.24%" },
        { 6692, "INV_Axe_18", "=q3=分叉斧",           "=ds=#h1#, #w1#", "15.43%" },
        { 0, "", "", "" },
        { 17008, "INV_Scroll_03", "=q1=小卷轴",         "=ds=#m2# (#m6#)" },
        };

    RFKEarthcallerHalmgar = {
        { 6689, "INV_Staff_01", "=q3=风灵法杖",      "=ds=#h2#, #w9#", "42.66%" },
        { 0, "", "", "" },
        { 6688, "INV_Helmet_17", "=q2=轻风头饰", "=ds=#s1#, #a2#", "43.75%" },
        };

    RFKTrash = {
        {  776, "INV_Weapon_ShortBlade_02", "=q3=仇杀", "=ds=#h1# #w4#", "0.01%" },
        { 1488, "INV_Chest_Chain", "=q3=复仇者之甲",    "=ds=#s5#, #a3#", "0.01%" },
        { 1727, "INV_Sword_26", "=q3=凋零之剑",         "=ds=#h3# #w10#", "0.02%" },
        { 1975, "INV_Sword_25", "=q3=派森的巨剑",       "=ds=#h2# #w10#", "0.02%" },
        { 1976, "INV_Hammer_16", "=q3=熔渣战锤",        "=ds=#h2# #w6#", "0.02%" },
        { 1978, "INV_Gauntlets_04", "=q3=狼爪手套",     "=ds=#s9#, #a2#", "0.02%" },
        { 2039, "INV_Jewelry_Ring_02", "=q3=朴素之戒",  "=ds=#s13#", "0.02%" },
        { 2264, "INV_Shoulder_08", "=q3=盗贼衬肩",      "=ds=#s3#, #a2#", "0.02%" },
        { 2549, "INV_Staff_25", "=q3=暗影法杖",         "=ds=#w9#", "0.02%" },
        { 4438, "INV_Bracer_03", "=q3=拳王护腕",        "=ds=#s8#, #a3#", "0.01%" },
        };

    ----------------------------
    --  Blackrock Deeps --
    ----------------------------
    BRDLordRoccor = {
        { 22234, "INV_Shoulder_09", "=q3=失落希望衬肩",        "=ds=#s3#, #a1#", "20.48%" },
        { 11632, "INV_Shoulder_26", "=q3=土渣护肩",        "=ds=#s3#, #a4#", "19.99%" },
        { 11631, "INV_Shield_02", "=q3=石壳盾牌",             "=ds=#w8#", "22.06%" },
        { 22397, "INV_Relics_IdolofFerocity", "=q3=凶猛神像", "=ds=#s16#, #e16#", "19.58%" },
        { 11630, "INV_Ammo_Bullet_02", "=q3=石片弹丸",        "=ds=#e6#", "16.82%" },
        { 0, "", "", "" },
        { 11813, "INV_Misc_Note_01", "=q2=公式：浓烟山脉之心", "=ds=#p4# #m17#", "14.79%" },
        { 11811, "INV_Misc_Gem_Bloodstone_01", "=q3=浓烟山脉之心",  "=ds=#s14#" },
        };

    BRDHighInterrogatorGerstahn = {
        { 11626, "INV_Misc_Cape_18", "=q3=黑雾斗篷",                 "=ds=#s4#", "15.98%" },
        { 11624, "INV_Shoulder_25", "=q3=肯提克护肩",                    "=ds=#s3#, #a1#", "22.45%" },
        { 22240, "INV_Boots_Chain_04", "=q3=凋零绝望胫甲", "=ds=#s12#, #a3#", "16.81%" },
        { 11625, "INV_Misc_Orb_03", "=q3=奴役之球",               "=ds=#s15#", "23.14%" },
        };
                
    BRDArena = {
           { 11678, "INV_Chest_Plate08", "=q3=阿努希尔之壳", "=ds=#s5#, #a4# =q2=#brd1#", "15.78%" },
           { 11677, "INV_Misc_Cape_19", "=q3=腐烂斗篷", "=ds=#s4# =q2=#brd1#", "23.07%" },
           { 11675, "INV_Boots_01", "=q3=蛛魔长靴", "=ds=#s12#, #a2# =q2=#brd1#", "25.84%" },
           { 11686, "INV_Belt_12", "=q3=野兽怒气腰带", "=ds=#s10#, #a2# =q2=#brd2#", "15.85%" },
           { 11679, "INV_Bracer_13", "=q3=透红护臂", "=ds=#s8#, #a3# =q2=#brd2#", "25.13%" },
           { 11685, "INV_Shoulder_13", "=q3=碎鳞护肩", "=ds=#s3#, #a2# =q2=#brd2#", "24.49%" },
           { 11729, "INV_Helmet_01", "=q3=野蛮角斗士头盔", "=ds=#s1#, #a3# =q2=#brd3#", "10.08%" },
           { 22257, "INV_Jewelry_Ring_36", "=q3=血块指环", "=ds=#s13# =q2=#brd3#", "26.28%" },
           { 22266, "INV_Spear_01", "=q3=火焰荆棘", "=ds=#h1# #w4# =q2=#brd3#", "17.98%" },
           { 22271, "INV_Pants_Leather_21", "=q3=狂乱魔法护腿", "=ds=#s11#, #a2# =q2=#brd3#", "23.24%" },
           { 11722, "INV_Shoulder_30", "=q3=破铁肩甲", "=ds=#s3#, #a3# =q2=#brd4#", "15.07%" },
           { 22270, "INV_Boots_Plate_02", "=q3=冒犯之靴", "=ds=#s12#, #a4# =q2=#brd4#", "11.97%" },
           { 11702, "INV_Axe_12", "=q3=格里兹尔的剥皮斧", "=ds=#h3#, #w1# =q2=#brd4#", "20.62%" },
           { 11610, "INV_Scroll_03", "=q3=设计图: 黑铁粉碎者", "=ds=#p2# =q2=#brd4#", "69.76%" },
           { 11703, "INV_Belt_16", "=q3=石墙腰带", "=ds=#s10#, #a4# =q2=#brd4#", "31.45%" },
           { 11635, "INV_Weapon_ShortBlade_10", "=q3=钩牙匕首", "=ds=#h1#, #w4# =q2=#brd5#", "17.26%" },
           { 11634, "INV_Gauntlets_12", "=q3=丝网手套", "=ds=#s9#, #a1# =q2=#brd5#", "24.02%" },
           { 11633, "INV_Chest_Plate02", "=q3=巨蛛甲壳", "=ds=#s5#, #a4# =q2=#brd5#", "20.61%" },
           { 11662, "INV_Belt_29", "=q3=奥科索尔腰带", "=ds=#s10#, #a1# =q2=#brd6#", "23.77%" },
           { 11824, "INV_Jewelry_Ring_08", "=q3=巨石指环", "=ds=#s13# =q2=#brd6#", "18.37%" },
           { 11665, "INV_Gauntlets_15", "=q3=食人魔先知之拳", "=ds=#s9#, #a2# =q2=#brd6#", "28.16%" },
           { 0, "", "", "" },  
        { 0, "INV_Misc_Bag_09", "=q6=驯犬者格雷布玛尔", "" },
        { 11623, "INV_Misc_Cape_20", "=q3=灵法斗篷", "=ds=#s4#", "32.09%" },
        { 11626, "INV_Misc_Cape_18", "=q3=黑雾斗篷", "=ds=#s4#", "0.60%" },
        { 11627, "INV_Boots_01", "=q3=铁索胫甲", "=ds=#s12#, #a3#", "32.09%" },
        { 11628, "INV_Weapon_Bow_04", "=q3=驯犬者长弓", "=ds=#w2#", "12.14%" },
        { 11629, "INV_Weapon_Rifle_07", "=q3=驯犬者步枪", "=ds=#w5#", "11.18%" },
        };
        
    BRDTheldren = {
        { 0, "INV_Misc_Bag_09", "=q6=T0.5套装任务中所召唤", "=q5=塞尔德林" },
        { 22330, "INV_Misc_Cape_16", "=q3=奥术掌握披风", "=ds=#s4#", "19.73%" },
        { 22305, "INV_Shoulder_05", "=q3=铁纹衬肩", "=ds=#s3#, #a1#", "30.39%" },
        { 22318, "INV_Weapon_Bow_12", "=q3=玛尔根的长弓", "=ds=#w2#", "22.88%" },
        { 22317, "INV_Gauntlets_11", "=q3=左撇子的黄铜指虎", "=ds=#w13#", "26.15%" },
        { 0, "", "", "" },
        { 22047, "INV_Jewelry_Necklace_28", "=q1=瓦塔拉克饰品的上瓣", "=ds=#m3#" },
        };

    BRDPyromantLoregrain = {
        { 11748, "INV_Staff_13", "=q3=燃烧手杖",           "=ds=#w12#", "30.20%" },
        { 11749, "INV_Pants_03", "=q3=灼鳞护腿",    "=ds=#s11#, #a3#", "21.29%" },
        { 11747, "INV_Chest_Cloth_07", "=q3=烈焰行者长袍", "=ds=#s5#, #a2#", "18.10%" },
        { 11750, "INV_Staff_18", "=q3=引火手杖",           "=ds=#h2#, #w9#", " 16.19%" },
        };
        
    BRDWarderStilgiss = {
        { 11782, "INV_Shoulder_02", "=q3=北地衬肩",           "=ds=#s3#, #a1#", "18.38%" },
        { 22241, "INV_Shoulder_07", "=q3=黑暗守望者肩甲", "=ds=#s3#, #a2#", "18.38%" },
        { 11783, "INV_Belt_33", "=q3=寒钢束腰",           "=ds=#s10#, #a3#", "20.50%" },
        { 11784, "INV_Sword_23", "=q3=仲裁者之刃",            "=ds=#h3#, #w10#", " 21.54%" },
        };

    BRDDarkCoffer = {
        { 0, "INV_Box_01", "=q6=黑暗宝箱", "" },
        { 11752, "INV_Potion_69", "=q1=被折磨者的血液", "=ds=#m3#", "44.48%" },
        { 11751, "Spell_Fire_LavaSpawn", "=q1=燃烧精华", "=ds=#m3#", "39.35%" },
        { 11753, "Spell_Shadow_EvilEye", "=q1=卡加尔之眼", "=ds=#m3#", "39.95%" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "INV_Box_01", "=q6=秘密保险箱", "" },
        { 11929, "INV_Pants_11", "=q3=鬼灵护腿", "=ds=#s11#, #a1#", "21.12%" },
        { 22256, "INV_Gauntlets_17", "=q3=法术塑能裹手", "=ds=#s9#, #a1#", "4.49%" },
        { 11926, "INV_Chest_Chain_07", "=q3=死灵胸甲", "=ds=#s5#, #a3#", "21.57%" },
        { 22205, "INV_Bracer_14", "=q3=黑钢护腕", "=ds=#s8#, #a4#", "4.24%" },
        { 11920, "INV_Axe_13", "=q3=鬼魂镰刀", "=ds=#h3# #w1#", "21.12%" },
        { 11923, "INV_Hammer_07", "=q3=恩赐之锤", "=ds=#h3# #w6#", "19.84%" },
        { 22254, "INV_Wand_02", "=q3=永恒光明魔杖", "=ds=#w12#", "3.65%" },
        { 22255, "INV_Jewelry_Ring_04", "=q3=岩浆指环", "=ds=#s13#", "4.02%" },
        };

    BRDFineousDarkvire = {
        { 11839, "INV_Helmet_44", "=q3=大石匠的眼镜",   "=ds=#s1#, #a1#", " 15.28%" },
        { 11841, "INV_Pants_09", "=q3=主设计师的长裤", "=ds=#s11#, #a1#", " 21.25%" },
        { 11842, "INV_Shoulder_15", "=q3=首席测量员的衬肩",    "=ds=#s3#, #a3#", " 20.83%" },
        { 22223, "INV_Helmet_20", "=q3=工头的面甲",    "=ds=#s1#, #a4#", " 19.73%" },
        };

    BRDLordIncendius = {
        { 11766, "INV_Bracer_05", "=q3=[随机前缀]之焰纹护腕", "=ds=#s8#, #a1# =q1=随机前缀", "18.88%" },
        { 11764, "INV_Bracer_02", "=q3=[随机前缀]之灰鳞护臂", "=ds=#s8#, #a2# =q1=随机前缀", "18.33%" },
        { 11765, "INV_Bracer_18", "=q3=[随机前缀]之焚铁护腕", "=ds=#s8#, #a3# =q1=随机前缀", "18.85%" },
        { 11767, "INV_Bracer_18", "=q3=[随机前缀]之琥珀臂甲", "=ds=#s8#, #a4# =q1=随机前缀", "19.24%" },
        { 0, "", "", "" },
        { 19268, "INV_Misc_Ticket_Tarot_Elemental_01", "=q3=元素之一", "=ds=#e19#", "2.10%" },
        };

    BRDBaelGar = {
        { 11807, "INV_Belt_11", "=q3=燃心腰带", "=ds=#s10#, #a1#", "13.59%" },
        { 11802, "INV_Pants_04", "=q3=火浪护腿",       "=ds=#s11#, #a4#", "26.75%" },
        { 11803, "INV_Hammer_09", "=q3=熔岩之力",          "=ds=#h2#, #w6#", "27.47%" },
        { 11805, "INV_Hammer_09", "=q3=燃石战锤",         "=ds=#h3#, #w6#", "17.02%" },
        };

    BRDGeneralAngerforge = {
        { 11821, "INV_Pants_09", "=q3=战争护腿",               "=ds=#s11#, #a2#", " 16.41%" },
        { 11820, "INV_Chest_Plate04", "=q3=盛饰护甲",       "=ds=#s5#, #a3#", " 18.55%" },
        { 11816, "INV_Weapon_Halberd_06", "=q3=安格弗的战斧", "=ds=#h2#, #w1#", "16.41%" },
        { 11817, "INV_Sword_25", "=q3=安格弗的剑",             "=ds=#h3#, #w10# ", "14.72%" },
        { 11810, "INV_Jewelry_Amulet_01", "=q3=正义之手",           "=ds=#s14#", "12.97%" },
        };

    BRDGolemLordArgelmach = {
        { 11822, "INV_Boots_05", "=q3=全法长靴",         "=ds=#s12#, #a1#", " 26.73%" },
        { 11823, "INV_Pants_13", "=q3=渊博褶裙",          "=ds=#s11#, #a2#", " 25.73%" },
        { 11669, "INV_Jewelry_Ring_05", "=q3=阿格曼奇之戒",       "=ds=#s13#", " 22.92%" },
        { 11819, "INV_Jewelry_Talisman_06", "=q3=复苏之风", "=ds=#s14#", "  5.75%" },
        };
        
    BRDGuzzler = {
        { 0, "INV_Box_01", "=q6=霍尔雷·黑须", "" },
        { 11735, "INV_Helmet_46", "=q3=怒气眼罩", "=ds=#s1#, #a2#", "8.11%" },
        { 18043, "INV_Boots_08", "=q3=煤工长靴", "=ds=#s12#, #a2#", "23.87%" },
        { 22275, "INV_Boots_08", "=q3=火苔长靴", "=ds=#s12#, #a2#", "23.87%" },
        { 18044, "INV_Drink_04", "=q3=霍尔雷的酒杯", "=ds=#h3#, #w6#", "31.02%" },
        { 0, "", "", "" },
        { 11312, "INV_Misc_Note_03", "=q1=遗失的雷酒秘方", "=ds=#m3#" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "INV_Box_01", "=q6=法拉克斯", "" },
        { 22212, "INV_Shoulder_16", "=q3=石傀儡肩铠",     "=ds=#s3#, #a3#", "26.04%" },
        { 11745, "INV_Gauntlets_22", "=q3=法拉克斯之拳",  "=ds=#s9#, #a4#", "29.79%" },
        { 11744, "INV_Gauntlets_11", "=q3=血拳",          "=ds=#h1#, #w13#", "28.48%" }, 
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "INV_Box_01", "=q6=雷布里·斯库比格特", "" },
        { 11612, "INV_Scroll_03", "=q3=设计图: 黑铁板甲", "=ds=#p2#", "22.20%" },
        { 0, "", "", "" },
        { 2662, "INV_Misc_Quiver_06", "=q2=雷布里的箭袋",        "=ds=#m21# #e9#", "17.03%" },
        { 2663, "INV_Misc_Ammo_Bullet_01", "=q2=雷布里的油布包", "=ds=#m21# #e8#", "15.73%" },
        { 11742, "INV_Misc_Bag_20", "=q2=旅客背包",              "=ds=#m21# #e10#", "25.07%" },
        };

    BRDFlamelash = {
        { 11808, "Spell_Fire_Fire", "=q4=烈焰之环",              "=ds=#s1#, #a1#", " 0.84%" },
        { 0, "", "", "" },
        { 11812, "INV_Misc_Cape_18", "=q3=火灵斗篷", "=ds=#s4#", " 25.25%" },
        { 11814, "INV_Gauntlets_04", "=q3=熔岩之拳",                "=ds=#s9#, #a3#", " 27.88%" },
        { 11809, "INV_Spear_01", "=q3=烈焰之怒",                     "=ds=#w7#", " 18.69%" },
        { 11832, "INV_Jewelry_Amulet_07", "=q3=博学坠饰",     "=ds=#s14#", " 14.61%" },
        { 0, "", "", "" },
        { 23320, "INV_Misc_StoneTablet_11", "=q3=石板：烈焰震击 VI", "=ds=#e20# =q1=#m1# =ds=#c7#" },
        };

    BRDPanzor = {
        { 22245, "INV_Boots_Cloth_05", "=q3=煤烟护足", "=ds=#s12#,#a1#", "22.06%" },
        { 11787, "INV_Boots_Plate_01", "=q3=岩壳长靴",         "=ds=#s12#, #a4#", " 19.96%" },
        { 11785, "INV_Shield_06", "=q3=石傀儡之盾",           "=ds=#w8#", " 21.22%" },
        { 11786, "INV_Sword_47", "=q3=大地之石",            "=ds=#h2#, #w10#", " 20.38%" },
        };
        
    BRDTomb = {
        { 0, "INV_Box_01", "=q6=七贤之箱", "" },
        { 11929, "INV_Pants_11", "=q3=鬼灵护腿", "=ds=#s11#, #a1#", "22.60%" },
        { 11925, "INV_Helmet_41", "=q3=幽灵面罩", "=ds=#s1#, #a2#", "21.63%" },
        { 11926, "INV_Chest_Chain_07", "=q3=死灵胸甲", "=ds=#s5#, #a3#", "22.08%" },
        { 11927, "INV_Pants_04", "=q3=永恒守护者腿铠", "=ds=#s11#, #a4#", "65.45%" },
        { 11920, "INV_Axe_13", "=q3=鬼魂镰刀", "=ds=#h3# #w1#", "22.61%" },
        { 11923, "INV_Hammer_07", "=q3=恩赐之锤", "=ds=#h3# #w6#", "21.29%" },
        { 11921, "INV_Hammer_08", "=q3=磐石巨锤", "=ds=#h2# #w6#", "22.23%" },
        { 11922, "INV_Weapon_ShortBlade_15", "=q3=血蚀之刃", "=ds=#h1# #w4#", "22.05%" },
        };

    BRDMagmus = {
        { 11746, "INV_Helmet_23", "=q3=石颅头盔",           "=ds=#s1#, #a4#", " 20.46%" },
        { 22208, "INV_Hammer_10", "=q3=熔岩石锤",           "=ds=#h2#, #w6#", " 22.79%" },
        { 11935, "INV_Misc_Orb_05", "=q3=玛格姆斯之石",             "=ds=#s15#", " 21.26%" },
        { 22395, "INV_Relics_TotemofRage", "=q3=怒气图腾",     "=ds=#s16#, #e17#", " 10.09%" },
        { 22400, "INV_Relics_LibramofTruth", "=q3=真言圣契", "=ds=#s16#, #e18#", "  9.75%" },
        };

    BRDImperatorDagranThaurissan = {
        { 11684, "Spell_Frost_FrostBrand", "=q4=反对者",              "=ds=#h3#, #w6#", " 0.46%" },
        { 0, "", "", "" },
        { 11930, "INV_Misc_Cape_20", "=q3=皇帝的新斗篷",     "=ds=#s4#", " 16.16%" },
        { 11924, "INV_Chest_Cloth_16", "=q3=皇冠法袍", "=ds=#s5#, #a1#", " 15.18%" },
        { 22204, "INV_Bracer_10", "=q3=名望护腕",         "=ds=#s8#, #a2#", " 12.92%" },
        { 22207, "INV_Belt_28", "=q3=追猎腰带",          "=ds=#s10#, #a3#", " 15.12%" },
        { 11931, "INV_Axe_22", "=q3=恐怖复仇者",            "=ds=#h2#, #w1#", " 15.76%" },
        { 11932, "INV_Staff_30", "=q3=智慧手杖",        "=ds=#h2#, #w9#", " 15.01%" },
        { 11928, "INV_Mace_13", "=q3=索瑞森皇家节杖",      "=ds=#s15#", " 12.86%" },
        { 11815, "INV_Jewelry_Talisman_01", "正义之手",         "=ds=#s14#", " 10.43%" },
        { 11933, "INV_Misc_Gem_Sapphire_01", "=q3=帝王宝石",     "=ds=#s2#", " 15.99%" },
        { 11934, "INV_Jewelry_Ring_24", "=q3=[随机前缀]之皇帝徽记",       "=ds=#s13# =q1=随机前缀", " 15.41%" },
        };
         
     BRDPrincess = {
       { 12557, "INV_Shoulder_25", "=q3=乌钢肩甲",       "=ds=#s3#, #a4#", "12.11%" },
       { 12554, "INV_Gauntlets_32", "=q3=传令官之手",    "=ds=#s9#, #a1#", "11.91%" },
       { 12553, "INV_Boots_02", "=q3=迅捷长靴",          "=ds=#s12#, #a2#", "11.05%" },
       { 12556, "INV_Boots_Wolf", "=q3=高阶女祭司之靴",  "=ds=#s12#, #a1#", "10.26%" },
       };

    BRDTrash = {
        { 12546, "INV_Bracer_05", "=q3=贵族腕轮",            "=ds=#s8#, #a1#", "0.01%" },
        { 12555, "INV_Boots_Plate_06", "=q3=驱逐者胫甲",     "=ds=#s12#, #a4#", "0.01%" },
        { 12552, "INV_Misc_Cape_18", "=q3=流火披风",         "=ds=#s4#", "0.01%" },
        { 12547, "INV_Gauntlets_23", "=q3=玛洛姆之握",       "=ds=#s9#, #a2#", "0.01%" },
        { 12532, "INV_Wand_07", "=q3=塑石法杖",              "=ds=#w9#", "0.01%" },
        { 12551, "INV_Misc_Cape_21", "=q3=石盾披风",         "=ds=#s4#", "0.01%" },
        { 12528, "INV_Hammer_07", "=q3=裁决之锤",            "=ds=#h2# #w6#", "0.02%" },
        { 12549, "INV_Helmet_10", "=q3=脑笼",                "=ds=#s1#, #a3#", "0.02%" },
        { 12535, "INV_Sword_41", "=q3=厄运长刀",             "=ds=#h1# #w10#", "0.01%" },
        { 12542, "INV_Chest_Cloth_40", "=q3=火葬外衣",       "=ds=#s5#, #a1#", "0.02%" },
        { 12527, "INV_Axe_13", "=q3=断肋者",                 "=ds=#h3# #w1#", "0.02%" },
        { 12550, "INV_Bracer_17", "=q3=符文傀儡镣铐",        "=ds=#s8#, #a2#", "0.02%" },
        { 12531, "INV_Weapon_ShortBlade_03", "=q3=灼热之针", "=ds=#h1#, #w4#", "0.02%" },
        { 0, "", "", "" }, 
        { 0, "", "", "" },
        { 15770, "INV_Scroll_05", "=q3=图样: 黑色龙鳞护肩",     "=ds=#p7#", "1.93%" },
        { 15781, "INV_Scroll_03", "=q3=图样: 黑色龙鳞护腿",     "=ds=#p7#", "1.88%" },
        { 11614, "INV_Scroll_06", "=q2=设计图: 黑铁锁甲",       "=ds=#p2#", "13.38%" },
        { 11606, "INV_Chest_Chain_16", "=q2=黑铁锁甲",          "=ds=#s5#, #a3#" },
        { 11615, "INV_Scroll_06", "=q2=设计图: 黑铁护肩",       "=ds=#p2#", "7.65%" },
        { 11605, "INV_Shoulder_09", "=q2=黑铁护肩",             "=ds=#s3#, #a4#" },
        { 16049, "INV_Scroll_06", "=q2=结构图: 黑铁炸弹",       "=ds=#p5#", "1.02%" },
        { 16048, "INV_Scroll_06", "=q2=结构图: 黑铁步枪",       "=ds=#p5#", "0.98%" },
        { 18654, "INV_Scroll_06", "=q2=结构图: 侏儒报警机器人", "=ds=#p5#", "1.88%" },
        { 16053, "INV_Scroll_06", "=q2=结构图: 高级技师护目镜", "=ds=#p5#", "0.45%" },
        { 18661, "INV_Scroll_06", "=q2=结构图: 世界放大器",     "=ds=#p5#", "2.00%" },
        };

    ----------------------------
    -- RagefireChasm -----------
    ----------------------------

    RFCTaragaman = {
        { 14148, "INV_Bracer_13", "=q2=水晶腕轮",          "=ds=#s8#, #a1#", "33.91%" },
        { 14149, "INV_Misc_Cape_18", "=q2=地下斗篷",       "=ds=#s4#", "31.59%" },
        { 14145, "INV_Weapon_ShortBlade_12", "=q2=被诅咒的魔刃", "=ds=#h3#, #w10#", "15.98%" },
        };

    RFCJergosh = {
        { 14150, "INV_Chest_Cloth_24", "=q2=招魂法袍",    "=ds=#s5#, #a1#", "36.40%" },
        { 14147, "INV_Bracer_07", "=q2=洞穴护腕",       "=ds=#s8#, #a3#", "34.35%" },
        { 14151, "INV_Weapon_ShortBlade_25", "=q2=圣歌之刃", "=ds=#h1#, #w4#", "17.10%" },
        };
    
  -------------------------------------
  ------Shadowfang Keep --------------
  -------------------------------------

    BSFRazorclawtheButcher = {
        { 1292, "INV_Axe_23", "=q3=屠夫的切肉刀",    "=ds=#h1#, #w1#", "8.70%" },
        { 0, "", "", "" },
        { 6633, "INV_Sword_16", "=q2=屠夫的剔骨刀",   "=ds=#h1#, #w10#", "39.53%" },
        { 6226, "INV_Chest_Cloth_24", "=q2=鲜血围裙", "=ds=#s5#, #a1#", "39.47%" },
        };

    BSFSilverlaine = {
        { 6321, "INV_Belt_29", "=q3=席瓦莱恩家族徽记", "=ds=#s13#", "18.91%" },
        { 0, "", "", "" },
        { 6323, "INV_Mace_02", "=q3=巴隆的节杖",           "=ds=#h3#, #w6#", "37.93%" },
        };

    BSFSpringvale = {
        { 6320, "INV_Shield_03", "=q3=指挥官纹章盾", "=ds=#w8#", "27.71%" },
        { 0, "", "", "" },
        { 3191, "INV_Axe_06", "=q2=曲刃战斧", "=ds=#h2#, #w1#", "31.73%" },
        };

    BSFOdotheBlindwatcher = {
        { 6318, "INV_Staff_27", "=q3=奥杜之杖", "=ds=#h2#, #w9#", "29.97%" },
        { 0, "", "", "" },
        { 6319, "INV_Belt_03", "=q2=盲者束带", "=ds=#s10#, #a2#", "57.15%" },
        };

    BSFFenrustheDevourer = {
        { 6340, "INV_Misc_Pelt_Wolf_02", "=q2=芬鲁斯的外皮", "=ds=#s4#", "58.02%" },
        { 3230, "INV_Bracer_07", "=q2=黑狼护腕",   "=ds=#s8#, #a2#", "14.76%" },
        };

    BSFWolfMasterNandos = {
        { 3748, "INV_Shoulder_05", "=q3=猎豹衬肩", "=ds=#s3#, #a1#", "48.55%" },
        { 0, "", "", "" },
        { 6314, "INV_Misc_Cape_10", "=q2=狼王斗篷", "=ds=#s4#", "33.25%" },
        };

    BSFArchmageArugal = {
        { 6392, "INV_Belt_10", "=q3=阿鲁高的腰带",            "=ds=#s10#, #a1#", "30.51%" },
        { 6324, "INV_Chest_Cloth_31", "=q3=阿鲁高法袍",    "=ds=#s5#, #a1#", "30.50%" },
        { 6220, "INV_Weapon_ShortBlade_25", "=q3=流星碎片", "=ds=#h1#, #w4#", "15.78%" },
        };
     
  BSFTrash = {
        { 1318, "INV_ThrowingAxe_06", "=q3=黑暗之斧",       "=ds=#h2# #w1#", "0.01%" },
        { 1482, "INV_Sword_13", "=q3=暗影之牙",             "=ds=#h3# #w10#", "0.01%" },
        { 1483, "INV_Hammer_08", "=q3=碎脸者",              "=ds=#h1# #w6#", "0.02%" },
        { 1484, "INV_Wand_04", "=q3=巫术手杖",              "=ds=#w9#", "0.01%" },
        { 1489, "INV_Chest_Leather_08", "=q3=阴暗护甲",     "=ds=#s5#, #a2#", "0.01%" },
        { 1935, "INV_Weapon_ShortBlade_24", "=q3=刺客之刃", "=ds=#h1# #w4#", "0.01%" },
        { 1974, "INV_Bracer_07", "=q3=刺灵护腕",            "=ds=#s8#, #a1#", "0.02%" },
        { 2205, "INV_Sword_41", "=q3=暮色之剑",             "=ds=#h2# #w10#", "0.01%" },
        { 2292, "INV_Chest_Cloth_36", "=q3=死者之袍",       "=ds=#s5#, #a1#", "0.01%" },
        { 2807, "INV_Axe_24", "=q3=断头斧",                 "=ds=#h3#, #w1#", "0.01%" },
        { 3194, "INV_Mace_01", "=q3=黑暗怨念",              "=ds=#h2# #w6#", "0.02%" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "INV_Box_01", "=q6=地狱战马", "" },
        { 6341, "INV_Misc_Lantern_01", "=q2=怪异的马厩灯笼", "=ds=#s15#", "5.48%" },
        { 0, "", "", "" },
        { 0, "INV_Box_01", "=q6=死亡之誓 (稀有)", "" },
        { 6642, "INV_Chest_Chain_05", "=q3=幻影之甲",        "=ds=#s5#, #a3#", "30.49%" },
        { 6641, "INV_Sword_17", "=q2=鬼魂之刃",              "=ds=#h2# #w10#", "58.60%" },
        };

    -------------------------------
    ----Dire Maul EAST ------------
    -------------------------------
                 
    DMEPusillin = {
        { 18267, "INV_Scroll_03", "=q2=食谱：洛恩塔姆薯块", "=ds=#p3# #m16#", "71.55%" },
        { 0, "", "", "" },
        { 18249, "INV_Misc_Key_10", "=q1=月牙钥匙", "=ds=#e14#", "100%" },
        };

    DMEZevrimThornhoof = {
        { 18319, "INV_Helmet_38", "=q3=[随机抗性]之炽热头盔",   "=ds=#s1#, #a3# =q1=随机抗性", " 7.88%" },
        { 18313, "INV_Helmet_19", "=q3=警觉头盔", "=ds=#s1#, #a4#", "17.87%" },
        { 18323, "INV_Weapon_Bow_03", "=q3=萨特强弓",   "=ds=#w2#", "17.24%" },
        { 0, "", "", "" },
        { 18308, "INV_Helmet_51", "=q2=聪明帽",                "=ds=#s1#, #a2#", "23.73%" },
        { 18306, "INV_Gauntlets_22", "=q2=暗影迷雾手套", "=ds=#s9#, #a1#", " 21.40%" },
        };

    DMELethtendris = {
        { 18325, "INV_Helmet_31", "=q3=魔皮软帽",              "=ds=#s1#, #a2#", "24.67%" },
        { 18311, "INV_Staff_14", "=q3=奎尔多雷导能魔杖", "=ds=#h2#, #w9#", " 7.30%" },
        { 0, "", "", "" },
        { 18302, "INV_Jewelry_Ring_20", "=q2=活力指环", "=ds=#s13#", " 29.30%" },
        { 18301, "INV_Wand_06", "=q2=蕾瑟塔蒂斯的魔杖",    "=ds=#w12#", " 25.57%" },
        }; 

    DMEHydro = {
        { 18322, "INV_Boots_08", "=q3=海风长靴",            "=ds=#s12#, #a2#", " 16.42%" },
        { 18324, "INV_Axe_17", "=q3=削浪者",                    "=ds=#h2#, #w1#", "  8.46%" },
        { 18317, "INV_Jewelry_Necklace_03", "=q3=暴雨护符", "=ds=#s2#", " 16.44%" },
        { 0, "", "", "" },
        { 18307, "INV_Boots_05", "=q2=破潮软鞋",        "=ds=#s12#, #a1#", "  21.33%" },
        { 18305, "INV_Pants_04", "=q2=破水护腿", "=ds=#s11#, #a4#", "22.75%" },
        };

    DMEAlzzin = {
        { 18327, "INV_Belt_17", "=q3=刺藤腰带",                   "=ds=#s10#, #a1#", "16.53%" },
        { 18328, "INV_Misc_Cape_17", "=q3=影木披风",            "=ds=#s4#", "  15.36%" },
        { 18309, "INV_Gauntlets_20", "=q3=恢复手套",      "=ds=#s9#, #a2#", "  14.05%" },
        { 18318, "INV_Boots_01", "=q3=怜悯胫甲",               "=ds=Fett, #a3#", "  14.88%" },
        { 18312, "INV_Chest_Plate11", "=q3=充能胸甲",      "=ds=#s5#, #a4#", "  16.08%" },
        { 18326, "INV_Gauntlets_31", "=q3=剃刀护手",            "=ds=#s9#, #a4#", "  18.62%" },
        { 0, "", "", "" },
        { 18321, "INV_Mace_13", "=q3=高能魔棒",                   "=ds=#h3#, #w6#", " 15.94%" },
        { 18310, "INV_Sword_18", "=q3=恶魔弯刀",               "=ds=#h1#, #w10#", " 15.39%" },
        { 18315, "INV_Jewelry_Ring_28", "=q3=恶魔力量之戒", "=ds=#s13#", " 15.40%" },
        { 18314, "INV_Jewelry_Ring_31", "=q3=恶魔狡诈之戒",   "=ds=#s13#", " 13.71%" },
        };
        
    DMEIsalien = {
        { 0, "INV_Misc_Bag_09", "=q6=T0.5套装任务中所召唤", "=q5=伊萨莉恩" },
        { 22304, "INV_Gauntlets_27", "=q3=铁纹手套", "=ds=#s9#, #a1#", "16.24%" },
        { 22472, "INV_Boots_08", "=q3=凶猛之靴", "=ds=#s12#, #a2#", "12.55%" },
        { 22314, "INV_Spear_06", "=q3=猎手之矛", "=ds=#w7#", "15.50%" },
        { 22315, "INV_Hammer_02", "=q3=新生之锤", "=ds=#h3# #w6#", "13.65%" },
        { 22401, "INV_Relics_LibramofHope", "=q3=希望圣契", "=ds=#s16#, #e18#", "14.76%" },        
        { 22345, "INV_Relics_TotemofRebirth", "=q3=重生图腾", "=ds=#s16#, #e17#", "2.95%" },
        { 0, "", "", "" },
        { 21984, "INV_Jewelry_Necklace_30", "=q1=瓦塔拉克饰品的左瓣", "=ds=#m3#" },
        { 22046, "INV_Jewelry_Necklace_29", "=q1=瓦塔拉克饰品的右瓣", "=ds=#m3#" },
        };

    DMETrash = {
        { 18289, "INV_Jewelry_Necklace_09", "=q3=刺毛荆棘项链", "=ds=#s2#", "0.87%" },
        { 18296, "INV_Bracer_06", "=q3=神射手腕轮",             "=ds=#s8#, #a3#", "0.59%" },
        { 18298, "INV_Pants_11", "=q3=放肆护腿",                "=ds=#s11#, #a2#", "0.62%" },
        { 18295, "INV_Boots_06", "=q3=相位长靴",                "=ds=#s12#, #a1#", "1.26%" },
        };

    -------------------------------------
    -----Dire Maul North------------------
    -------------------------------------

    DMNGuardMoldar = {
        { 18497, "INV_Bracer_13", "=q3=庄严护腕",      "=ds=#s8#, #a1#", " 4.14%" },
        { 18496, "INV_Misc_Cape_02", "=q3=紫罗兰披风",      "=ds=#s4#", " 4.68%" },
        { 18494, "INV_Shoulder_15", "=q3=洞穴守卫护肩", "=ds=#s3#, #a3#", " 4.62%" },
        { 18493, "INV_Shoulder_26", "=q3=巨大的铁护肩",   "=ds=#s3#, #a4#", "  3.96%" },
        { 18498, "INV_Axe_11", "=q3=修剪器",                 "=ds=#h1#, #w1#", " 4.94%" },
        { 0, "", "", "" },
        { 18450, "INV_Chest_Cloth_24", "=q2=燃烧法袍",           "=ds=#s5#, #a1#", " 6.57%" },
        { 18451, "INV_Belt_16", "=q2=土狼皮带",                     "=ds=#s10#, #a2#", "  6.61%" },
        { 18458, "INV_Bracer_03", "=q2=谦虚护臂",                  "=ds=#s8#, #a3#", "  7.12%" },
        { 18459, "INV_Bracer_19", "=q2=豪侠护腕",             "=ds=#s8#, #a4#", "   6.09%" },
        { 18462, "INV_Gauntlets_13", "=q2=粗糙的骨制手套",               "=ds=#h3#, #w13#", "  7.54%" },
        { 18463, "INV_Sword_04", "=q2=食人魔小刀",                  "=ds=#h1#, #w10#", "  7.38%" },
        { 18460, "INV_Weapon_Rifle_07", "=q2=简易手持火炮", "=ds=#w5#", "  5.86%" },
        { 18464, "INV_Jewelry_Ring_06", "=q2=戈多克鼻环",            "=ds=#s13#", "  6.52%" },
        };

    DMNStomperKreeg = {
        { 18269, "INV_Drink_03", "=q2=克雷格的绿酒", "=ds=#e3#", "100%" },
        { 18284, "INV_Drink_05", "=q2=克雷格的烈酒", "=ds=#e3#", "100%" },
        { 18425, "INV_Drink_05", "=q2=克雷格的杯子", "=ds=#s15#", "40.24%" },
        };

    DMNGuardFengus = {
        { 18450, "INV_Chest_Cloth_24", "=q2=燃烧法袍",           "=ds=#s5#, #a1#", "   9.76%" },
        { 18451, "INV_Belt_16", "=q2=土狼皮带",                     "=ds=#s10#, #a2#", "10.64%" },
        { 18458, "INV_Bracer_03", "=q2=谦虚护臂",                  "=ds=#s8#, #a3#", "11.41%" },
        { 18459, "INV_Bracer_19", "=q2=豪侠护腕",             "=ds=#s8#, #a4#", " 9.60%" },
        { 18463, "INV_Sword_04", "=q2=食人魔小刀",                  "=ds=#h1#, #w10#", " 11.02%" },
        { 18462, "INV_Gauntlets_13", "=q2=粗糙的骨制手套",               "=ds=#h3#, #w13#", " 11.79%" },
        { 18460, "INV_Weapon_Rifle_07", "=q2=简易手持火炮", "=ds=#w5#", "   9.07%" },
        { 18464, "INV_Jewelry_Ring_06", "=q2=戈多克鼻环",            "=ds=#s13#", "   11.41%" },
        };
    
    DMNThimblejack = {
        { 18414, "INV_Scroll_04", "=q4=图样：大法师腰带", "=ds=#p8# #m14#", "1.00%" },
        { 18517, "INV_Scroll_04", "=q4=图样：多彩披风", "=ds=#p9# #p7# #m14#", "0.92%" },
        { 18518, "INV_Scroll_04", "=q4=图样：野性之皮", "=ds=#p10# #p7# #m14#", "1.29%" },
        { 18519, "INV_Scroll_04", "=q4=图样：移形披风", "=ds=#p11# #p7# #m14#", "1.14%" },
        { 0, "", "", "" },
        { 18415, "INV_Scroll_05", "=q3=图样：恶魔布手套", "=ds=#p8# #m14#", "9.62%" },
        { 18416, "INV_Scroll_05", "=q3=图样：地狱火手套", "=ds=#p8#", "10.66%" },
        { 18417, "INV_Scroll_05", "=q3=图样：月布手套", "=ds=#p8# #m14#", "10.28%" },
        { 18418, "INV_Scroll_05", "=q3=图样：监护披风", "=ds=#p8# #m14#", "9.75%" },
        { 18514, "INV_Scroll_05", "=q3=图样：洞察束带", "=ds=#p7# #m14#", "10.90%" },
        { 18515, "INV_Scroll_05", "=q3=图样：猫鼬长靴", "=ds=#p7# #m14#", "11.18%" },
        { 18516, "INV_Scroll_05", "=q3=图样：迅行护腕", "=ds=#p7# #m14#", "10.26%" },
        { 0, "", "", "" },
        { 18240, "INV_Potion_08", "=q2=食人魔鞣酸", "=ds=#m3#", "31.05%" },
        { 0, "", "", "" },
        { 18405, "INV_Belt_31", "=q4=大法师腰带", "=ds=#s10#, #a1#" },
        { 18509, "INV_Misc_Cape_02", "=q4=多彩披风", "=ds=#s4#" },
        { 18510, "INV_Misc_Cape_01", "=q4=野性之皮", "=ds=#s4#" },
        { 18511, "INV_Misc_Cape_20", "=q4=移形披风", "=ds=#s4#" },
        { 0, "", "", "" },
        { 18407, "INV_Gauntlets_19", "=q3=恶魔布手套", "=ds=#s9#, #a1#" },
        { 18408, "INV_Gauntlets_19", "=q3=地狱火手套", "=ds=#s9#, #a1#" },
        { 18409, "INV_Gauntlets_17", "=q3=月布手套", "=ds=#s9#, #a1#" },
        { 18413, "INV_Misc_Cape_06", "=q3=监护披风", "=ds=#s4#" },
        { 18504, "INV_Belt_26", "=q3=洞察束带", "=ds=#s10#, #a2#" },
        { 18506, "INV_Boots_08", "=q3=猫鼬长靴", "=ds=#s12#, #a2#" },
        { 18508, "INV_Bracer_05", "=q3=迅行护腕", "=ds=#s8#, #a3#" },
        { 0, "", "", "" },
        { 18258, "INV_Potion_08", "=q2=戈多克食人魔装", "=ds=#m3#", },
        };

    DMNGuardSlipkik = {
        { 18497, "INV_Bracer_13", "=q3=庄严护腕",      "=ds=#s8#, #a1#", " 4.75%" },
        { 18496, "INV_Misc_Cape_02", "=q3=紫罗兰披风",      "=ds=#s4#", " 5.82%" },
        { 18494, "INV_Shoulder_15", "=q3=洞穴守卫护肩", "=ds=#s3#, #a3#", "5.70%" },
        { 18493, "INV_Shoulder_26", "=q3=巨大的铁护肩",   "=ds=#s3#, #a4#", " 4.89%" },
        { 18498, "INV_Axe_11", "=q3=修剪器",                 "=ds=#h1#, #w1#", " 6.01%" },
        { 0, "", "", "" },
        { 18450, "INV_Chest_Cloth_24", "=q2=燃烧法袍",           "=ds=#s5#, #a1#", "  6.78%" },
        { 18451, "INV_Belt_16", "=q2=土狼皮带",                     "=ds=#s10#, #a2#", "   7.83%" },
        { 18458, "INV_Bracer_03", "=q2=谦虚护臂",                  "=ds=#s8#, #a3#", "  7.63%" },
        { 18459, "INV_Bracer_19", "=q2=豪侠护腕",             "=ds=#s8#, #a4#", "  6.98%" },
        { 18462, "INV_Gauntlets_13", "=q2=粗糙的骨制手套",               "=ds=#h3#, #w13#", "  8.52%" },
        { 18463, "INV_Sword_04", "=q2=食人魔小刀",                  "=ds=#h1#, #w10#", " 7.74%" },
        { 18460, "INV_Weapon_Rifle_07", "=q2=简易手持火炮", "=ds=#w5#", " 6.66%" },
        { 18464, "INV_Jewelry_Ring_06", "=q2=戈多克鼻环",            "=ds=#s13#", "  7.36%" },
        };

    DMNCaptainKromcrush = {
        { 18507, "INV_Boots_05", "=q3=圆月长靴",       "=ds=#s12#, #a1#", "18.75%" },
        { 18505, "INV_Belt_02", "=q3=沼泽鳄皮腰带",                 "=ds=#s10#, #a2#", " 18.06%" },
        { 18503, "INV_Chest_Chain_14", "=q3=克罗卡斯的胸甲", "=ds=#s5#, #a4#", " 17.48%" },
        { 18502, "INV_Weapon_Halberd_09", "=q3=巨型长刃",    "=ds=#w7#", " 21.47%" },
        { 0, "", "", "" },
        };

    DMNKingGordok = {
        { 18526, "INV_Crown_01", "=q3=食人魔领袖之冠",       "=ds=#s1#, #a1#", " 17.17%" },
        { 18525, "INV_Bracer_12", "=q3=繁荣护腕",       "=ds=#s8#, #a2#", "19.15%" },
        { 18527, "INV_Gauntlets_10", "=q3=和谐护手",     "=ds=#s9#, #a3#", "19.73%" },
        { 18524, "INV_Pants_03", "=q3=毁灭护腿",      "=ds=#s11#, #a3#", "18.55%" },
        { 18521, "INV_Boots_Plate_01", "=q3=肮脏的金属靴",      "=ds=#s12#, #a4#", " 17.80%" },
        { 18520, "INV_Sword_11", "=q3=残暴之刃",              "=ds=#h2#, #w10#", " 16.44%" },
        { 18523, "INV_Misc_Orb_01", "=q3=明亮的石头",    "=ds=#s15#", " 20.21%" },
        { 18522, "INV_Jewelry_Ring_32", "=q3=食人魔大王指环", "=ds=#s13#", "14.96%" },
        { 0, "", "", "" },
        { 19258, "INV_Misc_Ticket_Tarot_Warlord_01", "=q3=督军之一", "=ds=#e19#", "1.84%" },
        { 0, "", "", "" },
        { 18780, "INV_Misc_Note_06", "=q3=《高级铸甲技术：第一卷》的上半部", "=ds=#m1#", "6.00%" },
        { 12727, "INV_Scroll_05", "=q3=设计图:魔化瑟银板甲", "=ds=#m4#" },
        };
    DMNChoRushtheObserver = {
        { 18490, "INV_Helmet_41", "=q3=洞悉兜帽",               "=ds=#s1#, #a2#", "21.46%" },
        { 18485, "INV_Shield_13", "=q3=观察者盾牌",             "=ds=#h4#, #w8#", "22.96%" },
        { 18484, "INV_Weapon_ShortBlade_04", "=q3=克鲁什之刃",  "=ds=#h1# #w10#", "22.46%" },
        { 18483, "INV_Wand_05", "=q3=法力引导魔杖",             "=ds=#w12#", "19.01%" },
        };

    DMNTRIBUTERUN = {
        { 18538, "INV_Axe_10", "=q4=古树天敌",                 "=ds=#h2#, #w1#" },
        { 0, "", "", "" },
        { 18495, "INV_Misc_Cape_21", "=q3=壁垒披风",           "=ds=#s4#" },
        { 18532, "INV_Chest_Cloth_29", "=q3=心灵漩涡长袍",        "=ds=#s5#, #a1#" },
        { 0, "", "", "" },
        { 18528, "INV_Shoulder_26", "=q3=飓风肩铠",        "=ds=#s3#, #a2#" },
        { 18530, "INV_Chest_Chain_12", "=q3=食人魔锁甲",   "=ds=#s5#, #a3#" },
        { 18529, "INV_Belt_18", "=q3=[随机抗性]之元素板甲束带",    "=ds=#s10#, #a4# =q1=随机抗性" },
        { 18533, "INV_Bracer_14", "=q3=戈多克能量护腕",    "=ds=#s8#, #a4#" },
        { 18534, "INV_Staff_32", "=q3=食人魔法师魔棒",        "=ds=#h2#, #w9#" },
        { 18531, "INV_Hammer_22", "=q3=坚硬巨槌",            "=ds=#h2#, #w6#" },
        { 18499, "INV_Shield_10", "=q3=荆棘盾牌",             "=ds=#w8#" },
        { 18500, "INV_Jewelry_Ring_13", "=q3=暗淡的精灵戒指", "=ds=#s13#" },
        { 18537, "INV_Stone_02", "=q3=反击磁石",     "=ds=#s14#" },
        { 0, "", "", "" },
        { 18475, "INV_Belt_07", "=q2=古怪的魔法腰带",                "=ds=#s10#, #a1#" },
        { 18476, "INV_Boots_07", "=q2=沾泥的靴子",                "=ds=#s12#, #a2#" },
        { 18477, "INV_Pants_14", "=q2=粗糙的护腿s",                  "=ds=#s11#, #a2#" },
        { 18478, "INV_Chest_Leather_06", "=q2=土狼皮外套",        "=ds=#s5#, #a2#" },
        { 18479, "INV_Helmet_11", "=q2=腐蝎头盔",            "=ds=#s1#, #a3#" },
        { 18480, "INV_Helmet_23", "=q2=板壳头盔",               "=ds=#s1#, #a4#" },
        { 18481, "INV_Mace_05", "=q2=碎骨钉锤",                "=ds=#h2#, #w6#" },
        { 18482, "INV_Weapon_Bow_05", "=q2=食人魔牙签发射器",      "=ds=#w2#" },
        { 18655, "INV_Scroll_06", "=q2=结构图：强力净化器", "=ds=#p5# #m15#" },
        };

    ------------------------------------------
    ------Dire Maul West ---------------------
    ------------------------------------------

    DMWTendrisWarpwood = {
        { 18390, "INV_Pants_14", "=q3=苔藓护腿",    "=ds=#s11#, #a2#", "22.55%" },
        { 18393, "INV_Belt_34", "=q3=扭木腰带",        "=ds=#s10#, #a3#", "19.81%" },
        { 0, "", "", "" },
        { 18353, "INV_Staff_08", "=q2=石花法杖",      "=ds=#h2#, #w9#", "23.46%" },
        { 18352, "INV_Shield_18", "=q2=石化树皮盾牌", "=ds=#w8#", "21.67%" },
        };

    DMWIllyannaRavenoak = {
        { 18386, "INV_Pants_06", "=q3=教士长裤",           "=ds=#s11#, #a1#", "18.79%" },
        { 18383, "INV_Gauntlets_09", "=q3=附力护手", "=ds=#s9#, #a4#", "20.11%" },
        { 0, "", "", "" },
        { 18349, "INV_Gauntlets_12", "=q2=精准护手",  "=ds=#s9#, #a3#", "23.94%" },
        { 18347, "INV_Axe_11", "=q2=精衡战斧",            "=ds=#h1#, #w1#", "22.44%" },
        };

    DMWMagisterKalendris = {
        { 18374, "INV_Shoulder_24", "=q3=火痕护肩",      "=ds=#s3#, #a2#", "18.11%" },
        { 18397, "INV_Jewelry_Necklace_07", "=q3=法师长老饰物", "=ds=#s2#", "17.46%" },
        { 18371, "INV_Battery_02", "=q3=心灵之流",             "=ds=#s14#", " 7.45%" },
        { 0, "", "", "" },
        { 18350, "INV_Misc_Cape_18", "=q2=魔法增幅披风",           "=ds=#s4#", " 21.44%" },
        { 18351, "INV_Bracer_18", "=q2=魔法封印护腕",      "=ds=#s8#, #a4#", " 24.36%" },
        };

    DMWTsuzee = {
        { 18387, "INV_Gauntlets_16", "=q3=火花手套", "=ds=#s9#, #a1#", "24.79%" },
        { 0, "", "", "" },
        { 18346, "INV_Pants_09", "=q2=无丝长裤",    "=ds=#s11#, #a1#", "33.94%" },
        { 18345, "INV_Jewelry_Ring_15", "=q2=低语戒指",  "=ds=#s13#", "30.28%" },
        };

    DMWImmolthar = {
        { 18385, "INV_Chest_Cloth_51", "=q3=永恒长夜法袍",   "=ds=#s5#, #a1#", "15.33%" },
        { 18389, "INV_Misc_Cape_01", "=q3=和谐披风",           "=ds=#s4#", "14.35%" },
        { 18377, "INV_Gauntlets_21", "=q3=迅捷手套",              "=ds=#s9#, #a2#", "21.01%" },
        { 18391, "INV_Belt_26", "=q3=眼柄腰带",                      "=ds=#s10#, #a2#", "20.08%" },
        { 18379, "INV_Boots_Plate_06", "=q3=憎恶胫甲",              "=ds=#s12#, #a3#", " 19.81%" },
        { 18394, "INV_Bracer_05", "=q3=恶魔嚎叫护腕",           "=ds=#s8#, #a3#", "17.51%" },
        { 18384, "INV_Shoulder_17", "=q3=胆汁肩铠",          "=ds=#s3#, #a4#", "14.71%" },
        { 18372, "INV_Weapon_ShortBlade_18", "=q3=新月之刃", "=ds=#h3#, #w4#", "6.99%" },
        { 18370, "INV_Misc_StoneTablet_04", "=q3=警惕护符",        "=ds=#s14#", "6.30%" },
        { 18381, "INV_Misc_Eye_01", "=q3=邪眼坠饰",               "=ds=#s2#", "17.78%" },
        };
        
    DMWHelnurath = {
        { 18757, "INV_Shoulder_25", "=q3=恶魔衬肩", "=ds=#a1# #s3#", "23.12%" },
        { 18754, "INV_Bracer_15", "=q3=魔能护腕", "=ds=#a4# #s8#", "19.24%" },
        { 18755, "INV_Weapon_Rifle_03", "=q3=克索诺斯火棍", "=ds=#w5#", "21.92%" },
        { 18756, "INV_Shield_17", "=q3=恐怖卫士之盾", "=ds=#w8#", "19.77%" },
        };

    DMWPrinceTortheldrin = {
        { 18382, "INV_Misc_Cape_14", "=q3=[随机抗性]之脉动披风",          "=ds=#s4# =q1=随机抗性", "21.84%" },
        { 18375, "INV_Bracer_07", "=q3=日蚀护腕",           "=ds=#s8#, #a2#", "15.62%" },
        { 18373, "INV_Chest_Leather_08", "=q3=宁静胸甲", "=ds=#s5#, #a2#", " 6.32%" },
        { 18378, "INV_Pants_03", "=q3=银月护腿",               "=ds=#s11#, #a3#", "21.20%" },
        { 18380, "INV_Pants_04", "=q3=怪异强化腿甲",     "=ds=#s11#, #a4#", " 15.87%" },
        { 18392, "INV_Weapon_ShortBlade_05", "=q3=混乱匕首",    "=ds=#h1#, #w4#", "14.70%" },
        { 18396, "INV_Weapon_ShortBlade_22", "=q3=心灵雕刻者",           "=ds=#h3#, #w10#", "14.62%" },
        { 18376, "INV_Mace_07", "=q3=古旧钉锤",                      "=ds=#h1#, #w6#", "14.40%" },
        { 18388, "INV_Weapon_Crossbow_08", "=q3=破石者",            "=ds=#w3#", " 7.72%" },
        { 18395, "INV_Jewelry_Ring_11", "=q3=碧绿烈焰戒指",         "=ds=#s13#", "14.55%" },
        };
    
    ---------------------
    -- Dire Maul Books --
    ---------------------
    
    DMBooks = {
        { 18358, "INV_Misc_Book_01", "=q3=奥法师的食谱", "=ds=#e20#, =q1=#m1#=ds=#c3#" },
        { 18362, "INV_Misc_Book_08", "=q3=光明不会告诉你的事情", "=ds=#e20#, =q1=#m1#=ds=#c5#" },
        { 18360, "INV_Misc_Book_05", "=q3=束缚之影", "=ds=#e20#, =q1=#m1#=ds=#c8#" },
        { 18364, "INV_Misc_Book_10", "=q3=翡翠梦境", "=ds=#e20#, =q1=#m1#=ds=#c1#" },
        { 18356, "INV_Misc_Book_06", "=q3=迦罗娜：潜行与诡计研究", "=ds=#e20#, =q1=#m1#=ds=#c6#" },
        { 18361, "INV_Misc_Book_02", "=q3=最伟大的猎手", "=ds=#e20#, =q1=#m1#=ds=#c2#" },
        { 18363, "INV_Misc_Book_04", "=q3=你与冰霜震击", "=ds=#e20#, =q1=#m1#=ds=#c7#" },
        { 18357, "INV_Misc_Book_07", "=q3=防御宝典", "=ds=#e20#, =q1=#m1#=ds=#c9#" },
        { 18359, "INV_Misc_Book_11", "=q3=圣光之力", "=ds=#e20#, =q1=#m1#=ds=#c4#" },
        { 0,"","","" },
        { 18333,"INV_Misc_Book_04","=q2=专注圣契","=ds=#e20#" },
        { 18334,"INV_Misc_Book_11","=q2=防护圣典","=ds=#e20#" },
        { 18332,"INV_Misc_Book_02","=q2=急速圣典","=ds=#e20#" },
        { 0,"","","" },
        { 0,"","","" },
        { 18468, "INV_Jewelry_Talisman_10", "=q3=埃雷萨拉斯皇家徽记", "=ds=#s14#, =q1=#m1#=ds=#c3#" },
        { 18469, "INV_Jewelry_Talisman_10", "=q3=埃雷萨拉斯皇家徽记", "=ds=#s14#, =q1=#m1#=ds=#c5#" },
        { 18467, "INV_Jewelry_Talisman_10", "=q3=埃雷萨拉斯皇家徽记", "=ds=#s14#, =q1=#m1#=ds=#c8#" },
        { 18470, "INV_Jewelry_Talisman_10", "=q3=埃雷萨拉斯皇家徽记", "=ds=#s14#, =q1=#m1#=ds=#c1#" },
        { 18465, "INV_Jewelry_Talisman_10", "=q3=埃雷萨拉斯皇家徽记", "=ds=#s14#, =q1=#m1#=ds=#c6#" },
        { 18473, "INV_Jewelry_Talisman_10", "=q3=埃雷萨拉斯皇家徽记", "=ds=#s14#, =q1=#m1#=ds=#c2#" },
        { 18471, "INV_Jewelry_Talisman_10", "=q3=埃雷萨拉斯皇家徽记", "=ds=#s14#, =q1=#m1#=ds=#c7#" },
        { 18466, "INV_Jewelry_Talisman_10", "=q3=埃雷萨拉斯皇家徽记", "=ds=#s14#, =q1=#m1#=ds=#c9#" },
        { 18472, "INV_Jewelry_Talisman_10", "=q3=埃雷萨拉斯皇家徽记", "=ds=#s14#, =q1=#m1#=ds=#c4#" },
        { 0,"","","" },
        { 18401,"INV_Misc_Book_11","=q4=弗洛尔的屠龙技术纲要","=ds=#e20#, =q1=#m1#=ds=#c9#, #c4#" },
        { 18348,"INV_Sword_01","=q4=奎尔塞拉","=ds=#h3# #w10#, =q1=#m1#=ds=#c9#, #c4#" },
        };
        
    ---------------------------------
    ----UPPER BLACKROCK SPIRE--------
    ---------------------------------

    UBRSEmberseer = {
        { 16672,"INV_Gauntlets_11","=q3=野火斗篷",    "=ds=#s9#, #a3# (T0, #c7#)",        "14.23%" },
        { 0,"","","" },
        { 12905,"INV_Chest_Cloth_16","=q3=强击护肩",          "=ds=#s4#",                "15.20%" },
        { 12927,"INV_Shoulder_10","=q3=元素护手",       "=ds=#s3#, #a2#",  "17.47%" },
        { 12929,"INV_Jewelry_Necklace_05","=q3=灰烬之怒","=ds=#s2#",               "15.89%" },
        { 12926,"Spell_Holy_InnerFire","=q3=[随机抗性]之喷焰指环",   "=ds=#s13# =q1=随机抗性", "18.52%" },
        };

    UBRSRunewatcher = {
       { 12604,"INV_Crown_02","=q3=星火头冠",                  "=ds=#s1#, #a1#",       "28.64%" },
       { 12605,"INV_Misc_Bone_ElfSkull_01","=q3=蜿蜒骨杖", "=ds=#w12#",              "32.95%" },
       { 12930,"INV_Misc_Root_02","=q3=石楠之环",              "=ds=#s14#",           "26.36%" },
       };

    UBRSFLAME = {
        { 16695, "INV_Shoulder_02", "=q3=虔诚衬肩", "=ds=#s3#, #a1# (T0, #c5#)", "12.84%" },
        { 0,"","","" },
        { 12589, "INV_Belt_11", "=q3=尘羽腰带", "=ds=#s10#, #a1#", "12.84%" },
        { 12609, "INV_Chest_Cloth_17", "=q3=幻色裹衣", "=ds=#s5#, #a1#", "15.82%" },
        { 12603, "INV_Chest_Plate06", "=q3=深夜外套", "=ds=#s5#, #a2#", "15.06%" },
        { 12606, "INV_Belt_10", "=q3=晶化束带", "=ds=#s10#, #a2#", "14.04%" },
        { 0,"","","" },
        { 18657, "INV_Scroll_06", "=q3=结构图：高辐射烈焰反射器", "=ds=#p5# #m18#", "7.38%" },
        { 0,"","","" },
        { 13371, "INV_Misc_Orb_05", "=q2=烈焰之父", "=ds=#s15#", "100%" },
        };

    UBRSAnvilcrack = {
        { 18047,"INV_Boots_02","=q3=烈焰行者",                    "=ds=#s12#, #a3#",              "18.05%" },
        { 13502,"INV_Belt_23","=q3=手工精制束带",    "=ds=#s10#, #a4#",            "15.78%" },
        { 13498,"INV_Pants_04","=q3=手工精制护腿", "=ds=#s11#, #a4#",             "20.63%" },
        { 18048,"INV_Hammer_06","=q3=大铸甲师之锤",            "=ds=#h3#, #w6#",         "17.26%" },
        { 0,"","","" },
        { 12837,"INV_Scroll_03","=q3=设计图：精工风暴战锤", "=ds=#p2# #m14#", "4.80%" },
        { 12834,"INV_Scroll_03","=q3=设计图：奥金勇士剑",      "=ds=#p2# #m14#", " 4.75%" },
        { 0,"","","" },
        { 18779,"INV_Misc_Note_06","=q3=《高级铸甲技术：第一卷》的下半部","=ds=#m3#", "17.08%" },
        };

    UBRSRend = {
        { 12590,"INV_Weapon_ShortBlade_25","=q4=恶魔之击","=ds=#h1# #w4#",      "1.06%" },
        { 0,"","","" },
        { 16733,"INV_Shoulder_30","=q3=勇气肩甲","=ds=#s3#, #a4# (T0, #c9#)",        "13.39%" },
        { 0,"","","" },
        { 22247,"INV_Boots_Cloth_03","=q3=虔诚医者长靴","=ds=#s12#, #a1#",      "12.71%" },
        { 18102,"INV_Boots_05","=q3=龙骑兵长靴","=ds=#s12#, #a1#",               "14.35%" },
        { 12587,"INV_Helmet_46","=q3=雷德之眼","=ds=#s1#, #a2#",                 "14.50%" },
        { 18104,"INV_Belt_03","=q3=野性之潮腰带","=ds=#s10#, #a3#",                "15.30%" },
        { 12588,"INV_Shoulder_11","=q3=骨刺护肩","=ds=#s3#, #a3#",        "0.85%" },
        { 12935,"INV_Pants_04","=q3=战争统帅护腿","=ds=#s11#, #a4#",             "15.05%" },
        { 12936,"INV_Bracer_17","=q3=雷德的护腕","=ds=#s8#, #a4#",          "16.96%" },
        { 12939,"INV_Sword_40","=q3=雷德的部族护卫者","=ds=#h4#, #w10#",    "7.61%" },
        { 12940,"INV_Sword_43","=q3=雷德的神圣控诉者","=ds=#h3#, #w10#",     "6.79%" },
        { 12583,"INV_Weapon_Halberd_04","=q3=黑手魔锯","=ds=#w7# ", "7.44%" },
        { 18103,"INV_Jewelry_Ring_16","=q3=沉思指环","=ds=#s13#",       "15.38%" },
        };

    UBRSGyth = {
        { 12871,"INV_Shield_21","=q4=多彩龙鳞","=ds=#m3#", "2.64%" },
        { 0,"","","" },
        { 16669,"INV_Shoulder_29","=q3=元素护肩","=ds=#s3#, #a3# (T0, #c7#)",                     "14.77%" },
        { 0,"","","" },
        { 22225,"INV_Helmet_27","=q3=[随机抗性]之龙皮罩帽","=ds=#s1#, #a1# =q1=随机抗性",        "11.85%" },
        { 12960,"INV_Helmet_24","=q3=[随机抗性]之部族作战羽盔","=ds=#s1#, #a2# =q1=随机抗性", "15.24%" },
        { 12953,"INV_Helmet_39","=q3=[随机抗性]之龙眼头巾","=ds=#s1#, #a3# =q1=随机抗性",        "15.99%" },
        { 12952,"INV_Helmet_23","=q3=[随机抗性]之盖斯之颅","=ds=#s1#, #a4# =q1=随机抗性",         "12.43%" },
        { 0,"","","" },
        { 13522,"INV_Scroll_06","=q2=配方: 多重抗性合剂", "=ds=#p1# #m14#",  "2.95%" },
        };

    UBRSBeast = {
        { 12731, "INV_Misc_MonsterScales_15", "=q4=比斯巨兽的皮", "=ds=#m3#", "0.77%" },
        { 0,"","","" },
        { 16729,"INV_Shoulder_10","=q3=光铸肩铠", "=ds=#s3#, #a4# (T0, #c4#)",     "13.62%" },
        { 0,"","","" },
        { 22311,"INV_Boots_Cloth_05","=q3=铁纹长靴",   "=ds=#s12#, #a1#",         "12.31%" },
        { 12965,"INV_Pants_06","=q3=裹灵护腿",   "=ds=#s11#, #a1#",         "13.16%" },
        { 12967,"INV_Misc_Cape_05","=q3=血月披风",     "=ds=#s4#",                "18.30%" },
        { 12968,"INV_Misc_Cape_18","=q3=霜纹斗蓬",    "=ds=#s4#",                "14.47%" },
        { 12966,"INV_Bracer_07","=q3=黑雾护臂",    "=ds=#s8#, #a2#",      "16.06%" },
        { 12963,"INV_Pants_06","=q3=剑圣护腿",    "=ds=#s11#, #a2#",       "12.74%" },
        { 12964,"INV_Pants_04","=q3=三态护腿",       "=ds=#s11#, #a3#",          "18.16%" },
        { 12969,"INV_Hammer_17","=q3=横扫重锤",         "=ds=#h2#, #w6#",      "11.49%" },
        { 12709,"INV_Sword_33","=q3=芬克的剥皮刀",        "=ds=#h3#, #w4#",   " 6.95%" },
        { 0,"","","" },
        { 24101, "INV_Misc_Book_02", "=q3=凶猛撕咬 V", "=ds=#e20# =q1=#m1# =ds=#c1#", "1.44%" },
        { 19227, "INV_Misc_Ticket_Tarot_Beasts_01", "=q3=野兽之一", "=ds=#e19#", "4.53%" },
        };
    
    UBRSValthalak = {
        { 0, "INV_Misc_Bag_09", "=q6=T0.5套装任务中所召唤", "=q5=瓦塔拉克公爵" },
        { 22302, "INV_Helmet_30", "=q3=铁纹罩帽", "=ds=#s1#, #a1#", "27.72%" },
        { 22337, "INV_Misc_Cape_19", "=q3=统御披风", "=ds=#s4#", "23.37%" },
        { 22342, "INV_Pants_09", "=q3=折磨护腿", "=ds=#s11#, #a1#", "23.10%" },
        { 22343, "INV_Gauntlets_11", "=q3=残暴护手", "=ds=#s9#, #a3#", "20.11%" },
        { 22335, "INV_Staff_07", "=q3=瓦塔拉克公爵的命令法杖", "=ds=#h2# #w9#", "14.67%" },
        { 22336, "INV_Shield_02", "=q3=军团徽记龙盾", "=ds=#w8#", "17.66%" },
        { 22339, "INV_Jewelry_Ring_35", "=q3=巫师符文指环", "=ds=#s13#", "15.49%" },
        { 22340, "INV_Jewelry_Necklace_04", "=q3=迅捷坠饰", "=ds=#s2#", "17.66%" },
        };

    UBRSDrakkisath = {
        { 12592,"INV_Sword_29","=q4=沙赫拉姆黑剑",      "=ds=#h2#, #w10#", "1.08%" },
        { 0,"","","" },
        { 22267,"INV_Helmet_62","=q3=织法者头巾",                "=ds=#s1#, #a1#",      "15.50%" },
        { 22269,"INV_Misc_Cape_20","=q3=暗影徘徊者披风",           "=ds=#s4#",             "10.61%" },
        { 13142,"INV_Belt_33","=q3=黑龙束带",                         "=ds=#s10#, #a4#",     "16.40%" },
        { 22253,"INV_Misc_Book_06","=q3=失落之书",                 "=ds=#s15#",     "16.05%" },
        { 12602,"INV_Shield_20","=q3=龙人之盾",                 "=ds=#w8#", "14.52%" },
        { 13098,"INV_Jewelry_Ring_18","=q3=痛苦指环",               "=ds=#s13#",     "13.51%" },
        { 13141,"INV_Jewelry_Necklace_09","=q3=咆哮之牙",            "=ds=#s2#",             "16.83%" },
        { 22268,"INV_Jewelry_Talisman_09","=q3=龙人能量徽章",   "=ds=#s14#",          " 4.13%" },
        { 0,"","","" },
        { 15730,"INV_Scroll_03","=q3=图样：红龙鳞片胸甲","=ds=#p9# #p7# #m14#",           " 3.58%" },
        { 15047,"INV_Chest_Chain_06","=q3=红龙鳞片胸甲","=ds=#s5#, #a3#" },
        { 0,"","","" },
        { 13519,"INV_Scroll_06","=q2=配方: 泰坦合剂",         "=ds=#p1#",           " 1.72%" },
        { 0,"","","" },
        { 16688,"INV_Chest_Cloth_25","=q3=博学者长袍",     "=ds=#s5#, #a1#(T0, #c3#)",     "7.24%" },
        { 16700,"INV_Chest_Cloth_49","=q3=鬼雾长袍",       "=ds=#s5#, #a1#(T0, #c8#)",  "8.04%" },
        { 16690,"INV_Chest_Cloth_11","=q3=虔诚长袍",          "=ds=#s5#, #a1#(T0, #c5#)",   "6.20%" },
        { 16706,"INV_Chest_Plate06","=q3=野性之心外衣",        "=ds=#s5#, #a2#(T0, #c1#)", "7.36%" },
        { 16721,"INV_Chest_Leather_07","=q3=迅影外套",  "=ds=#s5#, #a2#(T0, #c6#)", "6.09%" },
        { 16674,"INV_Chest_Chain_03","=q3=野兽追猎者外套", "=ds=#s5#, #a3#(T0, #c2#)",   "6.81%" },
        { 16666,"INV_Chest_Chain_11","=q3=元素外衣",     "=ds=#s5#, #a3#(T0, #c7#)",   "3.03%" },
        { 16730,"INV_Chest_Plate03","=q3=勇气胸甲",  "=ds=#s5#, #a4#(T0, #c9#)", "5.83%" },
        { 16726,"INV_Chest_Plate03","=q3=光铸胸甲","=ds=#s5#, #a4#(T0, #c4#)", "3.76%" },
        { 0,"","","" },
        { 0,"","","" },
        { 0,"","","" },
        { 0,"","","" },
        { 0,"","","" },
        { 16663,"INV_Potion_27","=q2=黑龙勇士之血",  "=ds=#m3#", "100%" },
        };

    UBRSTrash = {
        { 24102, "INV_Misc_Book_14", "=q3=手册: 剔骨IX",   "=ds=#e20#", "0.94%" },
        { 13260, "INV_Boots_01", "=q3=风舞者之靴",         "=ds=#s12#, #a3#", "0.01%" },
        { 0,"","","" },
        { 16247, "INV_Misc_Note_01", "=q2=公式: 附魔武器 - 超强冲击", "=ds=#p4# #m15#", "1.54%" },
        };
          
    -----------------------------------
    ----------- Stratholme ------------
    -----------------------------------

    STRATSkull = {
        { 13395, "INV_Gauntlets_27", "=q3=斯库尔的骨爪",       "=ds=#s9#, #a2#", "36.52%" },
        { 13394, "INV_Chest_Chain_15", "=q3=斯库尔的寒冷拥抱",         "=ds=#s5#, #a4#",   "24.16%" },
        { 13396, "INV_Misc_Bone_ElfSkull_01", "=q3=斯库尔的苍白之触", "=ds=#w12#",    "16.85%" },
        };

    STRATStratholmeCourier={
        { 13304, "INV_Misc_Key_03", "=q1=节日小道的邮箱钥匙",     "=ds=#e14#", "45.19%" },
        { 13303, "INV_Misc_Key_03", "=q1=十字军广场邮箱钥匙", "=ds=#e14#", "43.46%" },
        { 13307, "INV_Misc_Key_03", "=q1=弗拉斯·希亚比的邮箱钥匙",      "=ds=#e14#", "42.88%" },
        { 13305,"INV_Misc_Key_03", "=q1=长者广场邮箱钥匙",     "=ds=#e14#", "36.87%" },
        { 13302, "INV_Misc_Key_03", "=q1=市场邮箱钥匙",        "=ds=#e14#", "35.58%" },
        { 13306, "INV_Misc_Key_03", "=q1=国王广场邮箱钥匙",     "=ds=#e14#", "37.69%" },
        };

    STRATFrasSiabi = {
        { 13172, "INV_Crate_01", "=q1=希亚比的烟草", "=ds=#m3#", "100%" },
        { 13171, "Spell_Fire_SearingTotem", "=q2=烟鬼的打火器", "=ds=#s14# =q6=#m4#" },
        };

    STRATHearthsingerForresten = {
        { 16682, "INV_Boots_02", "=q3=博学者长靴", "=ds=#s12#, #a1# (T0, #c3#)",      "10.86%" },
        { 0,"","","" },
        { 13378, "INV_Chest_Cloth_38", "=q3=百灵上衣", "=ds=#s5#, #a2#",         "15.31%" },
        { 13383, "INV_Pants_14", "=q3=吟游诗人热裤", "=ds=#s11#, #a3#", "18.42%" },
        { 13384, "INV_Belt_30", "=q3=彩虹束带", "=ds=#s10#, #a4#",                   "19.21%" },
        { 13379, "INV_Misc_Flute_01", "=q3=烈焰短笛", "=ds=#s14#",     "15.13%" },
        };

    STRATTheUnforgiven = {
        { 16717, "INV_Gauntlets_17", "=q3=野性之心手套", "=ds=#s9#, #a2# (T0, #c1#)",   "12.61%" },
        { 0,"","","" },
        { 13409, "INV_Bracer_13", "=q3=[随机前缀]之泪泉护腕", "=ds=#s8#, #a1# =q1=随机前缀", "14.62%" },
        { 13404, "INV_Misc_Bandana_01", "=q3=不可宽恕者的面具", "=ds=#s1#, #a2#",       "14.96%" },
        { 13405, "INV_Shoulder_25", "=q3=哀嚎肩甲", "=ds=#s3#, #a4#",    "12.10%" },
        { 13408, "INV_Weapon_Halberd_05", "=q3=破灵者", "=ds=#h3#, #w1#",              "19.33%" },
        };

    STRATTimmytheCruel = {
        { 16724, "INV_Gauntlets_19", "=q3=光铸护手",             "=ds=#s9#, #a4# (T0, #c4#)", "10.42%" },
        { 0,"","","" },
        { 13403, "INV_Belt_02", "=q3=肮脏的套索",                        "=ds=#s10#, #a1#",               "16.48%" },
        { 13402, "INV_Boots_01", "=q3=提米的靴子",                     "=ds=#s12#, #a3#",                 "16.74%" },
        { 13400, "INV_Bracer_17", "=q3=虐待者臂铠",             "=ds=#s8#, #a4#",               "14.02%" },
        { 13401, "INV_Misc_Bone_ElfSkull_01", "=q3=提米的手", "=ds=#h1#, #w6#",             "16.87%" },
        };

    STRATCannonMasterWilley = {
        { 16708, "INV_Shoulder_07", "=q3=迅影肩甲",            "=ds=#s3#, #a2# (T0, #c6#)", "10.68%" },
        { 0, "", "", "", "" },
        { 22405, "INV_Shoulder_02", "=q3=血色十字军衬肩",    "=ds=#s3#, #a1#", "16.03%" },
        { 22407, "INV_Helmet_41", "=q3=新月头盔",               "=ds=#s1#, #a2#", "13.61%" },
        { 18721, "INV_Belt_18", "=q3=掩护束带",                       "=ds=#s10#, #a3#", "12.39%" },
        { 13381, "INV_Boots_Plate_09", "=q3=炮手长靴",        "=ds=#s12#, #a4#", "12.86%" },
        { 22404, "INV_Weapon_ShortBlade_16", "=q3=威利的痒痒挠", "=ds=#h3#, #w13#", "6.26%" },
        { 22406, "INV_Staff_23", "=q3=救赎",                          "=ds=#h2#, #w9#", "7.04%" },
        { 13380, "INV_Weapon_Rifle_07", "=q3=威利的便携式榴弹炮",   "=ds=#w5#", "10.71%" },
        { 13382, "INV_Misc_Bomb_04", "=q3=便携火炮",               "=ds=#s14#", "12.28%" },
        { 22403, "INV_Jewelry_Necklace_10", "=q3=蒂亚娜的珍珠项链",   "=ds=#s2#", "14.27%" },
        { 13377, "INV_Ammo_Bullet_02", "=q3=迷你炮弹",        "=ds=#e6#", "66.61%" },
        { 0, "", "", "", "" },
        { 0, "", "", "", "" },
        { 0, "", "", "", "" },
        { 12839, "INV_Scroll_03", "=q3=设计图：觅心者", "=ds=#p2# #m14#", "4.98%" },
        { 12783, "INV_Sword_17", "=q3=觅心者", "=ds=#h1#, #w4#" },
        };

    STRATArchivistGalford = {
        { 16692, "INV_Gauntlets_14", "=q3=虔诚护手",     "=ds=#s9#, #a1# (T0, #c5#)", "12.46%" },
        { 22897, "INV_Misc_Book_07", "=q3=秘典：造食术 VII", "=ds=#e20# =q1=#m1# =ds=#c3#", "4.86%" },
        { 0, "", "", "", "" },
        { 13386, "INV_Misc_Cape_19", "=q3=[随机前缀]之档案员斗篷", "=ds=#s4# =q1=随机前缀", "18.45%" },
        { 18716, "INV_Boots_08", "=q3=灰烬覆盖的靴子",     "=ds=#s12#, #a2#", "16.30%" },
        { 13387, "INV_Belt_21", "=q3=远见束带",    "=ds=#s10#, #a3#", "18.24%" },
        { 13385, "INV_Misc_Book_05", "=q3=知识宝典", "=ds=#s15#", "9.87%" },
        { 0, "", "", "", "" },
        { 12811, "INV_Misc_Gem_Pearl_03", "=q2=正义宝珠", "=ds=#e12#", "45.41%" },
        };

    STRATBalnazzar = {
        { 13353, "INV_Misc_Book_06", "=q4=亡者之书",          "=ds=#s15#", "1.37%" },
        { 14512, "INV_Scroll_03", "=q4=图样：信念外衣", "=ds=#p8# #m14#", "3.02%" },
        { 14154, "INV_Chest_Cloth_31", "=q4=信念外衣", "=ds=#s5#, #a1# =q6=拾取后绑定 =q1=#m1# #c5#" },
        { 0, "", "", "", "" },
        { 16725, "INV_Boots_Plate_03", "=q3=光铸战靴", "=ds=#s12#, #a4# (T0, #c4#)", "11.11%" },
        { 0, "", "", "", "" },
        { 13369, "INV_Boots_05", "=q3=火焰远行之靴",                      "=ds=#s12#, #a1#", "14.84%" },
        { 18720, "INV_Shoulder_23", "=q3=纳斯雷兹姆护肩",         "=ds=#s3#, #a1#", "10.54%" },
        { 13358, "INV_Shoulder_24", "=q3=巨龙之舌",            "=ds=#s3#, #a2#", "11.58%" },
        { 13359, "INV_Helmet_03", "=q3=暴君之冠",                  "=ds=#s1#, #a3#", "13.94%" },
        { 18718, "INV_Helmet_10", "=q3=大十字军的头盔m",             "=ds=#s1#, #a4#", "10.16%" },
        { 13360, "INV_Weapon_ShortBlade_15", "=q3=精灵法师的礼物", "=ds=#h1#, #w4#", "13.66%" },
        { 13348, "INV_Sword_14", "=q3=斩魔者",                         "=ds=#h2#, #w10#", "13.94%" },
        { 18717, "INV_Hammer_06", "=q3=大十字军之锤r",      "=ds=#h2#, #w6#", "11.91%" },
        { 12103, "INV_Jewelry_Talisman_08", "=q3=秘术之星",        "=ds=#s2#", "12.48%" },
        { 13520, "INV_Scroll_06", "=q2=配方：精炼智慧合剂", "=ds=#p1#", "1.94%" },
        };
        
    STRATSothosJarien = {
        { 0, "INV_Misc_Bag_09", "=q6=T0.5套装任务中所召唤", "=q5=亚雷恩 & 索托斯" },
        { 22301, "INV_Chest_Cloth_48", "=q3=铁纹长袍", "=ds=#s5#, #a1#", "19.00%" },
        { 22328, "INV_Pants_04", "=q3=警觉腿铠", "=ds=#s11#, #a4#", "21.27%" },
        { 22329, "INV_Wand_07", "=q3=无限专注节杖", "=ds=#s15#", "28.51%" },
        { 22334, "INV_Jewelry_Ring_05", "=q3=修复之戒", "=ds=#s13#", "17.19%" },
        { 22327, "INV_Jewelry_Necklace_08", "=q3=救赎者项链", "=ds=#s2#", "14.03%" },
        { 0, "", "", "" },
        { 21984, "INV_Jewelry_Necklace_30", "=q1=瓦塔拉克饰品的左瓣", "=ds=#m3#" },
        { 22046, "INV_Jewelry_Necklace_29", "=q1=瓦塔拉克饰品的右瓣", "=ds=#m3#" },
        };

    STRATStonespine = {
        { 13397, "INV_Misc_Cape_19", "=q3=石像鬼斗篷",  "=ds=#s4#", "23.44%" },
        { 13954, "INV_Boots_08", "=q3=翠绿足垫",             "=ds=#s12#, #a2#", "25.36%" },
        { 13399, "INV_Gauntlets_11", "=q3=石像鬼之爪", "=ds=#h4#, #w13#", "26.16%" },
        { 0, "", "", "", "" },
        };

    STRATBaronessAnastari = {
        { 16704, "INV_Boots_05", "=q3=鬼雾便鞋",            "=ds=#s12#, #a1# (T0, #c8#)", "13.16%" },
        { 0, "", "", "", "" },
        { 18730, "INV_Gauntlets_16", "=q3=暗影花边裹手",  "=ds=#s9#, #a1#", "13.54%" },
        { 13534, "INV_Weapon_ShortBlade_18", "=q3=女妖之指",   "=ds=#w12#", "13.42%" },
        { 18729, "INV_Weapon_Bow_12", "=q3=尖啸之弓",          "=ds=#w2#", "15.59%" },
        { 18728, "INV_Jewelry_Necklace_11", "=q3=安娜丝塔丽的传家宝", "=ds=#s2#", "11.92%" },
        { 0, "", "", "", "" },
        { 13535, "INV_Chest_Cloth_47", "=q2=冰冷幻影长袍",  "=ds=#s5#, #a1#", "9.84%" },
        { 13537, "INV_Bracer_07", "=q2=冰鳞护腕",             "=ds=#s8#, #a2#", "9.71%" },
        { 13538, "INV_Shoulder_13", "=q2=寒风肩铠",      "=ds=#s3#, #a3#", "9.75%" },
        { 13539, "INV_Gauntlets_29", "=q2=女妖之触",            "=ds=#s9#, #a4#", "8.27%" },
        { 13514, "Spell_Shadow_Possession", "=q2=女妖之嚎", "=ds=#m8#", "7.73%" },
        };

    STRATNerubenkan = {
        { 16675, "INV_Boots_Plate_07", "=q3=野兽追猎者长靴",        "=ds=#s12#, #a3# (T0, #c2#)", "13.62%" },
        { 0, "", "", "", "" },
        { 18740, "INV_Belt_13", "=q3=图萨丁腰带",                      "=ds=#s10#, #a1#", "14.72%" },
        { 18739, "INV_Pants_04", "=q3=虫壳板甲护腿",         "=ds=#s11#, #a4#", "12.19%" },
        { 18738, "INV_Weapon_Crossbow_04", "=q3=虫壳强弩", "=ds=#w3#", "14.17%" },
        { 13529, "INV_Shield_02", "=q3=奈鲁布恩坎的壳",              "=ds=#w8#", "12.62%" },
        { 0, "", "", "", "" },
        { 13530, "INV_Boots_05", "=q2=蛛牙长靴",         "=ds=#s12#, #a1#", "8.49%" },
        { 13531, "INV_Pants_09", "=q2=地穴行者护腿",   "=ds=#s11#, #a2#", "10.17%" },
        { 13532, "INV_Gauntlets_31", "=q2=黑暗蛛爪",    "=ds=#s9#, #a3#", "9.69%" },
        { 13533, "INV_Shoulder_18", "=q2=酸蚀肩甲", "=ds=#s3#, #a4#", "8.11%" },
        { 13508, "INV_Misc_Eye_01", "=q2=蛛魔之眼",      "=ds=#m8#", "7.39%" },
        };

    STRATMalekithePallid = {
        { 16691, "INV_Boots_05", "=q3=虔诚软鞋",                   "=ds=#s12#, #a1# (T0, #c5#)", "13.64%" },
        { 0, "", "", "", "" },
        { 18735, "INV_Boots_03", "=q3=玛勒基的裹足",                      "=ds=#s12#, #a1#", "15.03%" },
        { 18734, "INV_Misc_Cape_11", "=q3=暗月披风",                     "=ds=#s4#", "13.42%" },
        { 18737, "INV_Axe_11", "=q3=斩骨手斧",                      "=ds=#h1#, #w1#", "14.23%" },
        { 13524, "INV_Misc_Bone_HumanSkull_01", "=q3=燃魂之颅", "=ds=#s15#", "13.42%" },
        { 0, "", "", "", "" },
        { 13525, "INV_Gauntlets_15", "=q2=暗缚之指",     "=ds=#s9#, #a1#", "9.15%" },
        { 13526, "INV_Belt_09", "=q2=火痕束带",       "=ds=#s10#, #a2#", "9.57%" },
        { 13528, "INV_Bracer_16", "=q2=暮色虚空护腕",   "=ds=#s8#, #a3#", "9.49%" },
        { 13527, "INV_Boots_Plate_09", "=q2=熔岩行者胫甲", "=ds=#s12#, #a4#", "9.39%" },
        { 13509, "INV_Misc_Rune_03", "=q2=预知之眼",  "=ds=#m8#", "6.95%" },
        { 0, "", "", "", "" },
        { 0, "", "", "", "" },
        { 0, "", "", "", "" },
        { 12833, "INV_Scroll_03", "=q3=设计图：泰坦之锤", "=ds=#p2#", "5.86%" },
        { 12796, "INV_Hammer_09", "=q3=泰坦之锤", "=ds=#h2#, #w6#" },
        };

    STRATMagistrateBarthilas = {
        { 18727, "INV_Helmet_51", "=q3=血红毡帽",        "=ds=#s1#, #a1#", "13.82%" },
        { 13376, "INV_Misc_Cape_14", "=q3=皇家法官披风", "=ds=#s4#", "12.44%" },
        { 18726, "INV_Bracer_11", "=q3=巴瑟拉斯镇长的腕轮",      "=ds=#s8#, #a2#", "12.87%" },
        { 18722, "INV_Gauntlets_13", "=q3=死亡之握",          "=ds=#s9#, #a4#", "15.34%" },
        { 18725, "INV_Spear_07", "=q3=和平制造者",               "=ds=#w7#", "14.22%" },
        { 23198, "INV_Relics_IdolofFerocity", "=q3=蛮兽神像", "=ds=#s16# #e16#", "2.37%" },
        { 0, "", "", "", "" },
        { 12382, "INV_Misc_Key_13", "=q2=城市大门钥匙",       "=ds=#e14#", "100%" },
        };

    STRATRamsteintheGorger = {
        { 16737, "INV_Gauntlets_26", "=q3=勇气护手",             "=ds=#s9#, #a4# (T0, #c9#)", "9.58%" },
        { 0, "", "", "", "" },
        { 13374, "INV_Shoulder_02", "=q3=盗灵衬肩",              "=ds=#s3#, #a1#", "9.87%" },
        { 13375, "INV_Shield_19", "=q3=惩戒之盾",              "=ds=#w8#", "9.17%" },
        { 13372, "INV_Staff_08", "=q3=驱奴藤条",                 "=ds=#h2#, #w9#", "8.63%" },
        { 13515, "INV_Misc_Gear_06", "=q3=拉姆斯登的闪电钉",     "=ds=#s14#", "8.09%" },
        { 13373, "INV_Misc_Bone_04", "=q3=血肉指环",                  "=ds=#s13#", "8.15%" },
        { 18723, "INV_Jewelry_Necklace_01", "=q3=生命项链", "=ds=#s2#", "7.54%" },
        };

    STRATBaronRivendare = {
        { 13505, "INV_Sword_17", "=q4=瑞文戴尔之剑", "=ds=#h2#, #w10#", "0.27%" },
        { 0, "", "", "", "" },
        { 13335, "Ability_Mount_Undeadhorse", "=q3=死亡军马的缰绳", "=ds=#e7#", "0.10%" },
        { 0, "", "", "", "" },
        { 16687, "INV_Pants_06", "=q3=博学者护腿",  "=ds=#s11#, #a1# (T0, #c3#)", "6.79%" },
        { 16699, "INV_Pants_08", "=q3=鬼雾护腿",   "=ds=#s11#, #a1# (T0, #c8#)", "7.31%" },
        { 16694, "INV_Pants_08", "=q3=虔诚长裙",         "=ds=#s11#, #a1# (T0, #c5#)", "7.42%" },
        { 16709, "INV_Pants_02", "=q3=迅影短裤",    "=ds=#s11#, #a2# (T0, #c6#)", "7.76%" },
        { 16719, "INV_Pants_08", "=q3=野性之心褶裙",       "=ds=#s11#, #a2# (T0, #c1#)", "6.58%" },
        { 16668, "INV_Pants_03", "=q3=元素护腿",     "=ds=#s11#, #a3# (T0, #c7#)", "3.02%" },
        { 16678, "INV_Pants_03", "=q3=野兽追猎者短裤", "=ds=#s11#, #a3# (T0, #c2#)", "6.16%" },
        { 16732, "INV_Pants_04", "=q3=勇气腿铠",   "=ds=#s11#, #a4# (T0, #c9#)", "5.74%" },
        { 16728, "INV_Pants_04", "=q3=光铸腿铠", "=ds=#s11#, #a4# (T0, #c4#)", "4.20%" },
        { 0, "", "", "", "" },
        { 0, "", "", "", "" },
        { 13346, "INV_Chest_Cloth_08", "=q3=尊贵法袍", "=ds=#s5#, #a1#", "11.51%" },
        { 22412, "INV_Shoulder_02", "=q3=图萨丁衬肩", "=ds=#s3#, #a1#", "4.16%" },
        { 13340, "INV_Misc_Cape_20", "=q3=黑爵士的斗篷", "=ds=#s4#", "8.75%" },
        { 22409, "INV_Chest_Leather_08", "=q3=月牙外套", "=ds=#s5#, #a2#", "4.59%" },
        { 13344, "INV_Gauntlets_31", "=q3=龙玉护手", "=ds=#s9#, #a3#", "10.85%" },
        { 13349, "INV_Mace_07", "=q3=邪恶权杖", "=ds=#h3#, #w6#", "9.30%" },
        { 22410, "INV_Gauntlets_11", "=q3=灵巧护手", "=ds=#s9#, #a3#", "4.98%" },
        { 22411, "INV_Helmet_01", "=q3=刽子手的头盔", "=ds=#s1#, #a4#", "3.80%" },
        { 0, "", "", "", "" },
        { 13368, "INV_Weapon_ShortBlade_12", "=q3=刮骨者", "=ds=#h1#, #w4#", "4.32%" },
        { 13361, "INV_Sword_12", "=q3=斩骨剑", "=ds=#h1#, #w10#", "4.25%" },
        { 22408, "INV_Wand_07", "=q3=雷特森的魔晶手杖", "=ds=#w12#", "3.39%" },
        { 13345, "INV_Jewelry_Ring_16", "=q3=瑞文戴尔封印之戒", "=ds=#s13#", "9.50%" },
        };

    STRATTrash = {
        { 16681, "INV_Bracer_17", "=q3=野兽追猎者护腕",      "=ds=#s8#, #a3#", "1.64%" },
        { 16736, "INV_Belt_34", "=q3=勇气腰带",              "=ds=#s10#, #a4#", "2.02%" },
        { 16671, "INV_Bracer_02", "=q3=元素腕轮",            "=ds=#s8#, #a3#", "1.90%" },
        { 16697, "INV_Belt_31", "=q3=虔诚护腕",              "=ds=#s8#, #a1#", "1.15%" },
        { 16702, "INV_Belt_12", "=q3=鬼雾腰带",              "=ds=#s10#, #a1#", "0.90%" },
        { 18743, "INV_Misc_Cape_18", "=q3=高尚斗篷",         "=ds=#s4#", "0.01%" },
        { 17061, "INV_Misc_Cape_20", "=q3=朱诺之影",         "=ds=#s4#", "0.01%" },
        { 16723, "INV_Belt_11", "=q3=光铸腰带",              "=ds=#s10#, #a4#", "1.83%" },
        { 16685, "INV_Belt_08", "=q3=博学者腰带",            "=ds=#s10#, #a1#", "0.80%" },
        { 18741, "INV_Bracer_17", "=q3=摩鲁恩的护腕",        "=ds=#s8#, #a4#", "0.01%" },
        { 18744, "INV_Gauntlets_18", "=q3=瘟疫蝙蝠皮手套",   "=ds=#s9#, #a2#", "0.00%" },
        { 18736, "INV_Pants_12", "=q3=瘟疫犬护腿",           "=ds=#s11#, #a2#", "0.00%" },
        { 18745, "INV_Pants_01", "=q3=神圣布质护腿",         "=ds=#s11#, #a1#", "0.01%" },
        { 18742, "INV_Shoulder_14", "=q3=斯坦索姆民兵护肩",  "=ds=#s3#, #a3#", "0.00%" },
        { 16714, "INV_Bracer_09", "=q3=野性之心护腕",        "=ds=#s8#, #a2#", "1.49%" },
        { 18781, "INV_Misc_Note_03", "=q3=《高级铸甲技术：第二卷》的下半部", "=ds=#m3#", "44.87%" },
        { 18783, "INV_Misc_Note_04", "=q3=《高级铸甲技术：第三卷》的下半部", "=ds=#m3#", "32.24%" },
        { 0,"","","" },
        { 16248, "INV_Misc_Note_01", "=q2=公式：附魔武器 - 邪恶",         "=ds=#p4# #m15#", "0.36%" },
        { 16249, "INV_Misc_Note_01", "=q2=公式：附魔双手武器 - 极效智力", "=ds=#p4# #m14#", "1.19%" },
        { 15768, "INV_Scroll_06", "=q2=图样：邪恶皮甲腰带",               "=ds=#p7# #m14#", "0.85%" },
        { 15777, "INV_Scroll_06", "=q2=图样：符文皮甲护肩",               "=ds=#p7# #m14#", "1.00%" },
        { 14495, "INV_Scroll_06", "=q2=图样：鬼纹短裤",                   "=ds=#p8# #m18#", "2.13%" },
        { 16052, "INV_Scroll_06", "=q2=结构图：语音增强模组",             "=ds=#p5# #m18#", "1.99%" },
        { 18658, "INV_Scroll_06", "=q2=结构图：快速暗影反射器",           "=ds=#p5# #m14#", "1.82%" },
        { 12827, "INV_Scroll_06", "=q2=设计图：平静",                     "=ds=#p2# #m20#", "10.77%" },
        { 12830, "INV_Scroll_03", "=q1=设计图：腐蚀",                     "=ds=#p2# #m18#", "14.32%" },
        };

    ---------------------------
    -- Lower Blackrock Spire --
    ---------------------------

    LBRSOmokk = {
        { 16670, "INV_Boots_Wolf", "=q3=元素长靴",       "=ds=#s12#, #a3# (T0, #c7#)", "9.35%" },
        { 0, "", "", "", "" },
        { 13170, "INV_Pants_13", "=q3=天空护腿",            "=ds=#s11#, #a1#", "8.52%" },
        { 13169, "INV_Pants_09", "=q3=织鬃护腿",          "=ds=#s11#, #a2#", "9.52%" },
        { 13168, "INV_Chest_Plate13", "=q3=萨满之王的板甲", "=ds=#s5#, #a4#", "8.62%" },
        { 13166, "INV_Shoulder_23", "=q3=猛击护肩",         "=ds=#s3#, #a4#", "7.25%" },
        { 13167, "INV_Hammer_04", "=q3=欧莫克之拳",                "=ds=#h2#, #w6#", "10.64%" },
        { 0, "", "", "", "" },
        { 12336, "INV_Misc_Gem_Diamond_02", "=q2=尖石宝钻", "=ds=#m3#", "15.72%" },
        { 0, "", "", "", "" },
        { 12534, "INV_Misc_Head_Centaur_01", "=q1=欧莫克的头颅",          "=ds=#m3#", "100.00%" },
        };

    LBRSSpirestoneLord = {
        { 13284, "INV_Boots_01", "=q3=迅捷战靴", "=ds=#s12#, #a3#",   "48.68%" },
        { 13285, "INV_Weapon_Halberd_11", "=q3=刀片斧",   "=ds=#h2#, #w1#", "34.87%" },
        };

    LBRSVosh = {
        { 16712, "INV_Gauntlets_24", "=q3=迅影手套",     "=ds=#s9#, #a2# (T0, #c6#)", "11.89%" },
        { 0, "", "", "", "" },
        { 12626, "INV_Bracer_07", "=q3=葬礼护腕",             "=ds=#s8#, #a1#", "18.74%" },
        { 13257, "INV_Shoulder_07", "=q3=恶魔符文肩铠", "=ds=#s3#, #a2#", "16.84%" },
        { 13255, "INV_Gauntlets_30", "=q3=精准手套",      "=ds=#s9#, #a3#", "18.08%" },
        { 12651, "INV_Weapon_Crossbow_04", "=q3=黑鸦",        "=ds=#w3#", "8.56%" },
        { 12653, "INV_Weapon_Bow_08", "=q3=撕裂之钩",               "=ds=#w2#", "7.99%" },
        { 12654, "Ability_Hunter_CriticalShot", "=q3=末日之击",    "=ds=#e5#", "23.06%" },
        };

    LBRSVoone = {
        { 16676, "INV_Gauntlets_10", "=q3=野兽追猎者手套",         "=ds=#s9#, #a3# (T0, #c2#)", "9.15%" },
        { 0, "", "", "", "" },
        { 22231, "INV_Boots_Cloth_02", "=q3=凯瑟尔的精准之靴", "=ds=#s12#, #a1#", "15.40%" },
        { 13179, "INV_Bracer_09", "=q3=焰心护臂",              "=ds=#s8#, #a3#", "16.12%" },
        { 12582, "INV_Weapon_ShortBlade_12", "=q3=祖尔塞拉克之刃",    "=ds=#h1#, #w4#", "8.08%" },
        { 13173, "INV_ThrowingAxe_06", "=q3=迅刃飞斧",    "=ds=#w11#", "79.85%" },
        { 13177, "INV_Jewelry_Amulet_04", "=q3=闪避护符",      "=ds=#s2#", "15.40%" },
        { 0, "", "", "", "" },
        { 12335, "INV_Misc_Gem_Opal_01", "=q2=燃棘宝钻", "=ds=#m3#", "21.43%" },
        };
        
    LBRSGrayhoof = {
        { 0, "INV_Misc_Bag_09", "=q6=T0.5套装任务中所召唤", "=q5=莫尔·灰蹄" },
        { 22306, "INV_Belt_03", "=q3=铁纹腰带", "=ds=#s10#, #a1#", "20.28%" },
        { 22325, "INV_Belt_26", "=q3=狡诈者腰带", "=ds=#s10#, #a2#", "20.28%" },
        { 22322, "INV_Mace_15", "=q3=腭骨粉碎者", "=ds=#h1# #w6#", "20.28%" },
        { 22319, "INV_Misc_Book_07", "=q3=神圣权力之书", "=ds=#s15#", "20.81%" },
        { 22398, "INV_Relics_IdolofRejuvenation", "=q3=活力神像", "=ds=#s16#, #e16#", "12.87%" },
        { 0, "", "", "" },
        { 21984, "INV_Jewelry_Necklace_30", "=q1=瓦塔拉克饰品的左瓣", "=ds=#m3#" },
        { 22046, "INV_Jewelry_Necklace_29", "=q1=瓦塔拉克饰品的右瓣", "=ds=#m3#" },
        };

    LBRSSmolderweb = {
        { 16715, "INV_Boots_08", "=q3=野性之心长靴",           "=ds=#s12#, #a2# (T0, #c1#)", "13.03%" },
        { 0, "", "", "", "" },
        { 13244, "INV_Gauntlets_29", "=q3=镀金护手",      "=ds=#s9#, #a3#", "25.06%" },
        { 13213, "INV_Misc_Gem_Pearl_01", "=q3=烟网蜘蛛的眼球", "=ds=#s14#", "24.97%" },
        { 13183, "INV_Wand_10", "=q3=喷毒者",               "=ds=#h1#, #w6#", "12.49%" },
        };

    LBRSCrystalFang = {
        { 13185, "INV_Shoulder_02", "=q3=碎裂先知衬肩",                   "=ds=#s3#, #a1#", "28.10%" },
        { 13184, "INV_Gauntlets_13", "=q3=落木护手",                "=ds=#s9#, #a2#", "35.48%" },
        { 13218, "INV_Weapon_ShortBlade_16", "=q3=水晶蜘蛛之牙", "=ds=#h1#, #w4#", "17.62%" },
        };

    LBRSDoomhowl = {
        { 13258, "INV_Gauntlets_22", "=q3=[随机前缀]之熔渣护手", "=ds=#s9#, #a2# =q1=随机前缀", "17.09%" },
        { 22232, "INV_Belt_18", "=q3=神射手束带",          "=ds=#s10#, #a3#", "20.60%" },
        { 13259, "INV_Boots_Plate_08", "=q3=钢骨足甲", "=ds=#s12#, #a4#", "25.38%" },
        { 13178, "INV_Jewelry_Ring_22", "=q3=红木之环",    "=ds=#s13#", "21.48%" },
        { 0, "", "", "", "" },
        { 18784, "INV_Misc_Note_04", "=q3=《高级铸甲技术：第三卷》的上半部", "=ds=#m3#", "10.30%" },
        { 12712, "INV_Potion_20", "=q1=瓦罗什的蟑螂",            "=ds=#m3#", "100%" }
        };

    LBRSZigris = {
        { 13253, "INV_Gauntlets_14", "=q3=力量之手",  "=ds=#s9#, #a1#", "14.22%" },
        { 13252, "INV_Belt_10", "=q3=踏云束带",   "=ds=#s10#, #a2#", "15.48%" },
        { 0, "", "", "", "" },
        { 12835, "INV_Scroll_03", "=q3=设计图: 歼灭者", "=ds=#p2# #m14#", "8.37%" },
        { 12798, "INV_Axe_12", "=q3=歼灭者",           "=ds=#h3#, #w1#" }
        };

    LBRSSlavener = {
        { 16718, "INV_Shoulder_01", "=q3=野性之心肩甲",  "=ds=#s3#, #a2# (T0, #c1#)", "11.04%" },
        { 0, "", "", "", "" },
        { 13206, "INV_Pants_06", "=q3=狼牙护腿",      "=ds=#s11#, #a1#", "17.46%" },
        { 13208, "INV_Bracer_07", "=q3=座狼护臂", "=ds=#s8#, #a2#", "18.02%" },
        { 13205, "INV_Shield_14", "=q3=棱须盾牌",    "=ds=#w8#", "16.93%" },
        };

    LBRSHalycon = {
        { 22313, "INV_Bracer_13", "=q3=铁纹护腕",       "=ds=#s8#, #a1#", "18.16%" },
        { 13210, "INV_Boots_Wolf", "=q3=巨狼皮靴", "=ds=#s12#, #a2#", "9.88%" },
        { 13211, "INV_Bracer_07", "=q3=狼爪护腕",       "=ds=#s8#, #a3#", "20.32%" },
        { 13212, "INV_Belt_14", "=q3=哈雷肯的项圈",   "=ds=#s2#", "18.23%" },
        };

    LBRSWyrmthalak = {
        { 13143, "INV_Jewelry_Ring_17", "=q4=龙王徽记",     "=ds=#s13#", "1.11%" },
        { 0, "", "", "", "" },
        { 16679, "INV_Shoulder_10", "=q3=野兽追猎者衬肩",          "=ds=#s3#, #a3# (T0, #c2#)", "9.89%" },
        { 0, "", "", "", "" },
        { 13162, "INV_Gauntlets_29", "=q3=掠夺者之爪",                   "=ds=#s9#, #a4#", "12.14%" },
        { 13163, "INV_Sword_18", "=q3=无情镰刀",                  "=ds=#h2#, #w10#", "14.12%" },
        { 13161, "INV_Staff_29", "=q3=庇护法杖",                 "=ds=#h2#, #w9#", "10.40%" },
        { 13148, "INV_Spear_05", "=q3=刺骨冰矛",                          "=ds=#w7#", "0.76%" },
        { 22321, "INV_Misc_Gem_Bloodstone_01", "=q3=维姆萨拉克之心",  "=ds=#s14#", "13.87%" },
        { 13164, "INV_Misc_Gem_Bloodstone_01", "=q3=龙鳞之心",   "=ds=#s14#", "0.73%" },
        { 0, "", "", "", "" },
        { 12337, "INV_Misc_Gem_Bloodstone_01", "=q2=血斧宝钻", "=ds=#m3#", "29.15%" },
        };

    LBRSGrimaxe = {
        { 12634, "INV_Belt_13", "=q3=凿刻束带",         "=ds=#s10#, #a3#", "31.73%" },
        { 12637, "INV_Gauntlets_26", "=q3=班诺克护手", "=ds=#s9#, #a4#", "26.44%" },
        { 12621, "INV_Weapon_Halberd_11", "=q3=恶魔之叉",        "=ds=#h3#, #w1#", "27.64%" },
        { 0, "", "", "", "" },
        { 12838, "INV_Scroll_03", "=q3=设计图：奥金斧",   "=ds=#p2# #m14#", "6.73%" },
        { 12784, "INV_Axe_09", "=q3=奥金斧", "=ds=#h2#, #w1#" },
        };

    LBRSSpirestoneButcher = {
        { 12608, "INV_Misc_Cape_18", "=q3=屠夫披风", "=ds=#s4#", "54.31%" },
        { 13286, "INV_Pick_05", "=q3=刺灵之矛",           "=ds=#h1#, #w1#", "35.78%" },
        };

    LBRSTrash = {
        { 13181, "INV_Gauntlets_15", "=q3=魔皮手套", "=ds=#s9#, #a1#", "15.88%" },
        { 13182, "INV_Sword_36", "=q3=相位之刃",     "=ds=#h1# #w10#", "11.63%" },
        { 0, "", "", "" },
        { 14513, "INV_Scroll_03", "=q4=图样：大法师之袍",             "=ds=#p8#", "10.12%" },
        { 14152, "INV_Chest_Cloth_38", "=q4=大法师之袍",              "=ds=#s5#, #a1#" },
        { 15749, "INV_Scroll_06", "=q2=图样：火山胸甲",               "=ds=#p7#", "2.04%" },
        { 15053, "INV_Chest_Leather_07", "=q2=火山胸甲",              "=ds=#s5#, #a2#" },
        { 15775, "INV_Scroll_06", "=q2=图样：火山护肩",               "=ds=#p7#", "10.56%" },
        { 15055, "INV_Shoulder_13", "=q2=火山护肩",                   "=ds=#s3#, #a2#" },
        { 13494, "INV_Scroll_06", "=q2=配方：强效火焰防护药水",       "=ds=#p1#", "1.94%" },
        { 16250, "INV_Misc_Note_01", "=q2=公式：附魔武器 - 超强打击", "=ds=#p4#", "1.04%" },
        { 16244, "INV_Misc_Note_01", "=q2=公式：附魔手套 - 强效力量", "=ds=#p4#", "4.16%" },
        };

    ------------------------------------
    ----Scholomace----------------------
    ------------------------------------

    SCHOLOBloodSteward = {
        { 13523, "INV_Potion_24", "=q1=无辜者之血", "=ds=#m3#", "100%" },
        };

    SCHOLOKirtonostheHerald = {
        { 16734, "INV_Boots_Plate_03", "=q3=勇气战靴",        "=ds=#s12#, #a4# (T0, #c9#)", "11.12%" },
        { 0, "", "", "", "" },
        { 13956, "INV_Belt_12", "=q3=尸魔腰带",             "=ds=#s10#, #a1#", "15.31%" },
        { 13957, "INV_Gauntlets_09", "=q3=石像鬼手套",       "=ds=#s9#, #a2#", "14.40%" },
        { 13969, "INV_Bracer_16", "=q3=近卫臂甲",        "=ds=#s8#, #a3#", "16.25%" },
        { 13967, "INV_Boots_Plate_04", "=q3=疾风胫甲",    "=ds=#s12#, #a3#", "14.87%" },
        { 13955, "INV_Shoulder_25", "=q3=石头护肩",      "=ds=#s3#, #a4#", "14.73%" },
        { 14024, "INV_Weapon_ShortBlade_16", "=q3=惊骇之爪",      "=ds=#h1#, #w4#", "15.55%" },
        { 13983, "INV_Weapon_Halberd_09", "=q3=墓石战斧", "=ds=#h2#, #w1#", "12.78%" },
        { 13960, "INV_Misc_Orb_03", "=q3=恶魔之心",       "=ds=#s2#", "16.36%" },
        };

    SCHOLOJandiceBarov = {
        { 16701, "INV_Misc_Bone_TaurenSkull_01", "=q3=鬼雾衬肩", "=ds=#s3#, #a1# (T0, #c8#)","12.20%" },
        { 0, "", "", "", "" },
        { 18689, "INV_Misc_Cape_20", "=q3=幽灵披风",             "=ds=#s4#", "7.52%" },
        { 14543, "INV_Gauntlets_15", "=q3=暗影手套",             "=ds=#s9#, #a1#", "0.26%" },
        { 14545, "INV_Pants_11", "=q3=鬼影护腿",               "=ds=#s11#, #a2#", "8.81%" },
        { 14548, "INV_Shoulder_11", "=q3=皇家肩甲",           "=ds=#s3#, #a3#", "10.06%" },
        { 18690, "INV_Pants_04", "=q3=怨灵腿甲",             "=ds=#s11#, #a4#", "8.59%" },
        { 22394, "INV_Staff_29", "=q3=混乱法杖",                "=ds=#h2#, #w9#", "8.67%" },
        { 14541, "INV_Sword_03", "=q3=巴罗夫家族长剑",            "=ds=#h2#, #w10#", "8.27%" },
        { 0, "", "", "", "" },
        { 0, "", "", "", "" },
        { 13725, "INV_Misc_Bag_15", "=q1=卡斯迪诺夫的恐惧之袋", "=ds=#m3#", "100%" },
        { 13523, "INV_Potion_24", "=q1=无辜者之血", "=ds=#m3#", "100%" },
        };

    SCHOLORattlegore = {
        { 16711, "INV_Boots_08", "=q3=迅影长靴",         "=ds=#s12#, #a2# (T0, #c6#)", "14.32%" },
        { 0, "", "", "", "" },
        { 14538, "INV_Shoulder_02", "=q3=行尸衬肩",      "=ds=#s3#, #a1#", "11.32%" },
        { 14539, "INV_Helmet_14", "=q3=骨环头盔",           "=ds=#s1#, #a2#", "10.89%" },
        { 18686, "INV_Shoulder_03", "=q3=骨魔护肩",   "=ds=#s3#, #a3#", "9.04%" },
        { 14537, "INV_Boots_Plate_09", "=q3=尸光胫甲", "=ds=#s12#, #a4#", "10.22%" },
        { 14531, "INV_Hammer_13", "=q3=恐怖骨锤",        "=ds=#h2#, #w6#", "9.55%" },
        { 14528, "INV_Shield_02", "=q3=断骨圆盾",       "=ds=#w8#", "9.16%" },
        { 18782, "INV_Misc_Note_03", "=q3=《高级铸甲技术：第二卷》的上半部", "=ds=#m3#", "5.71%" },
        { 0, "", "", "", "" },
        { 13873, "INV_Misc_Key_14", "=q1=观察室钥匙",       "=ds=#e14#", "27.11%" },
        };
        
    SCHOLODeathKnight = {
        { 18759, "INV_Axe_18", "=q3=恶毒战斧", "=ds=#h2# #w1#", "24.75%" },
        { 18758, "INV_Weapon_ShortBlade_18", "=q3=鬼怪之刃", "=ds=#h1# #w4#", "15.72%" },
        { 18761, "INV_Wand_12", "=q3=赦免之触", "=ds=#w12#", "17.17%" },
        { 18760, "INV_Jewelry_Ring_09", "=q3=妖术指环", "=ds=#s13#", "24.75%" },
        { 0, "", "", "", "" },
        { 18749, "INV_Misc_Orb_04", "=q1=失落的战马之魂", "=ds=#m3#", "10.93%" },
        };

    SCHOLOVectus = {
        { 18691, "INV_Jewelry_Necklace_06", "=q3=黑暗顾问坠饰", "=ds=#s2#", "6.16%" },
        { 14577, "INV_Pants_08", "=q3=骨烟短裤", "=ds=#s11#, #a1#", "5.24%" },
        };

    SCHOLOMarduk = {
        { 18692, "INV_Boots_Plate_08", "=q3=死亡骑士马靴", "=ds=#s12#, #a4#",      " 6.29%" },
        { 14576, "INV_Sword_15", "=q3=玛杜克黑剑",         "=ds=#h3#, #w10#", " 6.55%" },
        };

    SCHOLORasFrostwhisper = {
        { 13314, "INV_Chest_Cloth_12", "=q4=奥兰纳的拥抱",     "=ds=#s5#, #a1#",       " 1.07%" },
        { 0, "", "", "", "" },
        { 16689, "INV_Shoulder_23", "=q3=博学者衬肩",       "=ds=#s3#, #a1# (T0, #c3#)", "11.93%" },
        { 0, "", "", "", "" },
        { 14340, "INV_Chest_Cloth_46", "=q3=寒冰巫妖法袍",  "=ds=#s5#, #a1#",       "12.55%" },
        { 18693, "INV_Gauntlets_16", "=q3=寒冷护手",      "=ds=#s9#, #a1#",      "12.38%" },
        { 14503, "INV_Shoulder_25", "=q3=死亡指节",          "=ds=#s3#, #a2#", "11.73%" },
        { 14502, "INV_Belt_10", "=q3=霜冻束带",            "=ds=#s10#, #a2#",    "11.20%" },
        { 18694, "INV_Boots_01", "=q3=暗影锁甲护胫",       "=ds=#s12#, #a3#",        "14.63%" },
        { 14522, "INV_Pants_04", "=q3=漩涡护腿",         "=ds=#s11#, #a3#",       "13.01%" },
        { 14525, "INV_Gauntlets_29", "=q3=骨节护手", "=ds=#s9#, #a4#",      "11.45%" },
        { 14487, "INV_Hammer_13", "=q3=寒骨战锤",          "=ds=#h1#, #w6#",    "11.92%" },
        { 13952, "INV_Axe_03", "=q3=冰刃斧",              "=ds=#h3#, #w1#",    " 9.74%" },
        { 18696, "INV_Shield_02", "=q3=无序符文盾",  "=ds=#w8#",  "13.04%" },
        { 18695, "INV_Misc_Book_06", "=q3=锢法宝典",        "=ds=#s15#",      "10.86%" },
        { 13521, "INV_Scroll_06", "=q2=配方：超级能量合剂", "=ds=#p1# #m14#",       " 2.92%" },
        { 0, "", "", "" },
        };
        
    SCHOLOKormok = {
        { 0, "INV_Misc_Bag_09", "=q6=T0.5套装任务中所召唤", "=q5=库尔莫克" },
        { 22303, "INV_Pants_08", "=q3=铁纹短裤", "=ds=#s11#, #a1#", "23.33%" },
        { 22332, "INV_Sword_25", "=q3=通灵之刃", "=ds=#h3# #w10#", "25.42%" },
        { 22333, "INV_Hammer_04", "=q3=圣力之锤", "=ds=#h2# #w6#", "12.50%" },
        { 22326, "INV_Jewelry_Ring_19", "=q3=阿玛加姆的指环", "=ds=#s13#", "16.67%" },
        { 22331, "INV_Jewelry_Ring_33", "=q3=坚韧英雄指环", "=ds=#s13#", "15.42%" },
        { 0, "", "", "" },
        { 21984, "INV_Jewelry_Necklace_30", "=q1=瓦塔拉克饰品的左瓣", "=ds=#m3#" },
        { 22046, "INV_Jewelry_Necklace_29", "=q1=瓦塔拉克饰品的右瓣", "=ds=#m3#" },
    };

    SCHOLOInstructorMalicia = {
        { 16710, "INV_Bracer_07", "=q3=迅影护腕", "=ds=#s8#, #a2# (T0, #c6#)", "3.51%" },
        { 0, "", "", "", "" },
        { 18681, "INV_Shoulder_05", "=q3=葬礼披肩",                 "=ds=#s3#, #a1#", "1.81%" },
        { 14633, "INV_Shoulder_02", "=q3=骨堆衬肩",             "=ds=#s3#, #a1#", "1.12%" },
        { 14626, "INV_Chest_Cloth_43", "=q3=骨堆长袍",            "=ds=#s5#, #a1#",     "1.27%" },
        { 14629, "INV_Bracer_07", "=q3=骨堆腕轮",                "=ds=#s8#, #a1#",    "1.03%" },
        { 14631, "INV_Boots_05", "=q3=骨堆长靴",                 "=ds=#s12#, #a1#",     "0.88%" },
        { 14632, "INV_Pants_08", "=q3=骨堆护腿",              "=ds=#s11#, #a1#",     "0.85%" },
        { 18682, "INV_Pants_02", "=q3=食尸鬼皮护腿",             "=ds=#s11#, #a2#",   "1.00%" },
        { 14637, "INV_Chest_Leather_03", "=q3=苍白护甲",        "=ds=#s5#, #a2#",  "1.51%" },
        { 14638, "INV_Pants_07", "=q3=苍白护腿",             "=ds=#s11#, #a2#",   "1.09%" },
        { 14640, "INV_Gauntlets_15", "=q3=苍白手套",           "=ds=#s9#, #a2#",  "0.82%" },
        { 14636, "INV_Belt_16", "=q3=苍白腰带",                  "=ds=#s10#, #a2#",  "0.60%" },
        { 14641, "INV_Boots_05", "=q3=苍白长靴",              "=ds=#s12#, #a2#",   "0.67%" },
        { 14612, "INV_Pants_06", "=q3=血链护腿",             "=ds=#s11#, #a3#",      "0.42%" },
        { 14616, "INV_Boots_01", "=q3=血链战靴",                 "=ds=#s12#, #a3#",      "0.36%" },
        { 14615, "INV_Gauntlets_26", "=q3=血链护手",         "=ds=#s9#, #a3#",     "0.09%" },
        { 14614, "INV_Belt_23", "=q3=血链腰带",                   "=ds=#s10#, #a3#",     "0.60%" },
        { 14611, "INV_Chest_Leather_05", "=q3=血链锁甲",       "=ds=#s5#, #a3#",     "0.54%" },
        { 14621, "INV_Boots_01", "=q3=亡骨马靴",              "=ds=#s12#, #a4#",     "0.57%" },
        { 14620, "INV_Belt_12", "=q3=亡骨束带",                 "=ds=#s10#, #a4#",    "0.67%" },
        { 14622, "INV_Gauntlets_28", "=q3=亡骨护手",         "=ds=#s9#, #a4#",    "0.45%" },
        { 14624, "INV_Chest_Chain_15", "=q3=亡骨胸甲",      "=ds=#s5#, #a4#",    "0.45%" },
        { 14623, "INV_Pants_04", "=q3=亡骨腿甲",             "=ds=#s11#, #a4#",     "1.12%" },
        { 18683, "INV_Hammer_13", "=q3=薄暮之锤",           "=ds=#h1#, #w6#",  "1.39%" },
        { 18680, "INV_Weapon_Bow_08", "=q3=上古骨弓",           "=ds=#w2#",      "0.91%" },
        { 18684, "INV_Jewelry_Ring_15", "=q3=[随机抗性]之白玛瑙戒指", "=ds=#s13# =q1=随机抗性",    "0.85%" },
        { 23201, "INV_Relics_LibramofHope", "=q3=神性圣契", "=ds=#s16# #e18#" },
    };

    SCHOLODoctorTheolenKrastinov = {
        { 16684, "INV_Gauntlets_17", "=q3=博学者手套",           "=ds=#s9#, #a1# (T0, #c3#)", "9.75%" },
        { 0, "", "", "", "" },
        { 18681, "INV_Shoulder_05", "=q3=葬礼披肩",                 "=ds=#s3#, #a1#", "2.81%" },
        { 14633, "INV_Shoulder_02", "=q3=骨堆衬肩",             "=ds=#s3#, #a1#", "1.91%" },
        { 14626, "INV_Chest_Cloth_43", "=q3=骨堆长袍",            "=ds=#s5#, #a1#",     "2.37%" },
        { 14629, "INV_Bracer_07", "=q3=骨堆腕轮",                "=ds=#s8#, #a1#",    "1.82%" },
        { 14631, "INV_Boots_05", "=q3=骨堆长靴",                 "=ds=#s12#, #a1#",     "2.42%" },
        { 14632, "INV_Pants_08", "=q3=骨堆护腿",              "=ds=#s11#, #a1#",     "2.16%" },
        { 18682, "INV_Pants_02", "=q3=食尸鬼皮护腿",             "=ds=#s11#, #a2#",   "3.14%" },
        { 14637, "INV_Chest_Leather_03", "=q3=苍白护甲",        "=ds=#s5#, #a2#",  "2.08%" },
        { 14638, "INV_Pants_07", "=q3=苍白护腿",             "=ds=#s11#, #a2#",   "1.93%" },
        { 14640, "INV_Gauntlets_15", "=q3=苍白手套",           "=ds=#s9#, #a2#",  "1.43%" },
        { 14636, "INV_Belt_16", "=q3=苍白腰带",                  "=ds=#s10#, #a2#",  "1.82%" },
        { 14641, "INV_Boots_05", "=q3=苍白长靴",              "=ds=#s12#, #a2#",   "1.91%" },
        { 14612, "INV_Pants_06", "=q3=血链护腿",             "=ds=#s11#, #a3#",      "0.87%" },
        { 14616, "INV_Boots_01", "=q3=血链战靴",                 "=ds=#s12#, #a3#",      "0.53%" },
        { 14615, "INV_Gauntlets_26", "=q3=血链护手",         "=ds=#s9#, #a3#",     "0.78%" },
        { 14614, "INV_Belt_23", "=q3=血链腰带",                   "=ds=#s10#, #a3#",     "0.42%" },
        { 14611, "INV_Chest_Leather_05", "=q3=血链锁甲",       "=ds=#s5#, #a3#",     "0.79%" },
        { 14621, "INV_Boots_01", "=q3=亡骨马靴",              "=ds=#s12#, #a4#",     "1.61%" },
        { 14620, "INV_Belt_12", "=q3=亡骨束带",                 "=ds=#s10#, #a4#",    "1.32%" },
        { 14622, "INV_Gauntlets_28", "=q3=亡骨护手",         "=ds=#s9#, #a4#",    "1.52%" },
        { 14624, "INV_Chest_Chain_15", "=q3=亡骨胸甲",      "=ds=#s5#, #a4#",    "1.64%" },
        { 14623, "INV_Pants_04", "=q3=亡骨腿甲",             "=ds=#s11#, #a4#",     "1.75%" },
        { 18683, "INV_Hammer_13", "=q3=薄暮之锤",           "=ds=#h1#, #w6#",  "2.54%" },
        { 18680, "INV_Weapon_Bow_08", "=q3=上古骨弓",           "=ds=#w2#",      "3.21%" },
        { 18684, "INV_Jewelry_Ring_15", "=q3=[随机抗性]之白玛瑙戒指", "=ds=#s13# =q1=随机抗性",    "2.56%" },
        { 23201, "INV_Relics_LibramofHope", "=q3=神性圣契", "=ds=#s16# #e18#" },
        };

    SCHOLOLorekeeperPolkelt ={
        { 16705, "INV_Gauntlets_32", "=q3=鬼雾手套", "=ds=#s9#, #a1# (T0, #c8#)", "14.54%" },
        { 0, "", "", "", "" },
        { 18681, "INV_Shoulder_05", "=q3=葬礼披肩",                 "=ds=#s3#, #a1#", "0.53%" },
        { 14633, "INV_Shoulder_02", "=q3=骨堆衬肩",             "=ds=#s3#, #a1#", "0.67%" },
        { 14626, "INV_Chest_Cloth_43", "=q3=骨堆长袍",            "=ds=#s5#, #a1#",     "0.55%" },
        { 14629, "INV_Bracer_07", "=q3=骨堆腕轮",                "=ds=#s8#, #a1#",    "0.47%" },
        { 14631, "INV_Boots_05", "=q3=骨堆长靴",                 "=ds=#s12#, #a1#",     "0.57%" },
        { 14632, "INV_Pants_08", "=q3=骨堆护腿",              "=ds=#s11#, #a1#",     "0.89%" },
        { 18682, "INV_Pants_02", "=q3=食尸鬼皮护腿",             "=ds=#s11#, #a2#",   "0.57%" },
        { 14637, "INV_Chest_Leather_03", "=q3=苍白护甲",        "=ds=#s5#, #a2#",  "0.65%" },
        { 14638, "INV_Pants_07", "=q3=苍白护腿",             "=ds=#s11#, #a2#",   "0.79%" },
        { 14640, "INV_Gauntlets_15", "=q3=苍白手套",           "=ds=#s9#, #a2#",  "0.83%" },
        { 14636, "INV_Belt_16", "=q3=苍白腰带",                  "=ds=#s10#, #a2#",  "0.63%" },
        { 14641, "INV_Boots_05", "=q3=苍白长靴",              "=ds=#s12#, #a2#",   "0.47%" },
        { 14612, "INV_Pants_06", "=q3=血链护腿",             "=ds=#s11#, #a3#",      "0.26%" },
        { 14616, "INV_Boots_01", "=q3=血链战靴",                 "=ds=#s12#, #a3#",      "0.14%" },
        { 14615, "INV_Gauntlets_26", "=q3=血链护手",         "=ds=#s9#, #a3#",     "0.45%" },
        { 14614, "INV_Belt_23", "=q3=血链腰带",                   "=ds=#s10#, #a3#",     "0.18%" },
        { 14611, "INV_Chest_Leather_05", "=q3=血链锁甲",       "=ds=#s5#, #a3#",     "0.30%" },
        { 14621, "INV_Boots_01", "=q3=亡骨马靴",              "=ds=#s12#, #a4#",     "0.49%" },
        { 14620, "INV_Belt_12", "=q3=亡骨束带",                 "=ds=#s10#, #a4#",    "0.32%" },
        { 14622, "INV_Gauntlets_28", "=q3=亡骨护手",         "=ds=#s9#, #a4#",    "0.30%" },
        { 14624, "INV_Chest_Chain_15", "=q3=亡骨胸甲",      "=ds=#s5#, #a4#",    "0.30%" },
        { 14623, "INV_Pants_04", "=q3=亡骨腿甲",             "=ds=#s11#, #a4#",     "0.41%" },
        { 18683, "INV_Hammer_13", "=q3=薄暮之锤",           "=ds=#h1#, #w6#",  "0.67%" },
        { 18680, "INV_Weapon_Bow_08", "=q3=上古骨弓",           "=ds=#w2#",      "0.49%" },
        { 18684, "INV_Jewelry_Ring_15", "=q3=[随机抗性]之白玛瑙戒指", "=ds=#s13# =q1=随机抗性",    "0.47%" },
        { 23201, "INV_Relics_LibramofHope", "=q3=神性圣契", "=ds=#s16# #e18#" },
        };

    SCHOLOTheRavenian = {
        { 16716, "INV_Belt_15", "=q3=野性之心腰带", "=ds=#s10#, #a2# (T0, #c1#)", "2.60%" },
        { 0, "", "", "", "" },
        { 18681, "INV_Shoulder_05", "=q3=葬礼披肩",                 "=ds=#s3#, #a1#", "1.32%" },
        { 14633, "INV_Shoulder_02", "=q3=骨堆衬肩",             "=ds=#s3#, #a1#", "0.76%" },
        { 14626, "INV_Chest_Cloth_43", "=q3=骨堆长袍",            "=ds=#s5#, #a1#",     "1.04%" },
        { 14629, "INV_Bracer_07", "=q3=骨堆腕轮",                "=ds=#s8#, #a1#",    "0.89%" },
        { 14631, "INV_Boots_05", "=q3=骨堆长靴",                 "=ds=#s12#, #a1#",     "1.32%" },
        { 14632, "INV_Pants_08", "=q3=骨堆护腿",              "=ds=#s11#, #a1#",     "1.41%" },
        { 18682, "INV_Pants_02", "=q3=食尸鬼皮护腿",             "=ds=#s11#, #a2#",   "0.95%" },
        { 14637, "INV_Chest_Leather_03", "=q3=苍白护甲",        "=ds=#s5#, #a2#",  "1.52%" },
        { 14638, "INV_Pants_07", "=q3=苍白护腿",             "=ds=#s11#, #a2#",   "0.82%" },
        { 14640, "INV_Gauntlets_15", "=q3=苍白手套",           "=ds=#s9#, #a2#",  "1.02%" },
        { 14636, "INV_Belt_16", "=q3=苍白腰带",                  "=ds=#s10#, #a2#",  "0.95%" },
        { 14641, "INV_Boots_05", "=q3=苍白长靴",              "=ds=#s12#, #a2#",   "0.93%" },
        { 14612, "INV_Pants_06", "=q3=血链护腿",             "=ds=#s11#, #a3#",      "0.20%" },
        { 14616, "INV_Boots_01", "=q3=血链战靴",                 "=ds=#s12#, #a3#",      "0.33%" },
        { 14615, "INV_Gauntlets_26", "=q3=血链护手",         "=ds=#s9#, #a3#",     "0.11%" },
        { 14614, "INV_Belt_23", "=q3=血链腰带",                   "=ds=#s10#, #a3#",     "0.09%" },
        { 14611, "INV_Chest_Leather_05", "=q3=血链锁甲",       "=ds=#s5#, #a3#",     "0.04%" },
        { 14621, "INV_Boots_01", "=q3=亡骨马靴",              "=ds=#s12#, #a4#",     "1.06%" },
        { 14620, "INV_Belt_12", "=q3=亡骨束带",                 "=ds=#s10#, #a4#",    "0.91%" },
        { 14622, "INV_Gauntlets_28", "=q3=亡骨护手",         "=ds=#s9#, #a4#",    "0.69%" },
        { 14624, "INV_Chest_Chain_15", "=q3=亡骨胸甲",      "=ds=#s5#, #a4#",    "1.15%" },
        { 14623, "INV_Pants_04", "=q3=亡骨腿甲",             "=ds=#s11#, #a4#",     "0.89%" },
        { 18683, "INV_Hammer_13", "=q3=薄暮之锤",           "=ds=#h1#, #w6#",  "1.52%" },
        { 18680, "INV_Weapon_Bow_08", "=q3=上古骨弓",           "=ds=#w2#",      "1.74%" },
        { 18684, "INV_Jewelry_Ring_15", "=q3=[随机抗性]之白玛瑙戒指", "=ds=#s13# =q1=随机抗性",    "1.24%" },
        { 23201, "INV_Relics_LibramofHope", "=q3=神性圣契", "=ds=#s16# #e18#" },
        };

    SCHOLOLordAlexeiBarov = {
        { 16722, "INV_Bracer_14", "=q3=光铸护腕", "=ds=#s8#, #a4# (T0, #c4#)", "3.37%" },
        { 0, "", "", "", "" },
        { 18681, "INV_Shoulder_05", "=q3=葬礼披肩",                 "=ds=#s3#, #a1#", "4.94%" },
        { 14633, "INV_Shoulder_02", "=q3=骨堆衬肩",             "=ds=#s3#, #a1#", "3.39%" },
        { 14626, "INV_Chest_Cloth_43", "=q3=骨堆长袍",            "=ds=#s5#, #a1#",     "5.30%" },
        { 14629, "INV_Bracer_07", "=q3=骨堆腕轮",                "=ds=#s8#, #a1#",    "4.05%" },
        { 14631, "INV_Boots_05", "=q3=骨堆长靴",                 "=ds=#s12#, #a1#",     "2.86%" },
        { 14632, "INV_Pants_08", "=q3=骨堆护腿",              "=ds=#s11#, #a1#",     "2.38%" },
        { 18682, "INV_Pants_02", "=q3=食尸鬼皮护腿",             "=ds=#s11#, #a2#",   "4.79%" },
        { 14637, "INV_Chest_Leather_03", "=q3=苍白护甲",        "=ds=#s5#, #a2#",  "4.55%" },
        { 14638, "INV_Pants_07", "=q3=苍白护腿",             "=ds=#s11#, #a2#",   "2.08%" },
        { 14640, "INV_Gauntlets_15", "=q3=苍白手套",           "=ds=#s9#, #a2#",  "2.35%" },
        { 14636, "INV_Belt_16", "=q3=苍白腰带",                  "=ds=#s10#, #a2#",  "2.83%" },
        { 14641, "INV_Boots_05", "=q3=苍白长靴",              "=ds=#s12#, #a2#",   "2.38%" },
        { 14612, "INV_Pants_06", "=q3=血链护腿",             "=ds=#s11#, #a3#",      "1.01%" },
        { 14616, "INV_Boots_01", "=q3=血链战靴",                 "=ds=#s12#, #a3#",      "0.83%" },
        { 14615, "INV_Gauntlets_26", "=q3=血链护手",         "=ds=#s9#, #a3#",     "0.62%" },
        { 14614, "INV_Belt_23", "=q3=血链腰带",                   "=ds=#s10#, #a3#",     "1.13%" },
        { 14611, "INV_Chest_Leather_05", "=q3=血链锁甲",       "=ds=#s5#, #a3#",     "1.43%" },
        { 14621, "INV_Boots_01", "=q3=亡骨马靴",              "=ds=#s12#, #a4#",     "1.49%" },
        { 14620, "INV_Belt_12", "=q3=亡骨束带",                 "=ds=#s10#, #a4#",    "1.73%" },
        { 14622, "INV_Gauntlets_28", "=q3=亡骨护手",         "=ds=#s9#, #a4#",    "1.61%" },
        { 14624, "INV_Chest_Chain_15", "=q3=亡骨胸甲",      "=ds=#s5#, #a4#",    "2.65%" },
        { 14623, "INV_Pants_04", "=q3=亡骨腿甲",             "=ds=#s11#, #a4#",     "2.20%" },
        { 18683, "INV_Hammer_13", "=q3=薄暮之锤",           "=ds=#h1#, #w6#",  "4.67%" },
        { 18680, "INV_Weapon_Bow_08", "=q3=上古骨弓",           "=ds=#w2#",      "4.70%" },
        { 18684, "INV_Jewelry_Ring_15", "=q3=[随机抗性]之白玛瑙戒指", "=ds=#s13# =q1=随机抗性",    "4.05%" },
        { 23201, "INV_Relics_LibramofHope", "=q3=神性圣契", "=ds=#s16# #e18#" },
        };

    SCHOLOLadyIlluciaBarov = {
        { 18681, "INV_Shoulder_05", "=q3=葬礼披肩",                 "=ds=#s3#, #a1#", "1.20%" },
        { 14633, "INV_Shoulder_02", "=q3=骨堆衬肩",             "=ds=#s3#, #a1#", "1.07%" },
        { 14626, "INV_Chest_Cloth_43", "=q3=骨堆长袍",            "=ds=#s5#, #a1#",     "1.30%" },
        { 14629, "INV_Bracer_07", "=q3=骨堆腕轮",                "=ds=#s8#, #a1#",    "1.17%" },
        { 14631, "INV_Boots_05", "=q3=骨堆长靴",                 "=ds=#s12#, #a1#",     "0.94%" },
        { 14632, "INV_Pants_08", "=q3=骨堆护腿",              "=ds=#s11#, #a1#",     "0.78%" },
        { 18682, "INV_Pants_02", "=q3=食尸鬼皮护腿",             "=ds=#s11#, #a2#",   "1.61%" },
        { 14637, "INV_Chest_Leather_03", "=q3=苍白护甲",        "=ds=#s5#, #a2#",  "0.94%" },
        { 14638, "INV_Pants_07", "=q3=苍白护腿",             "=ds=#s11#, #a2#",   "1.15%" },
        { 14640, "INV_Gauntlets_15", "=q3=苍白手套",           "=ds=#s9#, #a2#",  "1.12%" },
        { 14636, "INV_Belt_16", "=q3=苍白腰带",                  "=ds=#s10#, #a2#",  "0.94%" },
        { 14641, "INV_Boots_05", "=q3=苍白长靴",              "=ds=#s12#, #a2#",   "0.70%" },
        { 14612, "INV_Pants_06", "=q3=血链护腿",             "=ds=#s11#, #a3#",      "0.44%" },
        { 14616, "INV_Boots_01", "=q3=血链战靴",                 "=ds=#s12#, #a3#",      "0.34%" },
        { 14615, "INV_Gauntlets_26", "=q3=血链护手",         "=ds=#s9#, #a3#",     "0.49%" },
        { 14614, "INV_Belt_23", "=q3=血链腰带",                   "=ds=#s10#, #a3#",     "0.42%" },
        { 14611, "INV_Chest_Leather_05", "=q3=血链锁甲",       "=ds=#s5#, #a3#",     "0.44%" },
        { 14621, "INV_Boots_01", "=q3=亡骨马靴",              "=ds=#s12#, #a4#",     "0.75%" },
        { 14620, "INV_Belt_12", "=q3=亡骨束带",                 "=ds=#s10#, #a4#",    "0.70%" },
        { 14622, "INV_Gauntlets_28", "=q3=亡骨护手",         "=ds=#s9#, #a4#",    "0.60%" },
        { 14624, "INV_Chest_Chain_15", "=q3=亡骨胸甲",      "=ds=#s5#, #a4#",    "0.81%" },
        { 14623, "INV_Pants_04", "=q3=亡骨腿甲",             "=ds=#s11#, #a4#",     "0.83%" },
        { 18683, "INV_Hammer_13", "=q3=薄暮之锤",           "=ds=#h1#, #w6#",  "1.35%" },
        { 18680, "INV_Weapon_Bow_08", "=q3=上古骨弓",           "=ds=#w2#",      "1.17%" },
        { 18684, "INV_Jewelry_Ring_15", "=q3=[随机抗性]之白玛瑙戒指", "=ds=#s13# =q1=随机抗性",    "1.35%" },
        { 23201, "INV_Relics_LibramofHope", "=q3=神性圣契", "=ds=#s16# #e18#" },
        };

    SCHOLODarkmasterGandling = {
        { 13937, "INV_Jewelry_Talisman_12", "=q4=院长之杖", "=ds=#h2#, #w9#", "1.11%" },
        { 14514, "INV_Scroll_03", "=q4=图样：虚空法袍",     "=ds=#p8# #m14#", "6.71%" },
        { 14153, "INV_Chest_Cloth_51", "=q4=虚空法袍",         "=ds=#s5#, #a1# =q6=拾取后绑定 =q1=#m1# #c8#", "" },
        { 0, "", "", "", "" },
        { 16698, "INV_Helmet_29", "=q3=鬼雾面具",     "=ds=#s1#, #a1# (T0, #c8#)", "8.78%" },
        { 16686, "INV_Crown_02", "=q3=博学者头冠",    "=ds=#s1#, #a1# (T0, #c3#)", "8.60%" },
        { 16693, "INV_Crown_01", "=q3=虔诚头冠",        "=ds=#s1#, #a1# (T0, #c5#)", "7.89%" },
        { 16720, "INV_Helmet_27", "=q3=野性之心兜帽",     "=ds=#s1#, #a2# (T0, #c1#)", "7.09%" },
        { 16677, "INV_Helmet_24", "=q3=野兽追猎者之帽", "=ds=#s1#, #a3# (T0, #c2#)", "7.00%" },
        { 16707, "INV_Helmet_41", "=q3=迅影罩帽",    "=ds=#s1#, #a2# (T0, #c6#)", "6.65%" },
        { 16731, "INV_Helmet_02", "=q3=勇气头盔",      "=ds=#s1#, #a4# (T0, #c9#)", "6.54%" },
        { 16727, "INV_Helmet_08", "=q3=光铸头盔",    "=ds=#s1#, #a4# (T0, #c4#)", "5.32%" },
        { 16667, "INV_Helmet_04", "=q3=元素罩帽",   "=ds=#s1#, #a3# (T0, #c7#)", "2.86%" },
        { 0, "", "", "", "" },
        { 0, "", "", "", "" },
        { 13398, "INV_Boots_08", "=q3=尖叫者之靴",                    "=ds=#s12#, #a2#", "10.75%" },
        { 13944, "INV_Chest_Chain_17","=q3=墓碑胸甲",               "=ds=#s5#, #a2#", "8.96%" },
        { 13950, "INV_Belt_09", "=q3=拘禁束带",                           "=ds=#s10#, #a3#", "0.24%" },
        { 13951, "INV_Bracer_18", "=q3=活钢臂甲",                    "=ds=#s8#, #a4#", "10.38%" },
        { 13964, "INV_Weapon_ShortBlade_25", "=q3=女巫之刃",                   "=ds=#h1#, #w4#", "9.82%" },
        { 13953, "INV_Sword_41", "=q3=沉默之牙",                              "=ds=#h3#, #w10#", "9.68%" },
        { 13938, "INV_Misc_Bone_TaurenSkull_01","=q3=噬骨铁针",        "=ds=#w12#", "8.80% " },
        { 22433, "INV_Jewelry_Ring_16", "=q3=莫里希奥的统御指环", "=ds=#s13#", "7.72%" },
        { 0, "", "", "", "" },
        { 19276, "INV_Misc_Ticket_Tarot_Portal_01", "=q3=入口之一", "=ds=#e19#", "2.20%" },
        { 0, "", "", "", "" },
        { 13501, "INV_Scroll_06", "=q2=配方：特效法力药水", "=ds=#p1#", "8.64%" },
        };

    SCHOLOTrash = {
        { 18702, "INV_Belt_28", "=q3=神权腰带",          "=ds=#s10#, #a4#", "0.01%" },
        { 14536, "INV_Chest_Chain_14", "=q3=骨片锁甲",   "=ds=#s5#, #a3#", "0.01%" },
        { 18697, "INV_Boots_Fabric_01", "=q3=冷石便鞋",  "=ds=#s12#, #a1#", "0.01%" },
        { 16705, "INV_Gauntlets_32", "=q3=鬼雾手套",     "=ds=#s9#, #a1#", "0.03%" },
        { 18699, "INV_Shoulder_27", "=q3=冰墓肩甲",      "=ds=#s3#, #a2#", "0.01%" },
        { 18701, "INV_Jewelry_Ring_24", "=q3=脉动指环",  "=ds=#s13#", "0.01%" },
        { 16722, "INV_Bracer_14", "=q3=光铸护腕",        "=ds=#s8#, #a4#", "2.72%" },
        { 16685, "INV_Belt_08", "=q3=博学者腰带",        "=ds=#s8#, #a1#", "0.22%" },
        { 16684, "INV_Gauntlets_17", "=q3=博学者手套",   "=ds=#s9#, #a1#", "1.27%" },
        { 18700, "INV_Bracer_07", "=q3=煞星护腕",        "=ds=#s8#, #a2#", "0.01%" },
        { 16710, "INV_Bracer_07", "=q3=迅影护腕",        "=ds=#s8#, #a2#", "1.53%" },
        { 18698, "INV_Helmet_41", "=q3=褴褛皮帽",        "=ds=#s1#, #a2#", "0.01%" },
        { 16716, "INV_Belt_15", "=q3=野性之心腰带",      "=ds=#s8#, #a2#", "1.84%" },
        { 0,"","","" },
        { 0,"","","" },
        { 16254, "INV_Misc_Note_01", "=q3=公式：附魔武器 - 生命偷取",      "=ds=#p4#", "0.93%" },
        { 16255, "INV_Misc_Note_01", "=q2=公式：附魔双手武器 - 极效精神",  "=ds=#p4#", "0.88%" },
        { 15773, "INV_Scroll_06", "=q2=图样：邪恶皮甲",                    "=ds=#p7#", "3.03%" },
        { 15776, "INV_Scroll_06", "=q2=图样：符文皮甲",                    "=ds=#p7#", "1.62%" },
        };

    NAXPatchwerk = {
        { 22726, "INV_Qiraj_JewelBlessed", "=q5=埃提耶什的碎片", "=ds=#m2#", "11.39%" },
        { 22727, "INV_Staff_20", "=q5=埃提耶什的杖柄",             "=ds=#w9# =q1=#m4#" },
        { 0, "", "", "" },
        { 22368, "INV_Misc_Desecrated_ClothShoulder", "=q4=被玷污的肩垫", "=q1=#m1# =ds=#c8#, #c3#, #c5#", "21.33%" },
        { 22361, "INV_Misc_Desecrated_MailShoulder", "=q4=被玷污的肩饰", "=q1=#m1# =ds=#c7#, #c1#, #c2#, #c4#", "36.65%" },
        { 22354, "INV_Misc_Desecrated_PlateShoulder", "=q4=被玷污的肩铠", "=q1=#m1# =ds=#c6#, #c9#", "28.78%" },
        { 0, "", "", "" },
        { 22960, "INV_Misc_Cape_Naxxramas_02", "=q4=缝合披风", "=ds=#s4#", "12.84%" },
        { 22815, "INV_Axe_22", "=q4=断离", "=ds=#h2#, #w1#", "16.15%" },
        { 22820, "INV_Wand_1H_Stratholme_D_01", "=q4=命运魔杖", "=ds=#w12#", "23.19%" },
        { 22818, "INV_Shield_27", "=q4=瘟疫携带者", "=ds=#w8#", "15.53%" },
        { 22961, "INV_Jewelry_Ring_49Naxxramas", "=q4=鼓舞之戒", "=ds=#s13#", "22.15%" },
        };
     
    NAXGrobbulus = {
        { 22726, "INV_Qiraj_JewelBlessed", "=q5=埃提耶什的碎片", "=ds=#m2#", "11.39%" },
        { 22727, "INV_Staff_20", "=q5=埃提耶什的杖柄",             "=ds=#w9# =q1=#m4#" },
        { 0, "", "", "" },
        { 22368, "INV_Misc_Desecrated_ClothShoulder", "=q4=被玷污的肩垫", "=q1=#m1# =ds=#c8#, #c3#, #c5#" },
        { 22361, "INV_Misc_Desecrated_MailShoulder", "=q4=被玷污的肩饰", "=q1=#m1# =ds=#c7#, #c1#, #c2#, #c4#" },
        { 22354, "INV_Misc_Desecrated_PlateShoulder", "=q4=被玷污的肩铠", "=q1=#m1# =ds=#c6#, #c9#" },
        { 0, "", "", "" },
        { 22968, "INV_Shoulder_14", "=q4=冰川衬肩", "=ds=#s3#, #a1#" },
        { 22967, "INV_Shoulder_14", "=q4=寒鳞肩甲", "=ds=#s3#, #a3#" },
        { 22803, "INV_knife_1h_stratholme_d_02", "=q4=午夜之雾", "=ds=#w4#" },
        { 22988, "INV_Mace_1H_Stratholme_D_02", "=q4=梦境之末", "=ds=#h1# #w6#" },
        { 22810, "INV_Weapon_Rifle_11", "=q4=毒液注射器", "=ds=#w5#" },
        };
     
    NAXGluth = {
        { 22726, "INV_Qiraj_JewelBlessed", "=q5=埃提耶什的碎片", "=ds=#m2#", "11.39%" },
        { 22727, "INV_Staff_20", "=q5=埃提耶什的杖柄",             "=ds=#w9# =q1=#m4#" },
        { 0, "", "", "" },
        { 22983, "INV_Shoulder_05", "=q4=蒙霜衬肩", "=ds=#s3#, #a1#" },
        { 22813, "INV_Sword_46", "=q4=邪恶力量巨剑", "=ds=#h2# #w10#" },
        { 23075, "INV_Armor_Shield_Naxxramas_D_01", "=q4=死亡的契约", "=ds=#w8#" },
        { 22994, "INV_Offhand_Stratholme_A_02", "=q4=被消化的力量之手", "=ds=#s15#"},
        { 22981, "INV_Jewelry_Necklace_27Naxxramas", "=q4=格拉斯的项圈", "=ds=#s2#" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 22368, "INV_Misc_Desecrated_ClothShoulder", "=q4=被玷污的肩垫", "=q1=#m1# =ds=#c8#, #c3#, #c5#" },
        { 22361, "INV_Misc_Desecrated_MailShoulder", "=q4=被玷污的肩饰",  "=q1=#m1# =ds=#c7#, #c1#, #c2#, #c4#" },
        { 22354, "INV_Misc_Desecrated_PlateShoulder", "=q4=被玷污的肩铠", "=q1=#m1# =ds=#c6#, #c9#" },
        { 22369, "INV_Misc_Desecrated_ClothBracer", "=q4=被玷污的腕轮",   "=q1=#m1# =ds=#c8#, #c3#, #c5#" },
        { 22362, "INV_Misc_Desecrated_MailBracer", "=q4=被玷污的腕甲",    "=q1=#m1# =ds=#c4#, #c7#, #c2#, #c1#" },
        { 22355, "INV_Misc_Desecrated_PlateBracer", "=q4=被玷污的护腕",   "=q1=#m1# =ds=#c9#, #c6#" },
        { 22370, "INV_Misc_Desecrated_ClothBelt", "=q4=被玷污的腰带",     "=q1=#m1# =ds=#c5#, #c3#, #c8#" },
        { 22363, "INV_Misc_Desecrated_MailBelt", "=q4=被玷污的束带",      "=q1=#m1# =ds=#c7#, #c1#, #c2#, #c4#" },
        { 22356, "INV_Misc_Desecrated_PlateBelt", "=q4=被玷污的护腰",     "=q1=#m1# =ds=#c6#, #c9#" },
        { 22372, "INV_Misc_Desecrated_ClothBoots", "=q4=被玷污的便鞋",    "=q1=#m1# =ds=#c8#, #c3#, #c5#" },
        { 22365, "INV_Misc_Desecrated_MailBoots", "=q4=被玷污的长靴",     "=q1=#m1# =ds=#c7#, #c1#, #c2#, #c4#" },
        { 22358, "INV_Misc_Desecrated_PlateBoots", "=q4=被玷污的马靴",    "=q1=#m1# =ds=#c6#, #c9#" },
        };
     
    NAXThaddius = {
        { 22726, "INV_Qiraj_JewelBlessed", "=q5=埃提耶什的碎片", "=ds=#m2#", "11.39%" },
        { 22727, "INV_Staff_20", "=q5=埃提耶什的杖柄",             "=ds=#w9# =q1=#m4#" },
        { 0, "", "", "" },
        { 22367, "INV_Misc_Desecrated_ClothHelm", "=q4=被玷污的头环", "=q1=#m1# =ds=#c8#, #c3#, #c5#" },
        { 22360, "INV_Misc_Desecrated_MailHelm", "=q4=被玷污的头饰", "=q1=#m1# =ds=#c7#, #c1#, #c2#, #c4#" },
        { 22353, "INV_Misc_Desecrated_PlateHelm", "=q4=被玷污的头盔", "=q1=#m1# =ds=#c6#, #c9#" },
        { 0, "", "", "" },
        { 23070, "INV_Pants_08", "=q4=极性护腿", "=ds=#s11#, #a1#" },
        { 23000, "INV_Chest_Chain_15", "=q4=钉板憎恶胸骨", "=ds=#s5#, #a4#" },
        { 22808, "INV_Mace_1H_Stratholme_D_01", "=q4=谴责者", "=ds=#h1# #w6#" },
        { 22801, "INV_Staff_31", "=q4=暮光之塔", "=ds=#h2# #w9#" },
        { 23001, "INV_Trinket_Naxxramas02", "=q4=衰落之眼", "=ds=#s14#" },
        };
     
    NAXAnubRekhan = {
        { 22726, "INV_Qiraj_JewelBlessed", "=q5=埃提耶什的碎片", "=ds=#m2#", "11.39%" },
        { 22727, "INV_Staff_20", "=q5=埃提耶什的杖柄",             "=ds=#w9# =q1=#m4#" },
        { 0, "", "", "" },
        { 22369, "INV_Misc_Desecrated_ClothBracer", "=q4=被玷污的腕轮", "=q1=#m1# =ds=#c8#, #c3#, #c5#", "28.57%" },
        { 22362, "INV_Misc_Desecrated_MailBracer", "=q4=被玷污的腕甲", "=q1=#m1# =ds=#c4#, #c7#, #c2#, #c1#", "31.30%" },
        { 22355, "INV_Misc_Desecrated_PlateBracer", "=q4=被玷污的护腕", "=q1=#m1# =ds=#c9#, #c6#", "29.53%" },
        { 0, "", "", "" },
        { 22938, "INV_Misc_Cape_Naxxramas_02", "=q4=地穴恶魔丝质披风", "=ds=#s4#", "20.39%" },
        { 22936, "INV_Bracer_17", "=q4=复仇腕甲", "=ds=#s8#, #a4#", "16.85%" },
        { 22937, "INV_Offhand_Naxxramas_D_01", "=q4=蛛魔宝石", "=ds=#s15#", "15.09%" },
        { 22939, "INV_Jewelry_Ring_50Naxxramas", "=q4=徒劳祈祷之戒", "=ds=#s13#", "16.85%" },
        { 22935, "INV_Jewelry_Amulet_04", "=q4=寒霜之触", "=ds=#s2#", "13.32%" },
        };
     
    NAXGrandWidowFaerlina = {
        { 22726, "INV_Qiraj_JewelBlessed", "=q5=埃提耶什的碎片", "=ds=#m2#", "11.39%" },
        { 22727, "INV_Staff_20", "=q5=埃提耶什的杖柄",             "=ds=#w9# =q1=#m4#" },
        { 0, "", "", "" },
        { 22355, "INV_Misc_Desecrated_PlateBracer", "=q4=被玷污的护腕", "=q1=#m1# =ds=#c9#, #c6#", "25.22%" },
        { 22369, "INV_Misc_Desecrated_ClothBracer", "=q4=被玷污的腕轮", "=q1=#m1# =ds=#c8#, #c3#, #c5#", "24.59%" },
        { 22362, "INV_Misc_Desecrated_MailBracer", "=q4=被玷污的腕甲", "=q1=#m1# =ds=#c4#, #c7#, #c2#, #c1#", "35.74%" },
        { 0, "", "", "" },
        { 22806, "INV_Sword_60", "=q4=黑女巫的悔恨", "=ds=#h1# #w10#" },
        { 22940, "INV_Shoulder_16", "=q4=破冰肩铠", "=ds=#s3#, #a4#" },
        { 22941, "INV_Shoulder_07", "=q4=北极肩垫", "=ds=#s3#, #a2#" },
        { 22943, "INV_Jewelry_Necklace_29Naxxramas", "=q4=仇恨石坠", "=ds=#s2#" },
        { 22942, "INV_Mace_29", "=q4=黑女巫的拥抱", "=ds=#h1# #w6#" },
        };
     
    NAXMaexxna = {
        { 22726, "INV_Qiraj_JewelBlessed", "=q5=埃提耶什的碎片", "=ds=#m2#", "11.39%" },
        { 22727, "INV_Staff_20", "=q5=埃提耶什的杖柄",             "=ds=#w9# =q1=#m4#" },
        { 0, "", "", "" },
        { 22371, "INV_Misc_Desecrated_ClothGloves", "=q4=被玷污的手套", "=q1=#m1# =ds=#c8#, #c3#, #c5#", "44.26%" },
        { 22364, "INV_Misc_Desecrated_MailGloves", "=q4=被玷污的手甲", "=q1=#m1# =ds=#c4#, #c7#, #c2#, #c1#", "49.03%" },
        { 22357, "INV_Misc_Desecrated_PlateGloves", "=q4=被玷污的护手", "=q1=#m1# =ds=#c9#, #c6#", "90.80%" },
        { 0, "", "", "" },
        { 23220, "INV_Chest_Cloth_46", "=q4=水晶网袍", "=ds=#s5#, #a1#", "11.34%" },
        { 22804, "INV_knife_1h_stratholme_d_01", "=q4=迈克斯纳之牙", "=ds=#w4#", "18.05%" },
        { 22807, "INV_Sword_11", "=q4=怨灵之刃", "=ds=#h1# #w10#", "14.25%" },
        { 22947, "INV_Jewelry_Necklace_28Naxxramas", "=q4=遗忘之名", "=ds=#s2#", "31.88%" },
        { 22954, "INV_Trinket_Naxxramas04", "=q4=蜘蛛之吻", "=ds=#s14#", "11.62%" },
        };
     
    NAXInstructorRazuvious = {
        { 22726, "INV_Qiraj_JewelBlessed", "=q5=埃提耶什的碎片", "=ds=#m2#", "11.39%" },
        { 22727, "INV_Staff_20", "=q5=埃提耶什的杖柄",             "=ds=#w9# =q1=#m4#" },
        { 0, "", "", "" },
        { 22372, "INV_Misc_Desecrated_ClothBoots", "=q4=被玷污的便鞋", "=q1=#m1# =ds=#c8#, #c3#, #c5#", "27.64%" },
        { 22365, "INV_Misc_Desecrated_MailBoots", "=q4=被玷污的长靴", "=q1=#m1# =ds=#c7#, #c1#, #c2#, #c4#", "31.10%" },
        { 22358, "INV_Misc_Desecrated_PlateBoots", "=q4=被玷污的马靴", "=q1=#m1# =ds=#c6#, #c9#", "26.02%" },
        { 0, "", "", "" },
        { 23017, "INV_Misc_Cape_Naxxramas_01", "=q4=日蚀之幕", "=ds=#s4#", "19.31%" },
        { 23219, "INV_Belt_13", "=q4=教官的腰带", "=ds=#s10#, #a4#", "8.74%" },
        { 23014, "INV_Sword_07", "=q4=伊普利斯，堕落炽天使之刃", "=ds=#h1# #w10#", "9.35%" },
        { 23009, "INV_Wand_1H_Stratholme_D_01", "=q4=秘语亡者之杖", "=ds=#w12#", "12.80%" },
        { 23004, "INV_Relics_IdolofHealth", "=q4=长寿神像", "=ds=#s16#, #e16#", "17.68%" },
        { 23018, "INV_Jewelry_Ring_50Naxxramas", "=q4=堕落卫士的徽记", "=ds=#s13#", "19.31%" },
        };
     
    NAXGothikderHarvester = {
        { 22726, "INV_Qiraj_JewelBlessed", "=q5=埃提耶什的碎片", "=ds=#m2#", "11.39%" },
        { 22727, "INV_Staff_20", "=q5=埃提耶什的杖柄",             "=ds=#w9# =q1=#m4#" },
        { 0, "", "", "" },
        { 22372, "INV_Misc_Desecrated_ClothBoots", "=q4=被玷污的便鞋", "=q1=#m1# =ds=#c8#, #c3#, #c5#" },
        { 22365, "INV_Misc_Desecrated_MailBoots", "=q4=被玷污的长靴", "=q1=#m1# =ds=#c7#, #c1#, #c2#, #c4#" },
        { 22358, "INV_Misc_Desecrated_PlateBoots", "=q4=被玷污的马靴", "=q1=#m1# =ds=#c6#, #c9#" },
        { 0, "", "", "" },
        { 23032, "INV_Helmet_53", "=q4=冰川头饰", "=ds=#s1#, #a1#" },
        { 23021, "INV_Bracer_07", "=q4=灵魂收割者的护腕", "=ds=#s8#, #a1#" },
        { 23020, "INV_Helmet_04", "=q4=北极头盔", "=ds=#s1#, #a2#" },
        { 23073, "INV_Boots_08", "=q4=偏移之靴", "=ds=#s12#, #a2#" },
        { 23023, "INV_Jewelry_Necklace_29Naxxramas", "=q4=萨迪斯的项圈", "=ds=#s2#" },
        };
     
    NAXTheFourHorsemen = {
        { 22726, "INV_Qiraj_JewelBlessed", "=q5=埃提耶什的碎片", "=ds=#m2#", "11.39%" },
        { 22727, "INV_Staff_20", "=q5=埃提耶什的杖柄",             "=ds=#w9# =q1=#m4#" },
        { 0, "", "", "" },
        { 22351, "INV_Misc_Desecrated_ClothChest", "=q4=被玷污的长袍", "=q1=#m1# =ds=#c8#, #c3#, #c5#" },
        { 22350, "INV_Misc_Desecrated_MailChest", "=q4=被玷污的外套", "=q1=#m1# =ds=#c7#, #c1#, #c2#, #c4#" },
        { 22349, "INV_Misc_Desecrated_PlateChest", "=q4=被玷污的胸甲", "=q1=#m1# =ds=#c6#, #c9#" },
        { 0, "", "", "" },
        { 23071, "INV_Pants_Leather_09", "=q4=天启护腿", "=ds=#s11#, #a2#" },
        { 22809, "INV_Mace_26", "=q4=赎罪十字军之槌", "=ds=#h2# #w6#" },
        { 22811, "INV_Weapon_Bow_13", "=q4=灵魂之弦", "=ds=#w2#" },
        { 23025, "INV_Jewelry_Ring_48Naxxramas", "=q4=诅咒者的徽记", "=ds=#s13#" },
        { 23027, "INV_Trinket_Naxxramas01", "=q4=宽恕的热情", "=ds=#s2#" },
        { 0, "", "", "" },
        { 22691, "INV_Sword_2H_AshbringerCorrupt", "=q4=堕落的灰烬使者", "=ds=#h2# #w10# =q2=大领主莫格莱尼" },
        };
     
    NAXNothderPlaguebringer = {
        { 22726, "INV_Qiraj_JewelBlessed", "=q5=埃提耶什的碎片", "=ds=#m2#", "11.39%" },
        { 22727, "INV_Staff_20", "=q5=埃提耶什的杖柄",             "=ds=#w9# =q1=#m4#" },
        { 0, "", "", "" },
        { 22370, "INV_Misc_Desecrated_ClothBelt", "=q4=被玷污的腰带", "=q1=#m1# =ds=#c5#, #c3#, #c8#", "26.23%" },
        { 22363, "INV_Misc_Desecrated_MailBelt", "=q4=被玷污的束带", "=q1=#m1# =ds=#c7#, #c1#, #c2#, #c4#", "32.67%" },
        { 22356, "INV_Misc_Desecrated_PlateBelt", "=q4=被玷污的护腰", "=q1=#m1# =ds=#c6#, #c9#", "29.66%" },
        { 0, "", "", "" },
        { 23030, "INV_Misc_Cape_Naxxramas_01", "=q4=天灾披风", "=ds=#s4#", "13.33%" },
        { 22816, "INV_Axe_08", "=q4=碎裂白骨战斧", "=ds=#h1# #w1#", "15.99%" },
        { 23005, "INV_Relics_TotemofLife", "=q4=流水图腾", "=ds=#s16#, #e17#", "3.01%" },
        { 23006, "INV_Relics_LibramofGrace", "=q4=光明圣契", "=ds=#s16#, #e18#", "14.36%" },
        { 23029, "INV_Offhand_Naxxramas_04", "=q4=诺斯的冰冷之心", "=ds=#s15#", "11.09%" },
        { 23031, "INV_Jewelry_Ring_53Naxxramas", "=q4=命运之戒", "=ds=#s13#", "12.90%" },
        { 23028, "INV_Jewelry_Ring_35", "=q4=冰雹指环", "=ds=#s13#", "13.59%" },
        };
     
    NAXHeiganderUnclean = {
        { 22726, "INV_Qiraj_JewelBlessed", "=q5=埃提耶什的碎片", "=ds=#m2#", "11.39%" },
        { 22727, "INV_Staff_20", "=q5=埃提耶什的杖柄",             "=ds=#w9# =q1=#m4#" },
        { 0, "", "", "" },
        { 22370, "INV_Misc_Desecrated_ClothBelt", "=q4=被玷污的腰带", "=q1=#m1# =ds=#c5#, #c3#, #c8#" },
        { 22363, "INV_Misc_Desecrated_MailBelt", "=q4=被玷污的束带", "=q1=#m1# =ds=#c7#, #c1#, #c2#, #c4#" },
        { 22356, "INV_Misc_Desecrated_PlateBelt", "=q4=被玷污的护腰", "=q1=#m1# =ds=#c6#, #c9#" },
        { 0, "", "", "" },
        { 23035, "INV_Helmet_50", "=q4=导师之帽", "=ds=#s1#, #a1#" },
        { 23033, "INV_Helmet_20", "=q4=寒鳞罩帽", "=ds=#s1#, #a3#" },
        { 23019, "INV_Helmet_06", "=q4=破冰头盔", "=ds=#s1#, #a4#" },
        { 23068, "INV_Pants_Plate_20", "=q4=血战腿铠", "=ds=#s11#, #a4#" },
        { 23036, "INV_Jewelry_Necklace_30Naxxramas", "=q4=尸身项链", "=ds=#s2#" },
        };
     
    NAXLoatheb = {
        { 22726, "INV_Qiraj_JewelBlessed", "=q5=埃提耶什的碎片", "=ds=#m2#", "11.39%" },
        { 22727, "INV_Staff_20", "=q5=埃提耶什的杖柄",             "=ds=#w9# =q1=#m4#" },
        { 0, "", "", "" },
        { 22366, "INV_Misc_Desecrated_ClothPants", "=q4=被玷污的护腿", "=q1=#m1# =ds=#c5#, #c3#, #c8#" },
        { 22359, "INV_Misc_Desecrated_MailPants", "=q4=被玷污的腿甲", "=q1=#m1# =ds=#c7#, #c1#, #c2#, #c4#" },
        { 22352, "INV_Misc_Desecrated_PlatePants", "=q4=被玷污的腿铠", "=q1=#m1# =ds=#c6#, #c9#" },
        { 0, "", "", "" },
        { 23039, "INV_Weapon_Halberd_04", "=q4=蛛魔之眼", "=ds=#w7#" },
        { 22800, "INV_Staff_13", "=q4=硫磺法杖", "=ds=#w9#" },
        { 23037, "INV_Jewelry_Ring_52Naxxramas", "=q4=灵魂热情之戒", "=ds=#s13#" },
        { 23038, "INV_Jewelry_Ring_48Naxxramas", "=q4=超自然能量指环", "=ds=#s13#" },
        { 23042, "INV_Trinket_Naxxramas05", "=q4=洛欧塞布之影", "=ds=#s14#" },
        };
     
    NAXSapphiron = {
        { 23050, "INV_Misc_Cape_Naxxramas_03", "=q4=大墓地披风", "=ds=#s4#" },
        { 23045, "INV_Misc_Cape_Naxxramas_03", "=q4=支配披风",     "=ds=#s4#" },
        { 23043, "INV_Shield_26", "=q4=死亡的面孔", "=ds=#w8#" },
        { 23242, "INV_Weapon_Hand_03", "=q4=冰霜巨龙之爪", "=ds=#w13#" },
        { 23049, "INV_Offhand_Naxxramas_03", "=q4=萨菲隆的左眼", "=ds=#s15#" },
        { 23048, "INV_Offhand_Naxxramas_02", "=q4=萨菲隆的右眼", "=ds=#s15#" },
        { 23040, "INV_Trinket_Naxxramas05", "=q4=偏斜雕文", "=ds=#s14#" },
        { 23047, "INV_Trinket_Naxxramas01", "=q4=亡者之眼", "=ds=#s14#" },
        { 23046, "INV_Trinket_Naxxramas06", "=q4=萨菲隆的精华", "=ds=#s14#" },
        { 23041, "INV_Trinket_Naxxramas03", "=q4=屠龙者的纹章", "=ds=#s14#" },
        { 0, "", "", "" },
        { 23545, "Spell_Shadow_DarkRitual", "=q4=天灾的力量", "=ds=#s3# #e11#" },
        { 23547, "Spell_Shadow_DeadofNight", "=q4=天灾的活力", "=ds=#s3# #e11#" },
        { 23549, "Spell_Shadow_AntiShadow", "=q4=天灾的坚韧", "=ds=#s3# #e11#" },
        { 23548, "Spell_Shadow_DeathPact", "=q4=天灾的威严", "=ds=#s3# #e11#" },
        };
     
    NAXKelThuzard = {
        { 0, "INV_Misc_QuestionMark", "=q4=冷酷之拳", "=ds=#s9#, #a4#" },
        { 22802, "INV_Weapon_Shortblade_37", "=q4=帝殒", "=ds=#w4#" },
        { 23054, "INV_Sword_61", "=q4=格雷希尔，毁灭之黎明", "=ds=#h1# #w10#" },
        { 23577, "INV_Sword_62", "=q4=饥饿之寒", "=ds=#h1# #w10#" }, 
        { 23056, "INV_Mace_27", "=q4=扭曲虚空之锤", "=ds=#h1# #w6#" },
        { 22798, "INV_Mace_25", "=q4=米奈希尔之力", "=ds=#h2# #w6#" },
        { 22799, "INV_Staff_15", "=q4=灵魂搜寻者", "=ds=#w9#" },
        { 22821, "INV_Wand_1H_Stratholme_D_02", "=q4=厄运之指", "=ds=#w12#" },
        { 22812, "INV_Weapon_Crossbow_12", "=q4=蛛魔制奴者", "=ds=#w3#" },
        { 22819, "INV_Shield_28", "=q4=谴责之盾", "=ds=#w8#" },
        { 23057, "INV_Jewelry_Necklace_29Naxxramas", "=q4=无辜囚徒宝石", "=ds=#s2#" },
        { 23053, "INV_Jewelry_Necklace_28Naxxramas", "=q4=怒风的沸腾符咒", "=ds=#s2#" },
        { 22520, "INV_Misc_Urn_01", "=q4=克尔苏加德的护符匣", "=ds=#m2#", "100%" },
        { 23207, "INV_Misc_Token_ArgentDawn3", "=q4=勇士印记", "=ds=#s14# =q1=#m4#" },
        { 23206, "INV_Misc_Token_ArgentDawn2", "=q4=勇士印记", "=ds=#s14# =q1=#m4#" },
        { 23064, "INV_Jewelry_Ring_51Naxxramas", "=q4=梦游者之戒", "=ds=#s13# =q1=#m1# #c1#" },
        { 23067, "INV_Jewelry_Ring_51Naxxramas", "=q4=地穴追猎者指环", "=ds=#s13# =q1=#m1# #c2#" },
        { 23062, "INV_Jewelry_Ring_51Naxxramas", "=q4=霜火之戒", "=ds=#s13# =q1=#m1# #c3#" },
        { 23066, "INV_Jewelry_Ring_51Naxxramas", "=q4=救赎之戒", "=ds=#s13# =q1=#m1# #c4#" },
        { 23061, "INV_Jewelry_Ring_51Naxxramas", "=q4=信仰之戒", "=ds=#s13# =q1=#m1# #c5#" },
        { 23060, "INV_Jewelry_Ring_51Naxxramas", "=q4=骨镰之戒", "=ds=#s13# =q1=#m1# #c6#" },
        { 23065, "INV_Jewelry_Ring_51Naxxramas", "=q4=碎地者之戒", "=ds=#s13# =q1=#m1# #c7#" },
        { 23063, "INV_Jewelry_Ring_51Naxxramas", "=q4=瘟疫之心指环", "=ds=#s13# =q1=#m1# #c8#" },
        { 23059, "INV_Jewelry_Ring_51Naxxramas", "=q4=无畏之戒", "=ds=#s13# =q1=#m1# #c9#" },
        { 0, "", "", "" },
        { 22733, "INV_Misc_AhnQirajTrinket_04", "=q5=埃提耶什的法杖顶部", "=ds=#m3#" },
        { 22632, "INV_Staff_Medivh", "=q5=埃提耶什,守护者的传说之杖", "=ds=#m4#, =q1=#m1# =ds=#c1#"},
        { 22589, "INV_Staff_Medivh", "=q5=埃提耶什,守护者的传说之杖", "=ds=#m4#, =q1=#m1# =ds=#c3#"},
        { 22631, "INV_Staff_Medivh", "=q5=埃提耶什,守护者的传说之杖", "=ds=#m4#, =q1=#m1# =ds=#c5#"},
        { 22630, "INV_Staff_Medivh", "=q5=埃提耶什,守护者的传说之杖", "=ds=#m4#, =q1=#m1# =ds=#c8#"},
        };
     
    NAXTrash = { 
        { 23069, "INV_Chest_Cloth_46", "=q4=死灵骑士的外衣", "=ds=#s5#, #a1# =q1=#m1# =ds=#c5#, #c3#, #c8#" },
        { 23226, "INV_Chest_Leather_02", "=q4=食尸鬼皮外套", "=ds=#s5#, #a2#" },
        { 23663, "INV_Belt_32", "=q4=元素愤怒束带", "=ds=#s10#, #a3# =q1=#m1# =ds=#c7#" },
        { 23664, "INV_Shoulder_01", "=q4=元素愤怒肩铠", "=ds=#s3#, #a3# =q1=#m1# =ds=#c7#" },
        { 23665, "INV_Pants_Mail_14", "=q4=元素愤怒护腿", "=ds=#s11#, #a3# =q1=#m1# =ds=#c7#" },
        { 23666, "INV_Belt_27", "=q4=大十字军的腰带", "=ds=#s10#, #a4# =q1=#m1# =ds=#c4#" },
        { 23667, "INV_Shoulder_22", "=q4=大十字军的肩甲", "=ds=#s3#, #a4# =q1=#m1# =ds=#c4#" },
        { 23668, "INV_Pants_04", "=q4=大十字军腿铠", "=ds=#s11#, #a4# =q1=#m1# =ds=#c4#" },
        { 23044, "INV_knife_1h_stratholme_d_03", "=q4=末日先驱", "=ds=#h1#, #w4#" },
        { 23221, "INV_Mace_28", "=q4=遗失的义肢", "=ds=#h1# #w6#" },
        { 23238, "INV_Armor_Shield_Naxxramas_D_02", "=q4=冥河圆盾", "=ds=#w8#" },
        { 23237, "INV_Jewelry_Ring_48Naxxramas", "=q4=永恒烈焰之戒", "=ds=#s13#" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 22376, "INV_Misc_WartornScrap_Cloth", "=q3=布衣碎片", "=ds=#m3#" },
        { 22373, "INV_Misc_WartornScrap_Leather", "=q3=皮甲碎片", "=ds=#m3#" },
        { 22374, "INV_Misc_WartornScrap_Chain", "=q3=锁甲碎片", "=ds=#m3#" },
        { 22375, "INV_Misc_WartornScrap_Plate", "=q3=板甲碎片", "=ds=#m3#" },
        { 0, "", "", "" },
        { 22708, "INV_Jewelry_Ring_35", "=q1=拉玛兰迪的命运", "=ds=#m3#" },
        { 23055, "INV_Scroll_02", "=q1=熔解之语", "=ds=" },
        };

    KKazzak = {
        { 19135, "INV_Bracer_07", "=q4=黑光护腕",             "=ds=#s8#, #a1#", "11.01%" },
        { 19133, "INV_Pants_06", "=q4=魔能护腿",           "=ds=#s11#, #a1#", "8.63%" },
        { 18204, "INV_Misc_Cape_07", "=q4=艾斯卡达尔的毛皮",           "=ds=#s4#", "8.77%" },
        { 18544, "INV_Gauntlets_22", "=q4=厄运皮护手",         "=ds=#s9#, #a2#", "10.05%" },
        { 19134, "INV_Belt_16", "=q4=末日守卫腰带",           "=ds=#s10#, #a2#", "9.75%" },
        { 18546, "INV_Helmet_18", "=q4=恶魔颅壳",             "=ds=#s1#, #a3#", "9.39%" },
        { 17112, "INV_Hammer_05", "=q4=苍穹击碎者",           "=ds=#h3#, #w6#", "10.84%" },
        { 17113, "INV_Staff_Goldfeathered_01", "=q4=琥珀封印", "=ds=#h2#, #w9#", "10.50%" },
        { 17111, "INV_Jewelry_Talisman_01", "=q4=火焰之怒", "=ds=#s2#", "10.95%" },
        { 18543, "INV_Jewelry_Ring_20", "=q4=混乱之戒",         "=ds=#s13#", "9.82%" },
        { 0, "", "", "", "" },
        { 18665, "Spell_Shadow_UnholyFrenzy", "=q4=暗影之眼", "=ds=#m3#", "29.98%" },
        { 18608, "INV_Staff_30", "=q4=祝福", "=ds=#m4#" },
        { 18609, "INV_Staff_12", "=q4=咒逐", "=ds=#m4#" },
        };

    DTaerar = {
        { 20631, "INV_Boots_Cloth_05", "=q4=惊骇之靴",     "=ds=#s12#s, #a1#", "13.14%" },
        { 20634, "INV_Boots_08", "=q4=乞求之靴",                "=ds=#s12#s, #a2#", "10.15%" },
        { 20633, "INV_Shoulder_29", "=q4=异常皮质肩甲", "=ds=#s3#, #a2#", "11.30%" },
        { 20577, "INV_Sword_44", "=q4=噩梦之刃",                "=ds=#h1#, #w10#", "12.07%" },
        { 20632, "INV_Jewelry_Ring_04", "=q4=心灵之泪",           "=ds=#s13#", "13.69%" },
        { 0, "", "", "", "" },
        { 0, "", "", "", "" },
        { 0, "", "", "", "" },
        { 20618, "INV_Gauntlets_17", "=q4=虚幻能量手套", "=ds=#s9#, #a1#=q1=#m5#", "9.71%" },
        { 20579, "INV_Misc_Cape_17", "=q4=绿色龙皮披风",     "=ds=#s4# =q1=#m5#", "9.14%" },
        { 20615, "INV_Bracer_15", "=q4=龙刺裹布",              "=ds=#s8#, #a2# =q1=#m5#", "8.83%" },
        { 20617, "INV_Pants_Mail_08", "=q4=上古腐蚀护腿", "=ds=#s11#, #a3#=q1=#m5#", "9.80%" },
        { 20616, "INV_Bracer_14", "=q4=龙骨护腕",        "=ds=#s8#, #a4# =q1=#m5#", "10.20%" },
        { 20619, "INV_Boots_Plate_04", "=q4=蚀刻胫甲",   "=ds=#s12#s, #a4# =q1=#m5#", "8.85%" },
        { 20580, "INV_Mace_20", "=q4=野兽狂怒之锤",          "=ds=#h3#, #w6# =q1=#m5#", "8.93%" },
        { 20581, "INV_Staff_36", "=q4=猛烈生长法杖",        "=ds=#h2#, #w9# =q1=#m5#", "9.70%" },
        { 20582, "INV_Misc_Orb_01", "=q4=沉睡之石",                "=ds=#s15#=q1=#m5#", "9.57%" },
        { 0, "", "", "", "" },
        { 20644, "Spell_Shadow_Haunting", "=q4=梦魇包裹的物", "=ds=#m3# =q1=#m5#", "80.05%" },
        { 20600, "INV_Jewelry_Ring_37", "=q4=玛法里奥的徽记之戒", "=ds=#m4#" },
        };

    DEmeriss = {
        { 20623, "INV_Helmet_17", "=q4=躁动梦境头饰",          "=ds=#s1#, #a2#", "10.51%" },
        { 20621, "INV_Boots_Chain_11", "=q4=无边沼泽之靴",      "=ds=#s12#s, #a3#", "10.24%" },
        { 20599, "INV_Weapon_Crossbow_11", "=q4=抛光铁木强弩", "=ds=#w3#", "12.63%" },
        { 20624, "INV_Jewelry_Ring_38", "=q4=无息指环",          "=ds=#s13#", "13.23%" },
        { 20622, "INV_Jewelry_Necklace_18", "=q4=龙心项链",      "=ds=#s2#", "12.35%" },
        { 0, "", "", "", "" },
        { 0, "", "", "", "" },
        { 0, "", "", "", "" },
        { 20618, "INV_Gauntlets_17", "=q4=虚幻能量手套", "=ds=#s9#, #a1#=q1=#m5#", "9.71%" },
        { 20579, "INV_Misc_Cape_17", "=q4=绿色龙皮披风",     "=ds=#s4# =q1=#m5#", "9.14%" },
        { 20615, "INV_Bracer_15", "=q4=龙刺裹布",              "=ds=#s8#, #a2# =q1=#m5#", "8.83%" },
        { 20617, "INV_Pants_Mail_08", "=q4=上古腐蚀护腿", "=ds=#s11#, #a3#=q1=#m5#", "9.80%" },
        { 20616, "INV_Bracer_14", "=q4=龙骨护腕",        "=ds=#s8#, #a4# =q1=#m5#", "10.20%" },
        { 20619, "INV_Boots_Plate_04", "=q4=蚀刻胫甲",   "=ds=#s12#s, #a4# =q1=#m5#", "8.85%" },
        { 20580, "INV_Mace_20", "=q4=野兽狂怒之锤",          "=ds=#h3#, #w6# =q1=#m5#", "8.93%" },
        { 20581, "INV_Staff_36", "=q4=猛烈生长法杖",        "=ds=#h2#, #w9# =q1=#m5#", "9.70%" },
        { 20582, "INV_Misc_Orb_01", "=q4=沉睡之石",                "=ds=#s15#=q1=#m5#", "9.57%" },
        { 0, "", "", "", "" },
        { 20644, "Spell_Shadow_Haunting", "=q4=梦魇包裹的物", "=ds=#m3# =q1=#m5#", "80.05%" },
        { 20600, "INV_Jewelry_Ring_37", "=q4=玛法里奥的徽记之戒", "=ds=#m4#" },
        };

    DLethon = {
        { 20625, "INV_Belt_15", "=q4=黑暗沼泽腰带",                "=ds=#s10#, #a1#", "10.99%" },
        { 20626, "INV_Bracer_07", "=q4=黑色树皮护腕",             "=ds=#s8#, #a1#", "9.44%" },
        { 20628, "INV_Helmet_43", "=q4=异常生长之帽",                "=ds=#s1#, #a2#", "15.80%" },
        { 20627, "INV_Pants_Leather_11", "=q4=黑暗之心短裤",           "=ds=#s11#, #a2#", "11.68%" },
        { 20629, "INV_Boots_Chain_08", "=q4=恶毒护足",         "=ds=#s12#s, #a3#", "4.46%" },
        { 20630, "INV_Gauntlets_29", "=q4=光亮护手", "=ds=#s9#, #a4#", "8.19%" },
        { 0, "", "", "", "" },
        { 0, "", "", "", "" },
        { 0, "", "", "", "" },
        { 20618, "INV_Gauntlets_17", "=q4=虚幻能量手套", "=ds=#s9#, #a1#=q1=#m5#", "9.71%" },
        { 20579, "INV_Misc_Cape_17", "=q4=绿色龙皮披风",     "=ds=#s4# =q1=#m5#", "9.14%" },
        { 20615, "INV_Bracer_15", "=q4=龙刺裹布",              "=ds=#s8#, #a2# =q1=#m5#", "8.83%" },
        { 20617, "INV_Pants_Mail_08", "=q4=上古腐蚀护腿", "=ds=#s11#, #a3#=q1=#m5#", "9.80%" },
        { 20616, "INV_Bracer_14", "=q4=龙骨护腕",        "=ds=#s8#, #a4# =q1=#m5#", "10.20%" },
        { 20619, "INV_Boots_Plate_04", "=q4=蚀刻胫甲",   "=ds=#s12#s, #a4# =q1=#m5#", "8.85%" },
        { 20580, "INV_Mace_20", "=q4=野兽狂怒之锤",          "=ds=#h3#, #w6# =q1=#m5#", "8.93%" },
        { 20581, "INV_Staff_36", "=q4=猛烈生长法杖",        "=ds=#h2#, #w9# =q1=#m5#", "9.70%" },
        { 20582, "INV_Misc_Orb_01", "=q4=沉睡之石",                "=ds=#s15#=q1=#m5#", "9.57%" },
        { 0, "", "", "", "" },
        { 20644, "Spell_Shadow_Haunting", "=q4=梦魇包裹的物", "=ds=#m3# =q1=#m5#", "80.05%" },
        { 20600, "INV_Jewelry_Ring_37", "=q4=玛法里奥的徽记之戒", "=ds=#m4#" },
        };

    DYsondre = {
        { 20635, "INV_Chest_Cloth_39", "=q4=镶玉外套",        "=ds=Robe, #a1#", "14.19%" },
        { 20638, "INV_Pants_Mail_15", "=q4=狂乱护腿", "=ds=#s11#, #a3#", "3.66%" },
        { 20639, "INV_Pants_Plate_05", "=q4=奇异雕文腿甲",  "=ds=#s11#, #a4#", "8.87%" },
        { 20637, "INV_Shoulder_11", "=q4=蚀刻肩甲",        "=ds=#s3#, #a4#", "10.13%" },
        { 20578, "INV_Weapon_ShortBlade_22", "=q4=翡翠龙牙",     "=ds=#h1#, #w4#", "9.95%" },
        { 20636, "INV_Misc_Gem_Stone_01", "=q4=休眠水晶",       "=ds=#s14#", "12.75%" },
        { 0, "", "", "", "" },
        { 0, "", "", "", "" },
        { 0, "", "", "", "" },
        { 20618, "INV_Gauntlets_17", "=q4=虚幻能量手套", "=ds=#s9#, #a1#=q1=#m5#", "9.71%" },
        { 20579, "INV_Misc_Cape_17", "=q4=绿色龙皮披风",     "=ds=#s4# =q1=#m5#", "9.14%" },
        { 20615, "INV_Bracer_15", "=q4=龙刺裹布",              "=ds=#s8#, #a2# =q1=#m5#", "8.83%" },
        { 20617, "INV_Pants_Mail_08", "=q4=上古腐蚀护腿", "=ds=#s11#, #a3#=q1=#m5#", "9.80%" },
        { 20616, "INV_Bracer_14", "=q4=龙骨护腕",        "=ds=#s8#, #a4# =q1=#m5#", "10.20%" },
        { 20619, "INV_Boots_Plate_04", "=q4=蚀刻胫甲",   "=ds=#s12#s, #a4# =q1=#m5#", "8.85%" },
        { 20580, "INV_Mace_20", "=q4=野兽狂怒之锤",          "=ds=#h3#, #w6# =q1=#m5#", "8.93%" },
        { 20581, "INV_Staff_36", "=q4=猛烈生长法杖",        "=ds=#h2#, #w9# =q1=#m5#", "9.70%" },
        { 20582, "INV_Misc_Orb_01", "=q4=沉睡之石",                "=ds=#s15#=q1=#m5#", "9.57%" },
        { 0, "", "", "", "" },
        { 20644, "Spell_Shadow_Haunting", "=q4=梦魇包裹的物", "=ds=#m3# =q1=#m5#", "80.05%" },
        { 20600, "INV_Jewelry_Ring_37", "=q4=玛法里奥的徽记之戒", "=ds=#m4#" },
        };

    AAzuregos = {
        { 18545, "INV_Pants_08", "=q4=无上奥法护腿",     "=ds=#s11#, #a1#", "16.39% " },
        { 19132, "INV_Crown_01", "=q4=水晶头冠",            "=ds=#s1#, #a1#", "13.54%" },
        { 19131, "INV_Boots_Cloth_14", "=q4=雪盲软靴",             "=ds=#s12#s, #a1#", "12.23%" },
        { 18541, "INV_Misc_Cape_06", "=q4=强者斗篷",                "=ds=#s4#", "11.71%" },
        { 18208, "INV_Misc_Cape_04", "=q4=祝福披风",         "=ds=#s4#", "11.22%" },
        { 18547, "INV_Belt_31", "=q4=永冻腰带",              "=ds=#s10#, #a4#", "12.93%" },
        { 17070, "INV_Weapon_ShortBlade_06", "=q4=秘法之牙",  "=ds=#h1#, #w4#", "13.64%" },
        { 18202, "INV_Misc_MonsterClaw_04", "=q4=艾斯卡达尔的左爪", "=ds=#h4#, #w13#", "11.76%" },
        { 18542, "INV_Sword_41", "=q4=台风",                          "=ds=#h2#, #w10#", "16.89%" },
        { 19130, "INV_Wand_01", "=q4=冰冷魔棒",                         "=ds=#w12#", "11.89%" },
        { 0, "", "", "", "" },
        { 18704, "INV_Misc_Bandage_04", "=q4=成年蓝龙的肌腱", "=ds=#m3#", "51.56%" },
        { 18714, "INV_Misc_Quiver_03", "=q4=龙筋箭袋", "=ds=#m4#" },
        };
    T3Mage = {
        { 0,"Spell_Frost_IceStorm","=q6=#t3s3#", "" },
        { 22498, "INV_Crown_01", "=q4=霜火头饰", "=ds="..AtlasLootBossNames["Naxxramas"][4] },
        { 22499, "INV_Shoulder_25", "=q4=霜火肩垫", "=ds="..AtlasLootBossNames["Naxxramas"][1]..", "..AtlasLootBossNames["Naxxramas"][2] },
        { 22496, "INV_Chest_Cloth_43", "=q4=霜火长袍", "=ds="..AtlasLootBossNames["Naxxramas"][10] },
        { 22503, "INV_Bracer_13", "=q4=霜火腕轮", "=ds="..AtlasLootBossNames["Naxxramas"][5]..", "..AtlasLootBossNames["Naxxramas"][6] },
        { 22501, "INV_Gauntlets_17", "=q4=霜火手套", "=ds="..AtlasLootBossNames["Naxxramas"][7] },
        { 22502, "INV_Belt_03", "=q4=霜火腰带", "=ds="..AtlasLootBossNames["Naxxramas"][11]..", "..AtlasLootBossNames["Naxxramas"][12] },
        { 22497, "INV_Pants_Cloth_05", "=q4=霜火护腿", "=ds="..AtlasLootBossNames["Naxxramas"][13] },
        { 22500, "INV_Boots_Fabric_01", "=q4=霜火便鞋", "=ds="..AtlasLootBossNames["Naxxramas"][3]..", "..AtlasLootBossNames["Naxxramas"][8]..", "..AtlasLootBossNames["Naxxramas"][9] },
        { 23062, "INV_Jewelry_Ring_51Naxxramas", "=q4=霜火之戒", "=ds="..AtlasLootBossNames["Naxxramas"][15] },
        };
    T3Warlock = {
        { 0,"Spell_Shadow_CurseOfTounges","=q6=#t3s8#","" },
        { 22506, "INV_Crown_01", "=q4=瘟疫之心头饰", "=ds="..AtlasLootBossNames["Naxxramas"][4] },
        { 22507, "INV_Shoulder_25", "=q4=瘟疫之心肩垫", "=ds="..AtlasLootBossNames["Naxxramas"][1]..", "..AtlasLootBossNames["Naxxramas"][2] },
        { 22504, "INV_Chest_Cloth_43", "=q4=瘟疫之心长袍", "=ds="..AtlasLootBossNames["Naxxramas"][10] },
        { 22511, "INV_Bracer_13", "=q4=瘟疫之心腕轮", "=ds="..AtlasLootBossNames["Naxxramas"][5]..", "..AtlasLootBossNames["Naxxramas"][6] },
        { 22509, "INV_Gauntlets_17", "=q4=瘟疫之心手套", "=ds="..AtlasLootBossNames["Naxxramas"][7] },
        { 22510, "INV_Belt_03", "=q4=瘟疫之心腰带", "=ds="..AtlasLootBossNames["Naxxramas"][11]..", "..AtlasLootBossNames["Naxxramas"][12] },
        { 22505, "INV_Pants_Cloth_05", "=q4=瘟疫之心护腿", "=ds="..AtlasLootBossNames["Naxxramas"][13] },
        { 22508, "INV_Boots_Fabric_01", "=q4=瘟疫之心便鞋", "=ds="..AtlasLootBossNames["Naxxramas"][3]..", "..AtlasLootBossNames["Naxxramas"][8]..", "..AtlasLootBossNames["Naxxramas"][9] },
        { 23063, "INV_Jewelry_Ring_51Naxxramas", "=q4=瘟疫之心指环", "=ds="..AtlasLootBossNames["Naxxramas"][15] },
        };
    T3Priest = {
        { 0,"Spell_Holy_PowerWordShield","=q6=#t3s5#","" },
        { 22514, "INV_Crown_01", "=q4=信仰头环", "=ds="..AtlasLootBossNames["Naxxramas"][4] },
        { 22515, "INV_Shoulder_25", "=q4=信仰肩垫", "=ds="..AtlasLootBossNames["Naxxramas"][1]..", "..AtlasLootBossNames["Naxxramas"][2] },
        { 22512, "INV_Chest_Cloth_43", "=q4=信仰长袍", "=ds="..AtlasLootBossNames["Naxxramas"][10] },
        { 22519, "INV_Bracer_13", "=q4=信仰腕轮", "=ds="..AtlasLootBossNames["Naxxramas"][5]..", "..AtlasLootBossNames["Naxxramas"][6] },
        { 22517, "INV_Gauntlets_17", "=q4=信仰手套", "=ds="..AtlasLootBossNames["Naxxramas"][7] },
        { 22518, "INV_Belt_08", "=q4=信仰腰带", "=ds="..AtlasLootBossNames["Naxxramas"][11]..", "..AtlasLootBossNames["Naxxramas"][12] },
        { 22513, "INV_Pants_Cloth_05", "=q4=信仰护腿", "=ds="..AtlasLootBossNames["Naxxramas"][13] },
        { 22516, "INV_Boots_Fabric_01", "=q4=信仰便鞋", "=ds="..AtlasLootBossNames["Naxxramas"][3]..", "..AtlasLootBossNames["Naxxramas"][8]..", "..AtlasLootBossNames["Naxxramas"][9] },
        { 23061, "INV_Jewelry_Ring_51Naxxramas", "=q4=信仰之戒", "=ds="..AtlasLootBossNames["Naxxramas"][15] },
        };
    T3Rogue = {
        { 0,"Ability_BackStab","=q6="..ATLASLOOT_T3_ROGUE,"" },
        { 22478, "INV_Helmet_58", "=q4=骨镰头盔", "=ds="..AtlasLootBossNames["Naxxramas"][4] },
        { 22479, "INV_Shoulder_29", "=q4=骨镰肩铠", "=ds="..AtlasLootBossNames["Naxxramas"][1]..", "..AtlasLootBossNames["Naxxramas"][2] },
        { 22476, "INV_Chest_Plate02", "=q4=骨镰胸甲", "=ds="..AtlasLootBossNames["Naxxramas"][10] },
        { 22483, "INV_Bracer_15", "=q4=骨镰护腕", "=ds="..AtlasLootBossNames["Naxxramas"][5]..", "..AtlasLootBossNames["Naxxramas"][6] },
        { 22481, "INV_Gauntlets_28", "=q4=骨镰护手", "=ds="..AtlasLootBossNames["Naxxramas"][7] },
        { 22482, "INV_Belt_27", "=q4=骨镰护腰", "=ds="..AtlasLootBossNames["Naxxramas"][11]..", "..AtlasLootBossNames["Naxxramas"][12] },
        { 22477, "INV_Pants_Plate_05", "=q4=骨镰腿甲", "=ds="..AtlasLootBossNames["Naxxramas"][13] },
        { 22480, "INV_Boots_Plate_06", "=q4=骨镰马靴", "=ds="..AtlasLootBossNames["Naxxramas"][3]..", "..AtlasLootBossNames["Naxxramas"][8]..", "..AtlasLootBossNames["Naxxramas"][9] },
        { 23060, "INV_Jewelry_Ring_51Naxxramas", "=q4=骨镰之戒", "=ds="..AtlasLootBossNames["Naxxramas"][15] },
        };
    T3Druid = {
        { 0,"Spell_Nature_Regeneration","=q6="..ATLASLOOT_T3_DRUID,"" },
        { 22490, "INV_Helmet_15", "=q4=梦游者头饰", "=ds="..AtlasLootBossNames["Naxxramas"][4] },
        { 22491, "INV_Shoulder_14", "=q4=梦游者肩饰", "=ds="..AtlasLootBossNames["Naxxramas"][1]..", "..AtlasLootBossNames["Naxxramas"][2] },
        { 22488, "INV_Chest_Chain_15", "=q4=梦游者外套", "=ds="..AtlasLootBossNames["Naxxramas"][10] },
        { 22495, "INV_Bracer_02", "=q4=梦游者腕甲", "=ds="..AtlasLootBossNames["Naxxramas"][5]..", "..AtlasLootBossNames["Naxxramas"][6] },
        { 22493, "INV_Gauntlets_25", "=q4=梦游者护手", "=ds="..AtlasLootBossNames["Naxxramas"][7] },
        { 22494, "INV_Belt_22", "=q4=梦游者束带", "=ds="..AtlasLootBossNames["Naxxramas"][11]..", "..AtlasLootBossNames["Naxxramas"][12] },
        { 22489, "INV_Pants_Mail_15", "=q4=梦游者护腿", "=ds="..AtlasLootBossNames["Naxxramas"][13] },
        { 22492, "INV_Boots_Chain_05", "=q4=梦游者长靴", "=ds="..AtlasLootBossNames["Naxxramas"][3]..", "..AtlasLootBossNames["Naxxramas"][8]..", "..AtlasLootBossNames["Naxxramas"][9] },
        { 23064, "INV_Jewelry_Ring_51Naxxramas", "=q4=梦游者之戒", "=ds="..AtlasLootBossNames["Naxxramas"][15] },
        };
    T3Hunter = {
        { 0,"Ability_Hunter_RunningShot","=q6="..ATLASLOOT_T3_HUNTER,"" },
        { 22438, "INV_Helmet_15", "=q4=地穴追猎者头饰", "=ds="..AtlasLootBossNames["Naxxramas"][4] },
        { 22439, "INV_Shoulder_14", "=q4=地穴追猎者肩甲", "=ds="..AtlasLootBossNames["Naxxramas"][1]..", "..AtlasLootBossNames["Naxxramas"][2] },
        { 22436, "INV_Chest_Chain_15", "=q4=地穴追猎者外套", "=ds="..AtlasLootBossNames["Naxxramas"][10] },
        { 22443, "INV_Bracer_02", "=q4=地穴追猎者护腕", "=ds="..AtlasLootBossNames["Naxxramas"][5]..", "..AtlasLootBossNames["Naxxramas"][6] },
        { 22441, "INV_Gauntlets_25", "=q4=地穴追猎者护手", "=ds="..AtlasLootBossNames["Naxxramas"][7] },
        { 22442, "INV_Belt_22", "=q4=地穴追猎者束带", "=ds="..AtlasLootBossNames["Naxxramas"][11]..", "..AtlasLootBossNames["Naxxramas"][12] },
        { 22437, "INV_Pants_Mail_15", "=q4=地穴追猎者护腿", "=ds="..AtlasLootBossNames["Naxxramas"][13] },
        { 22440, "INV_Boots_Chain_05", "=q4=地穴追猎者长靴", "=ds="..AtlasLootBossNames["Naxxramas"][3]..", "..AtlasLootBossNames["Naxxramas"][8]..", "..AtlasLootBossNames["Naxxramas"][9] },
        { 23067, "INV_Jewelry_Ring_51Naxxramas", "=q4=地穴追猎者指环", "=ds="..AtlasLootBossNames["Naxxramas"][15] },
        };
    T3Paladin = {
        { 0,"Spell_Holy_SealOfMight","=q6="..ATLASLOOT_T3_PALADIN,"" },
        { 22428, "INV_Helmet_15", "=q4=救赎头饰", "=ds="..AtlasLootBossNames["Naxxramas"][4] },
        { 22429, "INV_Shoulder_14", "=q4=救赎肩铠", "=ds="..AtlasLootBossNames["Naxxramas"][1]..", "..AtlasLootBossNames["Naxxramas"][2] },
        { 22425, "INV_Chest_Chain_15", "=q4=救赎外套", "=ds="..AtlasLootBossNames["Naxxramas"][10] },
        { 22424, "INV_Bracer_02", "=q4=救赎护腕", "=ds="..AtlasLootBossNames["Naxxramas"][5]..", "..AtlasLootBossNames["Naxxramas"][6] },
        { 22426, "INV_Gauntlets_25", "=q4=救赎护手", "=ds="..AtlasLootBossNames["Naxxramas"][7] },
        { 22431, "INV_Belt_22", "=q4=救赎束带", "=ds="..AtlasLootBossNames["Naxxramas"][11]..", "..AtlasLootBossNames["Naxxramas"][12] },
        { 22427, "INV_Pants_Mail_15", "=q4=救赎腿甲", "=ds="..AtlasLootBossNames["Naxxramas"][13] },
        { 22430, "INV_Boots_Chain_05", "=q4=救赎长靴", "=ds="..AtlasLootBossNames["Naxxramas"][3]..", "..AtlasLootBossNames["Naxxramas"][8]..", "..AtlasLootBossNames["Naxxramas"][9] },
        { 23066, "INV_Jewelry_Ring_51Naxxramas", "=q4=救赎之戒", "=ds="..AtlasLootBossNames["Naxxramas"][15] },
        };
    T3Shaman = {
        { 0,"Spell_FireResistanceTotem_01","=q6="..ATLASLOOT_T3_SHAMAN,"" },
        { 22466, "INV_Helmet_15", "=q4=碎地者头饰", "=ds="..AtlasLootBossNames["Naxxramas"][4] },
        { 22467, "INV_Shoulder_14", "=q4=碎地者肩饰", "=ds="..AtlasLootBossNames["Naxxramas"][1]..", "..AtlasLootBossNames["Naxxramas"][2] },
        { 22464, "INV_Chest_Chain_15", "=q4=碎地者外套", "=ds="..AtlasLootBossNames["Naxxramas"][10] },
        { 22471, "INV_Bracer_02", "=q4=碎地者护腕", "=ds="..AtlasLootBossNames["Naxxramas"][5]..", "..AtlasLootBossNames["Naxxramas"][6] },
        { 22469, "INV_Gauntlets_25", "=q4=碎地者护手", "=ds="..AtlasLootBossNames["Naxxramas"][7] },
        { 22470, "INV_Belt_22", "=q4=碎地者束带", "=ds="..AtlasLootBossNames["Naxxramas"][11]..", "..AtlasLootBossNames["Naxxramas"][12] },
        { 22465, "INV_Pants_Mail_15", "=q4=碎地者腿甲", "=ds="..AtlasLootBossNames["Naxxramas"][13] },
        { 22468, "INV_Boots_Chain_05", "=q4=碎地者长靴", "=ds="..AtlasLootBossNames["Naxxramas"][3]..", "..AtlasLootBossNames["Naxxramas"][8]..", "..AtlasLootBossNames["Naxxramas"][9] },
        { 23065, "INV_Jewelry_Ring_51Naxxramas", "=q4=碎地者之戒", "=ds="..AtlasLootBossNames["Naxxramas"][15] },
        };
    T3Warrior = {
        { 0,"INV_Shield_05","=q6="..ATLASLOOT_T3_WARRIOR,"" },
        { 22418, "INV_Helmet_58", "=q4=无畏头盔", "=ds="..AtlasLootBossNames["Naxxramas"][4] },
        { 22419, "INV_Shoulder_29", "=q4=无畏肩铠", "=ds="..AtlasLootBossNames["Naxxramas"][1]..", "..AtlasLootBossNames["Naxxramas"][2] },
        { 22416, "INV_Chest_Plate02", "=q4=无畏胸甲", "=ds="..AtlasLootBossNames["Naxxramas"][10] },
        { 22423, "INV_Bracer_15", "=q4=无畏护腕", "=ds="..AtlasLootBossNames["Naxxramas"][5]..", "..AtlasLootBossNames["Naxxramas"][6] },
        { 22421, "INV_Gauntlets_28", "=q4=无畏手套", "=ds="..AtlasLootBossNames["Naxxramas"][7] },
        { 22422, "INV_Belt_27", "=q4=无畏腰带", "=ds="..AtlasLootBossNames["Naxxramas"][11]..", "..AtlasLootBossNames["Naxxramas"][12] },
        { 22417, "INV_Pants_Plate_05", "=q4=无畏腿铠", "=ds="..AtlasLootBossNames["Naxxramas"][13] },
        { 22420, "INV_Boots_Plate_06", "=q4=无畏马靴", "=ds="..AtlasLootBossNames["Naxxramas"][3]..", "..AtlasLootBossNames["Naxxramas"][8]..", "..AtlasLootBossNames["Naxxramas"][9] },
        { 23059, "INV_Jewelry_Ring_51Naxxramas", "=q4=无畏之戒", "=ds="..AtlasLootBossNames["Naxxramas"][15] },
        };
        
    T2Mage = {
        { 0,"Spell_Frost_IceStorm","=q6=#t2s3#","" },
        { 16914, "INV_Helmet_70", "=q4=灵风头冠", "=ds="..AtlasLootBossNames["OnyxiasLair"][1] , "14.09%" },
        { 16917, "INV_Shoulder_32", "=q4=灵风衬肩", "=ds="..AtlasLootBossNames["BlackwingLair"][7],     "18.09%" },
        { 16916, "INV_Chest_Cloth_03", "=q4=灵风长袍", "=ds="..AtlasLootBossNames["BlackwingLair"][8],     "14.03%" },
        { 16918, "INV_Bracer_09", "=q4=N灵风束腕", "=ds="..AtlasLootBossNames["BlackwingLair"][1],         "20.41%" },
        { 16913, "INV_Gauntlets_14", "=q4=灵风手套", "=ds="..AtlasLootBossNames["BlackwingLair"][4]..", ".."=ds="..AtlasLootBossNames["BlackwingLair"][5]..", ".."=ds="..AtlasLootBossNames["BlackwingLair"][6],     "7.37%" },
        { 16818, "INV_Belt_22", "=q4=灵风腰带", "=ds="..AtlasLootBossNames["BlackwingLair"][2],     "19.94%" },
        { 16915, "INV_Pants_08", "=q4=灵风短裤", "=ds="..AtlasLootBossNames["MoltenCore"][10], "17.37%" },
        { 16912, "INV_Boots_07", "=q4=灵风长靴", "=ds="..AtlasLootBossNames["BlackwingLair"][3],       "17.17%" },
        };

    T2Priest = {
        { 0,"Spell_Holy_PowerWordShield","=q6=#t2s5#","" },
        { 16921, "INV_Helmet_24", "=q4=卓越之环",      "=ds="..AtlasLootBossNames["OnyxiasLair"][1], " 13.39%" },
        { 16924, "INV_Shoulder_02", "=q4=卓越肩铠",    "=ds="..AtlasLootBossNames["BlackwingLair"][7],   "17.83%" },
        { 16923, "INV_Chest_Cloth_03", "=q4=卓越法袍", "=ds="..AtlasLootBossNames["BlackwingLair"][8],   "14.83%" },
        { 16926, "INV_Bracer_09", "=q4=卓越束腕",      "=ds="..AtlasLootBossNames["BlackwingLair"][1],       "20.37%" },
        { 16920, "INV_Gauntlets_14", "=q4=卓越护手",   "=ds="..AtlasLootBossNames["BlackwingLair"][4]..", ".."=ds="..AtlasLootBossNames["BlackwingLair"][5]..", ".."=ds="..AtlasLootBossNames["BlackwingLair"][6],   "6.01%" },
        { 16925, "INV_Belt_22", "=q4=卓越腰带",        "=ds="..AtlasLootBossNames["BlackwingLair"][2],   "18.76%" },
        { 16922, "INV_Pants_08", "=q4=卓越护腿",       "=ds="..AtlasLootBossNames["MoltenCore"][10], "17.30%" },
        { 16919, "INV_Boots_07", "=q4=卓越长靴",       "=ds="..AtlasLootBossNames["BlackwingLair"][3],     "14.61%" },
        };

    T2Warlock = {
        { 0,"Spell_Shadow_CurseOfTounges","=q6=#t2s8#","" },
        { 16929, "INV_Helmet_08", "=q4=复仇骨帽",        "=ds="..AtlasLootBossNames["OnyxiasLair"][1], " 13.54%" },
        { 16932, "INV_Shoulder_19", "=q4=复仇肩铠",      "=ds="..AtlasLootBossNames["BlackwingLair"][7],  "16.26%" },
        { 16931, "INV_Chest_Leather_01", "=q4=复仇法袍", "=ds="..AtlasLootBossNames["BlackwingLair"][8],  "12.46%" },
        { 16934, "INV_Bracer_07", "=q4=复仇护腕",        "=ds="..AtlasLootBossNames["BlackwingLair"][1],      "18.11%" },
        { 16928, "INV_Gauntlets_19", "=q4=复仇手套",     "=ds="..AtlasLootBossNames["BlackwingLair"][4]..", ".."=ds="..AtlasLootBossNames["BlackwingLair"][5]..", ".."=ds="..AtlasLootBossNames["BlackwingLair"][6],  "5.28%" },
        { 16933, "INV_Belt_13", "=q4=复仇腰带",          "=ds="..AtlasLootBossNames["BlackwingLair"][2],  "18.42%" },
        { 16930, "INV_Pants_07", "=q4=复仇护腿",         "=ds="..AtlasLootBossNames["MoltenCore"][10], "16.87%" },
        { 16927, "INV_Boots_05", "=q4=复仇战靴",         "=ds="..AtlasLootBossNames["BlackwingLair"][3],    "15.32%" },
        };

    T2Rogue = {
        { 0,"Ability_BackStab","=q6=#t2s6#","" },
        { 16908, "INV_Helmet_41", "=q4=血牙头巾",      "=ds="..AtlasLootBossNames["OnyxiasLair"][1], " 13.21%" },
        { 16832, "INV_Shoulder_23", "=q4=血牙肩甲",    "=ds="..AtlasLootBossNames["BlackwingLair"][7],    "17.03%" },
        { 16905, "INV_Chest_Cloth_07", "=q4=血牙胸甲", "=ds="..AtlasLootBossNames["BlackwingLair"][8],    "14.21%" },
        { 16911, "INV_Bracer_02", "=q4=血牙护腕",      "=ds="..AtlasLootBossNames["BlackwingLair"][1],        "20.69%" },
        { 16907, "INV_Gauntlets_21", "=q4=血牙手套",   "=ds="..AtlasLootBossNames["BlackwingLair"][4]..", ".."=ds="..AtlasLootBossNames["BlackwingLair"][5]..", ".."=ds="..AtlasLootBossNames["BlackwingLair"][6],    "6.84%" },
        { 16910, "INV_Belt_23", "=q4=血牙腰带",        "=ds="..AtlasLootBossNames["BlackwingLair"][2],    "19.69%" },
        { 16909, "INV_Pants_06", "=q4=血牙短裤",       "=ds="..AtlasLootBossNames["MoltenCore"][10], "17.18%" },
        { 16906, "INV_Boots_08", "=q4=血牙长靴",       "=ds="..AtlasLootBossNames["BlackwingLair"][3],      "15.66%" },
        };

    T2Druid = {
        { 0,"Spell_Nature_Regeneration","=q6=#t2s1#","" },
        { 16900, "INV_Helmet_09", "=q4=怒风头巾",    "=ds="..AtlasLootBossNames["OnyxiasLair"][1], " 13.08%" },
        { 16902, "INV_Shoulder_07", "=q4=怒风肩甲",    "=ds="..AtlasLootBossNames["BlackwingLair"][7],    "14.63%" },
        { 16897, "INV_Chest_Chain_16", "=q4=怒风胸甲", "=ds="..AtlasLootBossNames["BlackwingLair"][8],    "11.89%" },
        { 16904, "INV_Bracer_03", "=q4=怒风护腕",      "=ds="..AtlasLootBossNames["BlackwingLair"][1],        "17.38%" },
        { 16899, "INV_Gauntlets_25", "=q4=怒风护手", "=ds="..AtlasLootBossNames["BlackwingLair"][4]..", ".."=ds="..AtlasLootBossNames["BlackwingLair"][5]..", ".."=ds="..AtlasLootBossNames["BlackwingLair"][6],    "5.34%" },
        { 16903, "INV_Belt_06", "=q4=怒风腰带",        "=ds="..AtlasLootBossNames["BlackwingLair"][2],    "16.90%" },
        { 16901, "INV_Pants_06", "=q4=怒风腿甲",     "=ds="..AtlasLootBossNames["MoltenCore"][10], "15.49%" },
        { 16898, "INV_Boots_08", "=q4=怒风长靴",       "=ds="..AtlasLootBossNames["BlackwingLair"][3],      "13.79%" },
	};

    T2Shaman = {
        { 0,"Spell_FireResistanceTotem_01","=q6=#t2s7#","" },
        { 16947, "INV_Helmet_69", "=q4=无尽风暴头盔",      "=ds="..AtlasLootBossNames["OnyxiasLair"][1], "  4.86%" },
        { 16945, "INV_Shoulder_33", "=q4=无尽风暴肩饰",    "=ds="..AtlasLootBossNames["BlackwingLair"][7],   " 6.73%" },
        { 16950, "INV_Chest_Chain_11", "=q4=无尽风暴胸甲", "=ds="..AtlasLootBossNames["BlackwingLair"][8],   " 5.65%" },
        { 16943, "INV_Bracer_16", "=q4=无尽风暴护腕",      "=ds="..AtlasLootBossNames["BlackwingLair"][1],       " 7.54%" },
        { 16948, "INV_Gauntlets_11", "=q4=无尽风暴护手",   "=ds="..AtlasLootBossNames["BlackwingLair"][4]..", ".."=ds="..AtlasLootBossNames["BlackwingLair"][5]..", ".."=ds="..AtlasLootBossNames["BlackwingLair"][6],   "2.13%" },
        { 16944, "INV_Belt_14", "=q4=无尽风暴腰带",        "=ds="..AtlasLootBossNames["BlackwingLair"][2],   " 6.93%" },
        { 16946, "INV_Pants_03", "=q4=无尽风暴护腿",       "=ds="..AtlasLootBossNames["MoltenCore"][10], " 5.97%" },
        { 16949, "INV_Boots_Plate_06", "=q4=无尽风暴胫甲", "=ds="..AtlasLootBossNames["BlackwingLair"][3],     " 5.57%" },
        };

    T2Hunter = {
        { 0,"Ability_Hunter_RunningShot","=q6=#t2s2#","" },
        { 16939, "INV_Helmet_05", "=q4=巨龙追猎者头盔",    "=ds="..AtlasLootBossNames["OnyxiasLair"][1], " 13.91%" },
        { 16937, "INV_Shoulder_10", "=q4=巨龙追猎者肩甲",    "=ds="..AtlasLootBossNames["BlackwingLair"][7],   "16.20%" },
        { 16942, "INV_Chest_Chain_03", "=q4=巨龙追猎者胸甲", "=ds="..AtlasLootBossNames["BlackwingLair"][8],   "13.30%" },
        { 16935, "INV_Bracer_17", "=q4=巨龙追猎者护腕",      "=ds="..AtlasLootBossNames["BlackwingLair"][1],       "19.13%" },
        { 16940, "INV_Gauntlets_10", "=q4=巨龙追猎者护手", "=ds="..AtlasLootBossNames["BlackwingLair"][4]..", ".."=ds="..AtlasLootBossNames["BlackwingLair"][5]..", ".."=ds="..AtlasLootBossNames["BlackwingLair"][6],   "6.13%" },
        { 16936, "INV_Belt_28", "=q4=巨龙追猎者腰带",        "=ds="..AtlasLootBossNames["BlackwingLair"][2],   "20.17%" },
        { 16938, "INV_Pants_03", "=q4=巨龙追猎者腿甲",     "=ds="..AtlasLootBossNames["MoltenCore"][10], "16.02%" },
        { 16941, "INV_Boots_Plate_07", "=q4=巨龙追猎者胫甲", "=ds="..AtlasLootBossNames["BlackwingLair"][3],     "17.78%" },
	};

    T2Warrior = {
        { 0,"INV_Shield_05","=q6=#t2s9#","" },
        { 16963, "INV_Helmet_71", "=q4=愤怒头盔",      "=ds="..AtlasLootBossNames["OnyxiasLair"][1], " 13.65%" },
        { 16961, "INV_Shoulder_34", "=q4=愤怒肩铠",    "=ds="..AtlasLootBossNames["BlackwingLair"][7],  "16.83%" },
        { 16966, "INV_Chest_Plate16", "=q4=愤怒胸甲",  "=ds="..AtlasLootBossNames["BlackwingLair"][8],  "15.06%" },
        { 16959, "INV_Bracer_19", "=q4=愤怒护腕",      "=ds="..AtlasLootBossNames["BlackwingLair"][1],      "20.29%" },
        { 16964, "INV_Gauntlets_10", "=q4=愤怒护手",   "=ds="..AtlasLootBossNames["BlackwingLair"][4]..", ".."=ds="..AtlasLootBossNames["BlackwingLair"][5]..", ".."=ds="..AtlasLootBossNames["BlackwingLair"][6],  "5.93%" },
        { 16960, "INV_Belt_09", "=q4=愤怒腰带",        "=ds="..AtlasLootBossNames["BlackwingLair"][2],  "20.03%" },
        { 16962, "INV_Pants_04", "=q4=愤怒腿铠",       "=ds="..AtlasLootBossNames["MoltenCore"][10], "17.23%" },
        { 16965, "INV_Boots_Plate_04", "=q4=愤怒马靴", "=ds="..AtlasLootBossNames["BlackwingLair"][3],    "16.84%" },
        };

    T2Paladin = {
        { 0,"Spell_Holy_SealOfMight","=q6=#t2s4#","" },
        { 16955, "INV_Helmet_74", "=q4=审判头冠",    "=ds="..AtlasLootBossNames["OnyxiasLair"][1], "  8.64%" },
        { 16953, "INV_Shoulder_37", "=q4=审判肩铠",    "=ds="..AtlasLootBossNames["BlackwingLair"][7],  "10.97%" },
        { 16958, "INV_Chest_Plate03", "=q4=审判胸甲",  "=ds="..AtlasLootBossNames["BlackwingLair"][8],  " 9.24%" },
        { 16951, "INV_Bracer_18", "=q4=审判束腕",      "=ds="..AtlasLootBossNames["BlackwingLair"][1],      "13.61%" },
        { 16956, "INV_Gauntlets_29", "=q4=审判护手", "=ds="..AtlasLootBossNames["BlackwingLair"][4]..", ".."=ds="..AtlasLootBossNames["BlackwingLair"][5]..", ".."=ds="..AtlasLootBossNames["BlackwingLair"][6],  "3.58%" },
        { 16952, "INV_Belt_27", "=q4=审判腰带",        "=ds="..AtlasLootBossNames["BlackwingLair"][2],  "12.23%" },
        { 16954, "INV_Pants_04", "=q4=审判腿铠",     "=ds="..AtlasLootBossNames["MoltenCore"][10], "10.81%" },
        { 16957, "INV_Boots_Plate_09", "=q4=审判马靴", "=ds="..AtlasLootBossNames["BlackwingLair"][3],    "11.28%" },
	};
        
    T1Mage = {
        { 0,"Spell_Frost_IceStorm","=q6=#t1s3#","" },
        { 16795, "INV_Helmet_53", "=q4=奥术师头冠",      "=ds="..AtlasLootBossNames["MoltenCore"][4] , "11.31%" },
        { 16797, "INV_Shoulder_02", "=q4=奥术师衬肩",    "=ds="..AtlasLootBossNames["MoltenCore"][6], "19.92%" },
        { 16798, "INV_Chest_Cloth_03", "=q4=奥术师长袍", "=ds="..AtlasLootBossNames["MoltenCore"][7], "16.51%" },
        { 16799, "INV_Belt_29", "=q4=奥术师护腕",        "=ds="..AtlasLootBossNames["Common"][2], "0.16%" },
        { 16801, "INV_Gauntlets_14", "=q4=奥术师手套",   "=ds="..AtlasLootBossNames["MoltenCore"][5], "19.59%" },
        { 16802, "INV_Belt_30", "=q4=奥术师腰带",        "=ds="..AtlasLootBossNames["Common"][2], "0.16%"  },
        { 16796, "INV_Pants_08", "=q4=奥术师护腿",       "=ds="..AtlasLootBossNames["MoltenCore"][2], "14.57%" },
        { 16800, "INV_Boots_07", "=q4=奥术师便鞋",       "=ds="..AtlasLootBossNames["MoltenCore"][1], "12.06%" },
        };

   T1Priest = {
        { 0,"Spell_Holy_PowerWordShield","=q6=#t1s5#","" },
        { 16813, "INV_Helmet_34", "=q4=预言头饰",      "=ds="..AtlasLootBossNames["MoltenCore"][4] , "11.36%" },
        { 16816, "INV_Shoulder_02", "=q4=预言衬肩",    "=ds="..AtlasLootBossNames["MoltenCore"][8], "21.06%" },
        { 16815, "INV_Chest_Cloth_03", "=q4=预言法袍", "=ds="..AtlasLootBossNames["MoltenCore"][7], "15.65%" },
        { 16819, "INV_Bracer_09", "=q4=预言臂甲",      "=ds="..AtlasLootBossNames["Common"][2], "0.16%" },
        { 16812, "INV_Gauntlets_14", "=q4=预言手套",   "=ds="..AtlasLootBossNames["MoltenCore"][3], "18.65%" },
        { 16817, "INV_Belt_22", "=q4=预言束带",        "=ds="..AtlasLootBossNames["Common"][2], "0.18%" },
        { 16814, "INV_Pants_08", "=q4=预言短裤",       "=ds="..AtlasLootBossNames["MoltenCore"][2], "14.33%" },
        { 16811, "INV_Gauntlets_07", "=q4=预言之靴",   "=ds="..AtlasLootBossNames["MoltenCore"][5], "14.90%" },
        };

   T1Warlock = {
        { 0,"Spell_Shadow_CurseOfTounges","=q6=#t1s8#","" },
        { 16808, "INV_Helmet_08", "=q4=恶魔之心角饰",      "=ds="..AtlasLootBossNames["MoltenCore"][4], "10.62%" },
        { 16807, "INV_Shoulder_23", "=q4=恶魔之心护肩",    "=ds="..AtlasLootBossNames["MoltenCore"][6], "19.78%" },
        { 16809, "INV_Chest_Cloth_09", "=q4=恶魔之心长袍", "=ds="..AtlasLootBossNames["MoltenCore"][7], "15.66%" },
        { 16804, "INV_Bracer_07", "=q4=恶魔之心护腕",      "=ds="..AtlasLootBossNames["Common"][2], "0.16%" },
        { 16805, "INV_Gauntlets_19", "=q4=恶魔之心手套",   "=ds="..AtlasLootBossNames["MoltenCore"][1],  "14.89%" },
        { 16806, "INV_Belt_13", "=q4=恶魔之心腰带",        "=ds="..AtlasLootBossNames["Common"][2], "0.19%" },
        { 16810, "INV_Pants_Cloth_14", "=q4=恶魔之心短裤", "=ds="..AtlasLootBossNames["MoltenCore"][2], "13.75%" },
        { 16803, "INV_Boots_Cloth_05", "=q4=恶魔之心便鞋", "=ds="..AtlasLootBossNames["MoltenCore"][5], "15.28%" },
        };

   T1Rogue = {
        { 0,"Ability_BackStab","=q6=#t1s6#","" },
        { 16821, "INV_Helmet_41", "=q4=夜幕杀手头巾",      "=ds="..AtlasLootBossNames["MoltenCore"][4], "10.38%" },
        { 16823, "INV_Shoulder_25", "=q4=夜幕杀手护肩",    "=ds="..AtlasLootBossNames["MoltenCore"][8], "20.66%" },
        { 16820, "INV_Chest_Cloth_07", "=q4=夜幕杀手胸甲", "=ds="..AtlasLootBossNames["MoltenCore"][7], "16.76%" },
        { 16825, "INV_Bracer_02", "=q4=夜幕杀手护腕",      "=ds="..AtlasLootBossNames["Common"][2], "0.17%" },
        { 16826, "INV_Gauntlets_21", "=q4=夜幕杀手手套",   "=ds="..AtlasLootBossNames["MoltenCore"][3], "19.47%" },
        { 16827, "INV_Belt_23", "=q4=夜幕杀手腰带",        "=ds="..AtlasLootBossNames["Common"][2], "0.15%" },
        { 16822, "INV_Pants_06", "=q4=夜幕杀手短裤",       "=ds="..AtlasLootBossNames["MoltenCore"][2], "13.83%" },
        { 16824, "INV_Gauntlets_08", "=q4=夜幕杀手长靴",   "=ds="..AtlasLootBossNames["MoltenCore"][5], "15.58%" },
        };

   T1Druid = {
        { 0,"Spell_Nature_Regeneration","=q6=#t1s1#","" },
        { 16834, "INV_Helmet_09", "=q4=塞纳里奥头盔",        "=ds="..AtlasLootBossNames["MoltenCore"][4], "11.51%" },
        { 16836, "INV_Shoulder_07", "=q4=塞纳里奥肩甲",      "=ds="..AtlasLootBossNames["MoltenCore"][6], "19.52%" },
        { 16833, "INV_Chest_Cloth_06", "=q4=塞纳里奥胸甲",   "=ds="..AtlasLootBossNames["MoltenCore"][7], "15.21%" },
        { 16830, "INV_Bracer_03", "=q4=塞纳里奥护腕",        "=ds="..AtlasLootBossNames["Common"][2], "0.17%" },
        { 16831, "INV_Gauntlets_07", "=q4=塞纳里奥手套",     "=ds="..AtlasLootBossNames["MoltenCore"][5], "19.53%" },
        { 16828, "INV_Belt_06", "=q4=塞纳里奥腰带",          "=ds="..AtlasLootBossNames["Common"][2], "0.16%" },
        { 16835, "INV_Pants_06", "=q4=塞纳里奥护腿",         "=ds="..AtlasLootBossNames["MoltenCore"][2], "12.90%" },
        { 16829, "INV_Boots_08", "=q4=塞纳里奥长靴",         "=ds="..AtlasLootBossNames["MoltenCore"][1], "10.72%" },
        };

   T1Shaman = {
        { 0,"Spell_FireResistanceTotem_01","=q6=#t1s7#","" },
        { 16842, "INV_Helmet_09", "=q4=大地之怒头盔",      "=ds="..AtlasLootBossNames["MoltenCore"][4], " 3.91%" },
        { 16844, "INV_Shoulder_29", "=q4=大地之怒肩饰",    "=ds="..AtlasLootBossNames["MoltenCore"][6], " 7.29%" },
        { 16841, "INV_Chest_Chain_11", "=q4=大地之怒外衣", "=ds="..AtlasLootBossNames["MoltenCore"][7], " 6.08%" },
        { 16840, "INV_Bracer_16", "=q4=大地之怒护腕",      "=ds="..AtlasLootBossNames["Common"][2], "0.06%" },
        { 16839, "INV_Gauntlets_11", "=q4=大地之怒护手",   "=ds="..AtlasLootBossNames["MoltenCore"][3], " 7.38%" },
        { 16838, "INV_Belt_14", "=q4=大地之怒腰带",        "=ds="..AtlasLootBossNames["Common"][2], "0.07%" },
        { 16843, "INV_Pants_03", "=q4=大地之怒腿甲",       "=ds="..AtlasLootBossNames["MoltenCore"][2], " 4.73%" },
        { 16837, "INV_Boots_Plate_06", "=q4=大地之怒长靴", "=ds="..AtlasLootBossNames["MoltenCore"][1], " 4.16%" },
        };

   T1Hunter = {
        { 0,"Ability_Hunter_RunningShot","=q6=#t1s2#","" },
        { 16846, "INV_Helmet_05", "=q4=巨人追猎者头盔",        "=ds="..AtlasLootBossNames["MoltenCore"][4], "11.57%" },
        { 16848, "INV_Shoulder_10", "=q4=巨人追猎者肩饰",      "=ds="..AtlasLootBossNames["MoltenCore"][8], "19.64%" },
        { 16845, "INV_Chest_Chain_03", "=q4=巨人追猎者胸甲",   "=ds="..AtlasLootBossNames["MoltenCore"][7], "15.83%" },
        { 16850, "INV_Bracer_17", "=q4=巨人追猎者护腕",        "=ds="..AtlasLootBossNames["Common"][2], "0.18%" },
        { 16852, "INV_Gauntlets_10", "=q4=巨人追猎者手套",     "=ds="..AtlasLootBossNames["MoltenCore"][5], "18.58%" },
        { 16851, "INV_Belt_28", "=q4=巨人追猎者腰带",          "=ds="..AtlasLootBossNames["Common"][2], "0.17%" },
        { 16847, "INV_Pants_Mail_03", "=q4=巨人追猎者护腿",    "=ds="..AtlasLootBossNames["MoltenCore"][2], "13.28%" },
        { 16849, "INV_Boots_Chain_13", "=q4=巨人追猎者长靴",   "=ds="..AtlasLootBossNames["MoltenCore"][3], "14.54%" },
        };

   T1Warrior = {
        { 0,"INV_Shield_05","=q6=#t1s9#","" },
        { 16866, "INV_Helmet_09", "=q4=力量头盔",      "=ds="..AtlasLootBossNames["MoltenCore"][4], "11.39%" },
        { 16868, "INV_Shoulder_15", "=q4=力量肩铠",    "=ds="..AtlasLootBossNames["MoltenCore"][8], "21.14%" },
        { 16865, "INV_Chest_Plate16", "=q4=力量胸甲",  "=ds="..AtlasLootBossNames["MoltenCore"][7], "15.28%" },
        { 16861, "INV_Bracer_19", "=q4=力量护腕",      "=ds="..AtlasLootBossNames["Common"][2], "0.16%" },
        { 16863, "INV_Gauntlets_10", "=q4=力量护手",   "=ds="..AtlasLootBossNames["MoltenCore"][1],  "16.40%" },
        { 16864, "INV_Belt_09", "=q4=力量腰带",        "=ds="..AtlasLootBossNames["Common"][2], "0.16%" },
        { 16867, "INV_Pants_04", "=q4=力量腿铠",       "=ds="..AtlasLootBossNames["MoltenCore"][2], "13.97%" },
        { 16862, "INV_Boots_Plate_04", "=q4=力量马靴", "=ds="..AtlasLootBossNames["MoltenCore"][3], "14.48%" },
        };


   T1Paladin = {
        { 0,"Spell_Holy_SealOfMight","=q6=#t1s4#","" },
        { 16854, "INV_Helmet_05", "=q4=秩序之源头盔",      "=ds="..AtlasLootBossNames["MoltenCore"][4], " 7.23%" },
        { 16856, "INV_Shoulder_20", "=q4=秩序之源肩铠",    "=ds="..AtlasLootBossNames["MoltenCore"][6], "12.62%" },
        { 16853, "INV_Chest_Plate03", "=q4=秩序之源胸甲",  "=ds="..AtlasLootBossNames["MoltenCore"][7], " 9.53%" },
        { 16857, "INV_Bracer_18", "=q4=秩序之源护腕",      "=ds="..AtlasLootBossNames["Common"][2], "0.11%" },
        { 16860, "INV_Gauntlets_29", "=q4=秩序之源护手",   "=ds="..AtlasLootBossNames["MoltenCore"][3], "11.77%" },
        { 16858, "INV_Belt_27", "=q4=秩序之源腰带",        "=ds="..AtlasLootBossNames["Common"][2], "0.10%" },
        { 16855, "INV_Pants_04", "=q4=秩序之源腿铠",       "=ds="..AtlasLootBossNames["MoltenCore"][2], " 8.54%" },
        { 16859, "INV_Boots_Plate_09", "=q4=秩序之源战靴", "=ds="..AtlasLootBossNames["MoltenCore"][1], " 7.20%" },
	};
        
    T0Mage = {
        { 0,"Spell_Frost_IceStorm", "=q6=#t0s3#", "" },
        { 16686, "INV_Crown_02", "=q3=博学者头冠",        "=ds="..AtlasLootBossNames["Scholomance"][16], "8.60%" },
        { 16689, "INV_Shoulder_23", "=q3=博学者衬肩",     "=ds="..AtlasLootBossNames["Scholomance"][8], "11.93%" },
        { 16688,"INV_Chest_Cloth_25","=q3=博学者长袍",    "=ds="..AtlasLootBossNames["BlackrockSpireUpper"][10], "7.24%" },
        { 16683, "INV_Jewelry_Ring_23", "=q3=博学者腕轮", "=ds="..AtlasLootBossNames["BlackrockSpireLower"][15], "1.19%" },
        { 16684, "INV_Gauntlets_17", "=q3=博学者手套",    "=ds="..AtlasLootBossNames["Scholomance"][11], "9.75%" },
        { 16685, "INV_Belt_08", "=q3=博学者腰带",         "=ds="..AtlasLootBossNames["Common"][1], "1.32%" },
        { 16687, "INV_Pants_06", "=q3=博学者护腿",        "=ds="..AtlasLootBossNames["Stratholme"][18], "6.79%" },
        { 16682, "INV_Boots_02", "=q3=博学者长靴",        "=ds="..AtlasLootBossNames["Stratholme"][4], "10.86%" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0,"Spell_Frost_IceStorm", "=q6=#t05s3#", "" },
        { 22065, "INV_Crown_02", "=q4=巫师头冠",        "" },
        { 22068, "INV_Shoulder_23", "=q3=巫师衬肩",     "" },
        { 22069, "INV_Chest_Cloth_25","=q4=巫师长袍",   "" },
        { 22063, "INV_Jewelry_Ring_23", "=q3=巫师护腕", "" },
        { 22066, "INV_Gauntlets_17", "=q4=巫师手套",    "" },
        { 22062, "INV_Belt_08", "=q3=巫师腰带",         "" },
        { 22067, "INV_Pants_06", "=q3=巫师护腿 ",       "" },
        { 22064, "INV_Boots_02", "=q4=巫师软靴 ",       "" },
        };

    T0Priest = {
        { 0,"Spell_Holy_PowerWordShield","=q6=#t0s5#","" },
        { 16693, "INV_Crown_01", "=q3=虔诚头冠",     "=ds="..AtlasLootBossNames["Scholomance"][16], "7.89%" },
        { 16695, "INV_Shoulder_02", "=q3=虔诚衬肩",  "=ds="..AtlasLootBossNames["BlackrockSpireUpper"][2], "12.84%" },
        { 16690,"INV_Chest_Cloth_11","=q3=虔诚长袍", "=ds="..AtlasLootBossNames["BlackrockSpireUpper"][10], "6.20%" },
        { 16697, "INV_Belt_31", "=q3=虔诚护腕",      "=ds="..AtlasLootBossNames["Stratholme"][19], "1.13%" },
        { 16692, "INV_Gauntlets_14", "=q3=虔诚护手", "=ds="..AtlasLootBossNames["Stratholme"][8], "12.46%" },
        { 16696, "INV_Belt_10", "=q3=虔诚腰带",      "=ds="..AtlasLootBossNames["Common"][1], "2.07%" },
        { 16694, "INV_Pants_08", "=q3=虔诚长裙",     "=ds="..AtlasLootBossNames["Stratholme"][18], "7.42%" },
        { 16691, "INV_Boots_05", "=q3=虔诚软鞋",     "=ds="..AtlasLootBossNames["Stratholme"][15], "13.64%" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0,"Spell_Holy_PowerWordShield","=q6=#t05s5#","" },
        { 22080, "INV_Crown_01", "=q4=坚贞头冠",     "" },
        { 22082, "INV_Shoulder_02", "=q3=坚贞衬肩",  "" },
        { 22083,"INV_Chest_Cloth_11","=q4=坚贞长袍", "" },
        { 22079, "INV_Belt_31", "=q3=坚贞护腕",      "" },
        { 22081, "INV_Gauntlets_14", "=q4=坚贞手套", "" },
        { 22078, "INV_Belt_10", "=q3=坚贞腰带",      "" },
        { 22085, "INV_Pants_08", "=q3=坚贞长裙 ",    "" },
        { 22084, "INV_Boots_05", "=q4=坚贞便鞋",     "" },
        };

    T0Warlock = {
        { 0,"Spell_Shadow_CurseOfTounges","=q6=#t0s8#","" },
        { 16698, "INV_Helmet_29", "=q3=鬼雾面具",               "=ds="..AtlasLootBossNames["Scholomance"][16], "8.78%" },
        { 16701, "INV_Misc_Bone_TaurenSkull_01","=q3=鬼雾衬肩", "=ds="..AtlasLootBossNames["Scholomance"][3], "12.20%" },
        { 16700,"INV_Chest_Cloth_49","=q3=鬼雾长袍",            "=ds="..AtlasLootBossNames["BlackrockSpireUpper"][10], "8.04%" },
        { 16703, "INV_Bracer_13", "=q3=鬼雾护腕",               "=ds="..AtlasLootBossNames["Common"][1], "1.68%" },
        { 16705, "INV_Gauntlets_32", "=q3=鬼雾手套",            "=ds="..AtlasLootBossNames["Scholomance"][12], "14.54%" },
        { 16702, "INV_Belt_12", "=q3=鬼雾腰带",                 "=ds="..AtlasLootBossNames["Stratholme"][19], "1.03%" },
        { 16699, "INV_Pants_08", "=q3=鬼雾护腿",                "=ds="..AtlasLootBossNames["Stratholme"][18], "7.31%" },
        { 16704, "INV_Boots_05", "=q3=鬼雾便鞋",                "=ds="..AtlasLootBossNames["Stratholme"][13], "13.16%" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0,"Spell_Shadow_CurseOfTounges","=q6=#t05s8#","" },
        { 22074, "INV_Helmet_29", "=q4=死雾面具",                "" },
        { 22073, "INV_Misc_Bone_TaurenSkull_01", "=q3=死雾衬肩", "" },
        { 22075,"INV_Chest_Cloth_49","=q4=死雾长袍",             "" },
        { 22071, "INV_Bracer_13", "=q3=死雾护腕",                "" },
        { 22077, "INV_Gauntlets_32", "=q4=死雾裹手",             "" },
        { 22070, "INV_Belt_12", "=q3=死雾腰带",                  "" },
        { 22072, "INV_Pants_08", "=q3=死雾护腿",                 "" },
        { 22076, "INV_Boots_05", "=q4=死雾便鞋",                 "" },
        };

    T0Rogue = {
        { 0,"Ability_BackStab","=q6=#t0s6#","" },
        { 16707, "INV_Helmet_41", "=q3=迅影罩帽",       "=ds="..AtlasLootBossNames["Scholomance"][16], "6.65%" },
        { 16708, "INV_Shoulder_07", "=q3=迅影肩甲",     "=ds="..AtlasLootBossNames["Stratholme"][7], "10.68%" },
        { 16721,"INV_Chest_Leather_07","=q3=迅影外套",  "=ds="..AtlasLootBossNames["BlackrockSpireUpper"][10], "6.09%" },
        { 16710, "INV_Bracer_07", "=q3=迅影护腕",       "=ds="..AtlasLootBossNames["Scholomance"][17], "3.51%" },
        { 16712, "INV_Gauntlets_24", "=q3=迅影手套",    "=ds="..AtlasLootBossNames["BlackrockSpireLower"][3], "11.89%" },
        { 16713, "INV_Belt_03", "=q3=迅影腰带",         "=ds="..AtlasLootBossNames["Common"][1], "1.05%" },
        { 16709, "INV_Pants_02", "=q3=迅影短裤",        "=ds="..AtlasLootBossNames["Stratholme"][18], "7.76%" },
        { 16711, "INV_Boots_08", "=q3=迅影长靴",        "=ds="..AtlasLootBossNames["Scholomance"][4], "14.32%" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0,"Ability_BackStab","=q6=#t05s6#","" },
        { 22005, "INV_Helmet_41", "=q4=暗幕皮帽",       "" },
        { 22008, "INV_Shoulder_07", "=q3=暗幕肩甲",     "" },
        { 22009,"INV_Chest_Leather_07","=q4=暗幕外套",  "" },
        { 22004, "INV_Bracer_07", "=q3=暗幕护腕",       "" },
        { 22006, "INV_Gauntlets_24", "=q4=暗幕手套",    "" },
        { 22002, "INV_Belt_03", "=q3=暗幕腰带",         "" },
        { 22007, "INV_Pants_02", "=q3=暗幕短裤",        "" },
        { 22003, "INV_Boots_08", "=q4=暗幕长靴",        "" },
        };

    T0Druid = {
        { 0,"Spell_Nature_Regeneration","=q6=#t0s1#","" },
        { 16720, "INV_Helmet_27", "=q3=野性之心兜帽",    "=ds="..AtlasLootBossNames["Scholomance"][16], "7.09%" },
        { 16718, "INV_Shoulder_01", "=q3=野性之心肩甲",  "=ds="..AtlasLootBossNames["BlackrockSpireLower"][10], "11.04%" },
        { 16706,"INV_Chest_Plate06","=q3=野性之心外衣",  "=ds="..AtlasLootBossNames["BlackrockSpireUpper"][10], "7.36%" },
        { 16714, "INV_Bracer_09", "=q3=野性之心护腕",    "=ds="..AtlasLootBossNames["Stratholme"][19], "1.85%" },
        { 16717, "INV_Gauntlets_17", "=q3=野性之心手套", "=ds="..AtlasLootBossNames["Stratholme"][5], "12.61%" },
        { 16716, "INV_Belt_15", "=q3=野性之心腰带",      "=ds="..AtlasLootBossNames["Scholomance"][17], "2.60%" },
        { 16719, "INV_Pants_08", "=q3=野性之心褶裙",     "=ds="..AtlasLootBossNames["Stratholme"][18], "6.58%" },
        { 16715, "INV_Boots_08", "=q3=野性之心长靴",     "=ds="..AtlasLootBossNames["BlackrockSpireLower"][6], "13.03%" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0,"Spell_Nature_Regeneration","=q6=#t05s1#","" },
        { 22109, "INV_Helmet_27", "=q4=狂野之心罩帽",    "" },
        { 22112, "INV_Shoulder_01", "=q3=狂野之心肩甲",  "" },
        { 22113,"INV_Chest_Plate06","=q4=狂野之心外套",  "" },
        { 22108, "INV_Bracer_09", "=q3=狂野之心护腕",    "" },
        { 22110, "INV_Gauntlets_17", "=q4=狂野之心手套", "" },
        { 22106, "INV_Belt_15", "=q3=狂野之心腰带",      "" },
        { 22111, "INV_Pants_08", "=q3=狂野之心褶裙",     "" },
        { 22107, "INV_Boots_08", "=q4=狂野之心长靴",     "" },
        };

    T0Shaman = {
        { 0,"Spell_FireResistanceTotem_01","=q6=#t0s7#","" },
        { 16667, "INV_Helmet_04", "=q3=元素罩帽",    "=ds="..AtlasLootBossNames["Scholomance"][16], "2.86%" },
        { 16669,"INV_Shoulder_29","=q3=元素护肩",    "=ds="..AtlasLootBossNames["BlackrockSpireUpper"][7], "14.77%" },
        { 16666,"INV_Chest_Chain_11","=q3=元素外衣", "=ds="..AtlasLootBossNames["BlackrockSpireUpper"][10], "3.03%" },
        { 16671, "INV_Bracer_02", "=q3=元素腕轮",    "=ds="..AtlasLootBossNames["Stratholme"][19], "1.59%" },
        { 16672,"INV_Gauntlets_11","=q3=元素护手",   "=ds="..AtlasLootBossNames["BlackrockSpireUpper"][1], "14.23%" },
        { 16673, "INV_Belt_16", "=q3=元素束腰",      "=ds="..AtlasLootBossNames["Common"][1], "1.06%" },
        { 16668, "INV_Pants_03", "=q3=元素护腿",     "=ds="..AtlasLootBossNames["Stratholme"][18], "3.02%" },
        { 16670, "INV_Boots_Wolf", "=q3=元素长靴",   "=ds="..AtlasLootBossNames["BlackrockSpireLower"][1], "9.35%" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0,"Spell_FireResistanceTotem_01","=q6=#t05s7#","" },
        { 22097, "INV_Helmet_04", "=q4=五雷罩帽",    "" },
        { 22101,"INV_Shoulder_29","=q3=五雷肩甲",    "" },
        { 22102,"INV_Chest_Chain_11","=q4=五雷外套", "" },
        { 22095, "INV_Bracer_02", "=q3=五雷护腕",    "" },
        { 22099,"INV_Gauntlets_11","=q4=五雷护手",   "" },
        { 22098, "INV_Belt_16", "=q3=五雷腰带",      "" },
        { 22100, "INV_Pants_03", "=q3=五雷褶裙",     "" },
        { 22096, "INV_Boots_Wolf", "=q4=五雷长靴",   "" },
        };

    T0Hunter = {
       { 0,"Ability_Hunter_RunningShot","=q6=#t0s2#","" },
       { 16677, "INV_Helmet_24", "=q3=野兽追猎者之帽",      "=ds="..AtlasLootBossNames["Scholomance"][16], "7.00%" },
       { 16679, "INV_Shoulder_10", "=q3=野兽追猎者衬肩",    "=ds="..AtlasLootBossNames["BlackrockSpireLower"][12], "9.89%" },
       { 16674, "INV_Chest_Chain_03","=q3=野兽追猎者外套",  "=ds="..AtlasLootBossNames["BlackrockSpireUpper"][10],   "6.81%" },
       { 16681, "INV_Bracer_17", "=q3=野兽追猎者护腕",      "=ds="..AtlasLootBossNames["Stratholme"][19], "1.64%" },
       { 16676, "INV_Gauntlets_10", "=q3=野兽追猎者手套",   "=ds="..AtlasLootBossNames["BlackrockSpireLower"][4], "9.15%" },
       { 16680, "INV_Belt_28", "=q3=野兽追猎者腰带",        "=ds="..AtlasLootBossNames["Common"][1], "1.36%" },
       { 16678, "INV_Pants_03", "=q3=野兽追猎者短裤",       "=ds="..AtlasLootBossNames["Stratholme"][18], "6.16%" },
       { 16675, "INV_Boots_Plate_07", "=q3=野兽追猎者长靴", "=ds="..AtlasLootBossNames["Stratholme"][14], "13.62%" },
       { 0, "", "", "" },
       { 0, "", "", "" },
       { 0, "", "", "" },
       { 0, "", "", "" },
       { 0, "", "", "" },
       { 0, "", "", "" },
       { 0,"Ability_Hunter_RunningShot","=q6=#t05s2#","" },
       { 22013, "INV_Helmet_24", "=q4=兽王罩帽",      "" },
       { 22016, "INV_Shoulder_10", "=q3=兽王护肩",    "" },
       { 22060, "INV_Chest_Chain_03","=q4=兽王外套",  "" },
       { 22011, "INV_Bracer_17", "=q3=兽王护腕",      "" },
       { 22015, "INV_Gauntlets_10", "=q4=兽王手套",   "" },
       { 22010, "INV_Belt_28", "=q3=兽王腰带",        "" },
       { 22017, "INV_Pants_03", "=q3=兽王短裤",       "" },
       { 22061, "INV_Boots_Plate_07", "=q4=兽王长靴", "" },
       };

    T0Warrior = {
        { 0,"INV_Shield_05","=q6=#t0s9#","" },
        { 16731, "INV_Helmet_02", "=q3=勇气头盔",      "=ds="..AtlasLootBossNames["Scholomance"][16], "6.54%" },
        { 16733,"INV_Shoulder_30","=q3=勇气肩甲",      "=ds="..AtlasLootBossNames["BlackrockSpireUpper"][6], "13.39%" },
        { 16730,"INV_Chest_Plate03","=q3=勇气胸甲",    "=ds="..AtlasLootBossNames["BlackrockSpireUpper"][10], "5.83%" },
        { 16735, "INV_Bracer_18", "=q3=勇气护腕",      "=ds="..AtlasLootBossNames["Common"][1], "1.49%" },
        { 16737, "INV_Gauntlets_26", "=q3=勇气护手",   "=ds="..AtlasLootBossNames["Stratholme"][17], "9.58%" },
        { 16736, "INV_Belt_34", "=q3=勇气腰带",        "=ds="..AtlasLootBossNames["Common"][1], "1.96%" },
        { 16732, "INV_Pants_04", "=q3=勇气腿铠",       "=ds="..AtlasLootBossNames["Stratholme"][18], "5.74%" },
        { 16734, "INV_Boots_Plate_03", "=q3=勇气战靴", "=ds="..AtlasLootBossNames["Scholomance"][2], "11.12%" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0,"INV_Shield_05","=q6=#t05s9#","" },
        { 21999, "INV_Helmet_02", "=q4=英勇头盔",      "" },
        { 22001,"INV_Shoulder_30","=q3=英勇肩铠",      "" },
        { 21997,"INV_Chest_Plate03","=q4=英勇胸甲",    "" },
        { 21996, "INV_Bracer_18", "=q3=英勇护腕",      "" },
        { 21998, "INV_Gauntlets_26", "=q4=英勇护手",   "" },
        { 21994, "INV_Belt_34", "=q3=英勇腰带",        "" },
        { 22000, "INV_Pants_04", "=q3=英勇腿铠",       "" },
        { 21995, "INV_Boots_Plate_03", "=q4=英勇长靴", "" },
        };

    T0Paladin = {
        { 0,"Spell_Holy_SealOfMight","=q6=#t0s4#","" },
        { 16727, "INV_Helmet_08", "=q3=光铸头盔",      "=ds="..AtlasLootBossNames["Scholomance"][16], "5.32%" },
        { 16729,"INV_Shoulder_10","=q3=光铸肩铠",      "=ds="..AtlasLootBossNames["BlackrockSpireUpper"][8], "13.62%" },
        { 16726,"INV_Chest_Plate03","=q3=光铸胸甲",    "=ds="..AtlasLootBossNames["BlackrockSpireUpper"][10], "3.76%" },
        { 16722, "INV_Bracer_14", "=q3=光铸护腕",      "=ds="..AtlasLootBossNames["Scholomance"][17], "3.37%" },
        { 16724, "INV_Gauntlets_19", "=q3=光铸护手",   "=ds="..AtlasLootBossNames["Stratholme"][6], "10.42%" },
        { 16723, "INV_Belt_11", "=q3=光铸腰带",        "=ds="..AtlasLootBossNames["Stratholme"][19], "1.93%" },
        { 16728, "INV_Pants_04", "=q3=光铸腿铠",       "=ds="..AtlasLootBossNames["Stratholme"][18], "4.20%" },
        { 16725, "INV_Boots_Plate_03", "=q3=光铸战靴", "=ds="..AtlasLootBossNames["Stratholme"][9], "11.11%" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0,"Spell_Holy_SealOfMight","=q6=#t05s4#","" },
        { 22091, "INV_Helmet_08", "=q4=魂铸头盔",      "" },
        { 22093, "INV_Shoulder_10","=q3=魂铸肩铠",     "" },
        { 22089, "INV_Chest_Plate03","=q4=魂铸胸甲",   "" },
        { 22088, "INV_Bracer_14", "=q3=魂铸护腕",      "" },
        { 22090, "INV_Gauntlets_19", "=q4=魂铸护手",   "" },
        { 22086, "INV_Belt_11", "=q3=魂铸腰带",        "" },
        { 22092, "INV_Pants_04", "=q3=魂铸腿甲",       "" },
        { 22087, "INV_Boots_Plate_03", "=q4=魂铸战靴", "" },
        };
        
  ZGMage = {
       { 0,"Spell_Frost_IceStorm","=q6=#zgs3#","" },
       { 19601, "INV_Jewelry_Necklace_26", "=q4=卡亚罗的珠宝", "任务奖励" },
       { 19959, "INV_Jewelry_Necklace_19", "=q4=哈扎拉尔的魔法护符", "=ds=需要声望:   =q5=崇拜" },
       { 20034, "INV_Chest_Cloth_12",      "=q4=赞达拉幻术师长袍",   "=q4=[原始哈卡莱套索]   =q4=崇敬" },
       { 19845, "INV_Shoulder_17",         "=q4=赞达拉幻术师衬肩",   "=q4=[原始哈卡莱披肩]   =q3=尊敬" },
       { 19846, "INV_Bracer_07",           "=q4=赞达拉幻术师裹布",   "=q4=[原始哈卡莱护腕]   =q2=友善" },
       }; 
   
  ZGWarlock = {
       { 0,"Spell_Shadow_CurseOfTounges","=q6=#zgs8#","" },
       { 19605, "INV_Jewelry_Necklace_26", "=q4=科赞的强力玷污", "任务奖励" },
       { 19957, "INV_Jewelry_Necklace_19", "=q4=哈扎拉尔的毁灭护符", "=ds=需要声望:=q5=崇拜" },
       { 20033, "INV_Chest_Cloth_12",      "=q4=赞达拉恶魔师长袍",   "=q4=[原始哈卡莱套索]   =q4=崇敬" },
       { 19849, "INV_Shoulder_17",         "=q4=赞达拉恶魔师衬肩",   "=q4=[原始哈卡莱腰带]   =q3=尊敬" },
       { 19848, "INV_Bracer_07",           "=q4=赞达拉恶魔师裹带",   "=q4=[原始哈卡莱直柱]   =q2=友善" },
       };
	 
  ZGPriest = {
       { 0,"Spell_Holy_PowerWordShield","=q6=#zgs5#","" },
       { 19594, "INV_Jewelry_Necklace_26", "=q4=祖达萨全视之眼", "任务奖励" },
       { 19958, "INV_Jewelry_Necklace_19", "=q4=哈扎拉尔的治疗护符", "=ds=需要声望:=q5=崇拜" },
       { 19841, "INV_Shoulder_01",         "=q4=赞达拉忏悔者衬肩",   "=q4=[原始哈卡莱之盾]   =q4=崇敬" },
       { 19842, "INV_Belt_08",             "=q4=赞达拉忏悔者腰带",   "=q4=[原始哈卡莱腰带]   =q3=尊敬" },
       { 19843, "INV_Bracer_07",           "=q4=赞达拉忏悔者裹布",   "=q4=[原始哈卡莱直柱]   =q2=友善" },
        };
    
  ZGRogue = {
       { 0,"Ability_BackStab","=q6=#zgs6#","" },
       { 19617, "INV_Jewelry_Necklace_26", "=q4=赞达拉暗影大师坠饰", "任务奖励" },
       { 19954, "INV_Jewelry_Necklace_19", "=q4=雷塔纳基的狡诈护符", "=ds=需要声望:=q5=崇拜" },
       { 19834, "INV_Chest_Leather_10",    "=q4=赞达拉狂妄者外套",   "=q4=[原始哈卡莱之盾]   =q4=崇敬" },
       { 19835, "INV_Shoulder_29",         "=q4=赞达拉狂妄者衬肩",   "=q4=[原始哈卡莱束带]   =q3=尊敬" },
       { 19836, "INV_Bracer_14",           "=q4=赞达拉狂妄者护腕",   "=q4=[原始哈卡莱护臂]   =q2=友善" },
       };

  ZGDruid = {
       { 0,"Spell_Nature_Regeneration","=q6=#zgs1#","" },
       { 19613, "INV_Jewelry_Necklace_26", "=q4=原始南海魔化海藻", "任务奖励" },
       { 19955, "INV_Jewelry_Necklace_19", "=q4=乌苏雷的自然护符",   "=ds=需要声望:=q5=崇拜" },
       { 19838, "INV_Chest_Leather_06",    "=q4=赞达拉占卜师外套",   "=q4=[原始哈卡莱徽章]   =q4=崇敬" },
       { 19839, "INV_Belt_01",             "=q4=赞达拉占卜师腰带",   "=q4=[原始哈卡莱腰带]   =q3=尊敬" },
       { 19840, "INV_Bracer_08",           "=q4=赞达拉占卜师护腕",   "=q4=[原始哈卡莱直柱]   =q2=友善" },
       }; 
   
  ZGHunter = {
       { 0,"Ability_Hunter_RunningShot","=q6=#zgs2#","" },
    	 { 19621, "INV_Jewelry_Necklace_26", "=q4=漩涡之怒", "任务奖励" },
       { 19953, "INV_Jewelry_Necklace_19", "=q4=雷纳塔基的野兽护符", "=ds=需要声望:=q5=崇拜" },
       { 19831, "INV_Shoulder_22",         "=q4=赞达拉捕猎者衬肩",   "=q4=[原始哈卡莱之盾]   =q4=崇敬" },
    	 { 19832, "INV_Belt_19",             "=q4=赞达拉捕猎者腰带",   "=q4=[原始哈卡莱披肩]   =q3=尊敬" },
    	 { 19833, "INV_Bracer_18",           "=q4=赞达拉捕猎者护腕",   "=q4=[原始哈卡莱护腕]   =q2=友善" },
        };
  
  ZGShaman = {
       { 0,"Spell_FireResistanceTotem_01","=q6=#zgs7#","" },
       { 19609, "INV_Jewelry_Necklace_26", "=q4=完美巫毒幻象", "任务奖励" },
       { 19956, "INV_Jewelry_Necklace_19", "=q4=乌苏雷的灵魂护符",   "=ds=需要声望:=q5=崇拜" },
       { 19828, "INV_Chest_Fur",           "=q4=赞达拉预言者外套",   "=q4=[原始哈卡莱徽章]   =q4=崇敬" },
       { 19829, "INV_Belt_19",             "=q4=赞达拉预言者腰带",   "=q4=[原始哈卡莱束带]   =q3=尊敬" },
       { 19830, "INV_Bracer_15",           "=q4=赞达拉预言者护腕",   "=q4=[原始哈卡莱护臂]   =q2=友善" },
        };
    
  ZGWarrior = {
       { 0,"INV_Shield_05","=q6=#zgs9#","" },
       { 19577, "INV_Jewelry_Necklace_26", "=q4=穆贾巴之怒","任务奖励" },
       { 19951, "INV_Jewelry_Necklace_19", "=q4=格里雷克的力量护符", "=ds=需要声望:=q5=崇拜" },
       { 19822, "INV_Chest_Plate07",       "=q4=赞达拉辩护者胸甲",   "=q4=[原始哈卡莱套索]   =q4=崇敬" },
       { 19823, "INV_Belt_32",             "=q4=赞达拉辩护者腰带",   "=q4=[原始哈卡莱束带]   =q3=尊敬" },
       { 19824, "INV_Bracer_14",           "=q4=赞达拉辩护者护臂",   "=q4=[原始哈卡莱护臂]   =q2=友善" },
       };           
     
  ZGPaladin = {
       { 0,"Spell_Holy_SealOfMight","=q6=#zgs4#","" },
       { 19588, "INV_Jewelry_Necklace_26", "=q4=英雄的烙印",         "任务奖励" },
       { 19952, "INV_Jewelry_Necklace_19", "=q4=格里雷克的勇气护符", "=ds=需要声望:=q5=崇拜" },
       { 19825, "INV_Chest_Plate07",       "=q4=赞达拉思考者胸甲",   "=q4=[原始哈卡莱徽章]   =q4=崇敬" },
       { 19826, "INV_Belt_32",             "=q4=赞达拉思考者腰带",   "=q4=[原始哈卡莱披肩]   =q3=尊敬" },
       { 19827, "INV_Bracer_14",           "=q4=赞达拉思考者护臂",   "=q4=[原始哈卡莱护腕]   =q2=友善" },
       };
        
   AQ20Mage = {
        { 0,"Spell_Frost_IceStorm","=q6=#aq20s3#","" },
        { 21413, "INV_Sword_57",                 "=q4=魔法秘密之刃", " =q4=[其拉装饰刀柄]     =q5=崇拜" },
        { 21415, "INV_Misc_Cape_19",             "=q4=魔法秘密披风", " =q3=[其拉军用披风]     =q4=崇敬" },
        { 21414, "INV_Jewelry_Ring_AhnQiraj_03", "=q4=魔法秘密之戒", " =q3=[其拉将领戒指]     =q3=尊敬" },
        };
   
   AQ20Warlock = {
        { 0,"Spell_Shadow_CurseOfTounges","=q6=#aq20s8#","" },
        { 21416, "INV_Weapon_ShortBlade_27",     "=q4=禁断邪语短剑", " =q4=[其拉装饰刀柄]     =q5=崇拜" },
        { 21418, "INV_Misc_Cape_20",             "=q4=禁断邪语披风", " =q3=[其拉帝王披风]     =q4=崇敬" },
        { 21417, "INV_Jewelry_Ring_AhnQiraj_03", "=q4=禁断邪语之戒", " =q3=[其拉典礼戒指]     =q3=尊敬" },
        };
   
   AQ20Priest = {
        { 0,"Spell_Holy_PowerWordShield","=q6=#aq20s5#","" },
        { 21410, "INV_Mace22",                   "=q4=无尽智慧之锤", " =q4=[其拉装饰刀柄]     =q5=崇拜" },
        { 21412, "INV_Misc_Cape_16",             "=q4=无尽智慧披风", " =q3=[其拉军用披风]     =q4=崇敬" },
        { 21411, "INV_Jewelry_Ring_AhnQiraj_03", "=q4=无尽智慧之戒", " =q3=[其拉典礼戒指]     =q3=尊敬" },
        };
   
   AQ20Rogue = {
        { 0,"Ability_BackStab","=q6=#aq20s6#","" },
        { 21404, "INV_Weapon_ShortBlade_27",     "=q4=笼罩阴影之镰", " =q4=[其拉尖刺刀柄]     =q5=崇拜" },
        { 21406, "INV_Misc_Cape_19",             "=q4=笼罩阴影披风", " =q3=[其拉军用披风]     =q4=崇敬" },
        { 21405, "INV_Jewelry_Ring_AhnQiraj_03", "=q4=笼罩阴影之戒", " =q3=[其拉典礼戒指]     =q3=尊敬" },
        };
    
   AQ20Druid = {
        { 0,"Spell_Nature_Regeneration","=q6=#aq20s1#","" },
        { 21407, "INV_Mace22",                   "=q4=不灭生命之锤", " =q4=[其拉装饰刀柄]     =q5=崇拜" },
        { 21409, "INV_Misc_Cape_15",             "=q4=不灭生命披风", " =q3=[其拉帝王披风]     =q4=崇敬" },
        { 21408, "INV_Jewelry_Ring_AhnQiraj_03", "=q4=不灭生命之戒", " =q3=[其拉将领戒指]     =q3=尊敬" },        
        };

   AQ20Hunter = {
        { 0,"Ability_Hunter_RunningShot","=q6=#aq20s2#","" },
        { 21401, "INV_Axe_15",                   "=q4=隐秘通途之镰", " =q4=[其拉尖刺刀柄]     =q5=崇拜" },
        { 21403, "INV_Misc_Cape_15",             "=q4=隐秘通途披风", " =q3=[其拉帝王披风]     =q4=崇敬" },
        { 21402, "INV_Jewelry_Ring_AhnQiraj_03", "=q4=隐秘通途之戒", " =q3=[其拉典礼戒指]    =q3=尊敬" },
        };
        
   AQ20Paladin = {
        { 0,"Spell_Holy_SealOfMight","=q6=#aq20s4#","" },
        { 21395, "INV_Sword_57",                 "=q4=永恒公正长剑", " =q4=[其拉尖刺刀柄]     =q5=崇拜" },
        { 21397, "INV_Misc_Cape_14",             "=q4=永恒公正斗篷", " =q3=[其拉帝王披风]     =q4=崇敬" },
        { 21396, "INV_Jewelry_Ring_AhnQiraj_03", "=q4=永恒公正之戒", " =q3=[其拉将领戒指]     =q3=尊敬" },
        };
    
   AQ20Shaman = {
        { 0,"Spell_FireResistanceTotem_01","=q6=#aq20s7#","" },
        { 21398, "INV_Mace22",                   "=q4=聚集风暴之锤", " =q4=[其拉尖刺刀柄]     =q5=崇拜" },
        { 21400, "INV_Misc_Cape_16",             "=q4=聚集风暴披风", " =q3=[其拉帝王披风]     =q4=崇敬" },
        { 21399, "INV_Jewelry_Ring_AhnQiraj_03", "=q4=聚集风暴之戒", " =q3=[其拉将领戒指]     =q3=尊敬" },
        };
    
   AQ20Warrior = {
        { 0,"INV_Shield_05","=q6=#aq20s9#","" },
        { 21392, "INV_Axe_15",                   "=q4=坚定力量之镰", " =q4=[其拉尖刺刀柄]     =q5=崇拜" },
        { 21394, "INV_Misc_Cape_20",             "=q4=坚定力量披风", " =q3=[其拉军用披风]     =q4=崇敬" },
        { 21393, "INV_Jewelry_Ring_AhnQiraj_03", "=q4=坚定力量之戒", " =q3=[其拉将领戒指]     =q3=尊敬" },
        };
        
    AQ40Mage = {
        { 0,"Spell_Frost_IceStorm","=q6=#aq40s3#","" },
        { 21343, "INV_Chest_Cloth_11", "=q4=神秘长袍",        " =q4=[上古之神的外鞘]   =q3=尊敬" },
        { 21347, "INV_Helmet_06", "=q4=神秘头饰",             " =q4=[维克尼拉斯的头饰] =q2=友善" },
        { 21346, "INV_Pants_Cloth_08", "=q4=神秘护腿",        " =q4=[奥罗的外皮]       =q2=友善" },
        { 21344, "INV_Boots_Cloth_03", "=q4=神秘长靴",        " =q4=[其拉统御腕轮]     =q1=中立" },
        { 21345, "INV_Shoulder_03", "=q4=神秘垫肩",           " =q4=[其拉统御腕轮]     =q1=中立" },
        };
    
    AQ40Priest = {
        { 0,"Spell_Holy_PowerWordShield","=q6=#aq40s5#","" },
        { 21351, "INV_Chest_Cloth_10", "=q4=神谕者的外套",      " =q4=[上古之神的外鞘]   =q3=尊敬" },
        { 21348, "INV_Helmet_06", "=q4=神谕者的皇冠",           " =q4=[维克尼拉斯的头饰] =q2=友善" },
        { 21352, "INV_Pants_Cloth_07", "=q4=神谕者的长裤",      " =q4=[奥罗的外皮]       =q2=友善" },
        { 21349, "INV_Boots_Cloth_07", "=q4=神谕者的裹足",      " =q4=[其拉命令腕轮]     =q1=中立" },
        { 21350, "INV_Shoulder_03", "=q4=神谕者的衬肩",         " =q4=[其拉命令腕轮]     =q1=中立" },
        };
    
    AQ40Warlock = {
        { 0,"Spell_Shadow_CurseOfTounges","=q6=#aq40s8#","" },
        { 21334, "INV_Chest_Cloth_12", "=q4=厄运召唤者的长袍",  " =q4=[上古之神的外鞘]   =q3=尊敬" },
        { 21337, "INV_Helmet_06", "=q4=厄运召唤者的头饰",       " =q4=[维克尼拉斯的头饰] =q2=友善" },
        { 21336, "INV_Pants_Cloth_02", "=q4=厄运召唤者的长裤",  " =q4=[巨型沙虫的皮]     =q2=友善" },
        { 21338, "INV_Boots_Cloth_02", "=q4=厄运召唤者的裹足",  " =q4=[其拉统御腕轮]     =q1=中立" },
        { 21335, "INV_Shoulder_03", "=q4=厄运召唤者的衬肩",     " =q4=[其拉统御腕轮]     =q1=中立" },
        };
    
    AQ40Rogue = {
        { 0,"Ability_BackStab","=q6=#aq40s6#","" },
        { 21364, "INV_Chest_Leather_08", "=q4=死亡执行者的胸甲"," =q4=[上古之神的甲壳]  =q3=尊敬" },
        { 21360, "INV_Helmet_04", "=q4=死亡执行者的头盔",       " =q4=[维克洛尔的王冠]  =q2=友善" },
        { 21362, "INV_Pants_Leather_07", "=q4=死亡执行者的护腿"," =q4=[奥罗的外皮]      =q2=友善" },
        { 21359, "INV_Boots_08", "=q4=死亡执行者的长靴",        " =q4=[其拉命令腕轮]    =q1=中立" },
        { 21361, "INV_Shoulder_03", "=q4=死亡执行者的护肩",     " =q4=[其拉命令腕轮]    =q1=中立" },
        };

    AQ40Druid = {
        { 0,"Spell_Nature_Regeneration","=q6=#aq40s1#","" },
        { 21357, "INV_Chest_Leather_08", "=q4=起源外套",      " =q4=[上古之神的外鞘]  =q3=尊敬" },
        { 21353, "INV_Helmet_06", "=q4=起源头盔",             " =q4=[维克洛尔的王冠]  =q2=友善" },
        { 21356, "INV_Pants_Leather_01", "=q4=起源长裤",      " =q4=[巨型沙虫的皮]    =q2=友善" },
        { 21354, "INV_Shoulder_03", "=q4=起源长靴",           " =q4=[其拉统御腕轮]    =q1=中立" },
        { 21355, "INV_Boots_Cloth_07", "=q4=起源护肩",        " =q4=[其拉统御腕轮]    =q1=中立" },
        };
    
    AQ40Shaman = {
        { 0,"Spell_FireResistanceTotem_01","=q6=#aq40s7#","" },
        { 21374, "INV_Chest_Chain_13", "=q4=风暴召唤者的护甲",   " =q4=[上古之神的甲壳]  =q3=尊敬" },
        { 21372, "INV_Helmet_73", "=q4=风暴召唤者的王冠",        " =q4=[维克洛尔的王冠]  =q2=友善" },
        { 21375, "INV_Pants_Mail_10", "=q4=风暴召唤者的护腿",    " =q4=[巨型沙虫的皮]    =q2=友善" },
        { 21373, "INV_Boots_Chain_07", "=q4=风暴召唤者的足甲",   " =q4=[其拉统御腕轮]    =q1=中立" },
        { 21376, "INV_Shoulder_03", "=q4=风暴召唤者的肩甲",      " =q4=[其拉统御腕轮]    =q1=中立" },
        };
    
    AQ40Hunter = {
        { 0,"Ability_Hunter_RunningShot","=q6=#aq40s2#","" },
        { 21370, "INV_Chest_Chain_04", "=q4=攻击者的护甲",     " =q4=[上古之神的甲壳]  =q3=尊敬" },
        { 21366, "INV_Helmet_73", "=q4=攻击者的王冠",          " =q4=[维克洛尔的王冠]  =q2=友善" },
        { 21368, "INV_Pants_Mail_11", "=q4=攻击者的护腿",      " =q4=[巨型沙虫的皮]    =q2=友善" },
        { 21365, "INV_Boots_Chain_08", "=q4=攻击者的足甲",     " =q4=[其拉命令腕轮]    =q1=中立" },
        { 21367, "INV_Shoulder_36", "=q4=攻击者的护肩",        " =q4=[其拉命令腕轮]    =q1=中立" },
        };
    
    AQ40Warrior = {
        { 0,"INV_Shield_05","=q6=#aq40s9#","" }, 
        { 21331, "INV_Chest_Plate12", "=q4=征服者的胸甲",       " =q4=[上古之神的甲壳]   =q3=尊敬" },
        { 21329, "INV_Helmet_72", "=q4=征服者的皇冠",           " =q4=[维克尼拉斯的头饰] =q2=友善" },
        { 21332, "INV_Pants_Plate_03", "=q4=征服者的腿铠",      " =q4=[奥罗的外皮]       =q2=友善" },
        { 21333, "INV_Boots_Plate_05", "=q4=征服者的胫甲",      " =q4=[其拉命令腕轮]     =q1=中立" },
        { 21330, "INV_Shoulder_35", "=q4=征服者的肩铠",         " =q4=[其拉命令腕轮]     =q1=中立" },
        };

    AQ40Paladin = {
        { 0,"Spell_Holy_SealOfMight","=q6=#aq40s4#","" },
        { 21389, "INV_Chest_Plate03", "=q4=复仇者的胸甲",      " =q4=[上古之神的甲壳] =q3=尊敬" },
        { 21387, "INV_Helmet_72", "=q4=复仇者的王冠",          " =q4=[维克洛尔的王冠] =q2=友善" },
        { 21390, "INV_Pants_Plate_02", "=q4=复仇者的护腿",     " =q4=[巨型沙虫的皮]   =q2=友善" },
        { 21388, "INV_Boots_Chain_07", "=q4=复仇者的胫甲",     " =q4=[其拉统御腕轮]   =q1=中立" },
        { 21391, "INV_Shoulder_35", "=q4=复仇者的护肩",        " =q4=[其拉统御腕轮]   =q1=中立" },
        };
        
	PVPHunter = {
		{ 0, "INV_BannerPVP_02", "=ds=#pvpea2#", "=q5=#pvps1#" },
		{ 16465, "INV_Helmet_05",		      "=q4=元帅的链甲头盔", "" },
		{ 16468, "INV_Shoulder_10",		    "=q4=元帅的链甲护肩", "" },
		{ 16466, "INV_Chest_Chain_03",		"=q4=元帅的链甲", "" },
		{ 16463, "INV_Gauntlets_10",		  "=q4=统帅的链甲护手", "" },
		{ 16467, "INV_Pants_Mail_17",		  "=q4=统帅的链甲护腿", "" },
		{ 16462, "INV_Boots_Plate_07",		"=q4=统帅的链甲战靴", "" },
		{ 0, "", "", "" },
		{ 0, "INV_BannerPVP_02", "=ds=#pvpra2#", "=q5=#pvps2#" },
		{ 23306, "INV_Helmet_21",		      "=q3=少校的链甲头盔", "" },
		{ 23307, "INV_Shoulder_16",		    "=q3=少校的链甲护肩", "" },
		{ 23292, "INV_Chest_Chain_04",		"=q3=骑士队长的链甲护胸", "" },
		{ 23279, "INV_Gauntlets_17",		  "=q3=骑士中尉的链甲护手", "" },
		{ 23293, "INV_Pants_03",		      "=q3=骑士队长的链甲护腿", "" },
		{ 23278, "INV_Boots_05",		      "=q3=骑士中尉的链甲长靴", "" },
		{ 0, "INV_BannerPVP_01", "=ds=#pvpeh2#", "=q5=#pvps1#" },
		{ 16566, "INV_Helmet_09",		      "=q4=督军的链甲头盔", "" },
		{ 16568, "INV_Shoulder_29",		    "=q4=督军的链甲护肩", "" },
		{ 16565, "INV_Chest_Chain_11",		"=q4=督军的链甲", "" },
		{ 16571, "INV_Gauntlets_11",		  "=q4=将军的链甲手套", "" },
		{ 16567, "INV_Pants_Mail_16",		  "=q4=将军的链甲护腿", "" },
		{ 16569, "INV_Boots_Plate_06",		"=q4=将军的链甲战靴", "" },
		{ 0, "", "", "" },
		{ 0, "INV_BannerPVP_01", "=ds=#pvprh2#", "=q5=#pvps2#" },
		{ 23251, "INV_Helmet_03",		      "=q3=勇士的链甲头盔", "" },
		{ 23252, "INV_Shoulder_01",		    "=q3=勇士的链甲护肩", "" },
		{ 22874, "INV_Chest_Chain_04",		"=q3=军团士兵的链甲护胸", "" },
		{ 22862, "INV_Gauntlets_17",		  "=q3=血卫士的链甲护手", "" },
		{ 22875, "INV_Pants_03",		      "=q3=军团士兵的链甲护腿", "" },
		{ 22843, "INV_Boots_05",		      "=q3=血卫士的链甲长靴", "" },
	};

	PVPMage = {
		{ 0, "INV_BannerPVP_02", "=ds=#pvpea3#", "=q5=#pvps1#" },
		{ 16441, "INV_Helmet_24",		      "=q4=元帅的丝质宝冠", "" },
		{ 16444, "INV_Shoulder_23",		    "=q4=元帅的丝质肩甲", "" },
		{ 16443, "INV_Chest_Cloth_12",    "=q4=元帅的丝质外衣", "" },
		{ 16440, "INV_Gauntlets_14",	    "=q4=统帅的丝质手套", "" },
		{ 16442, "INV_Pants_08",		      "=q4=统帅的丝质护腿", "" },
		{ 16437, "INV_Boots_Cloth_03",		"=q4=统帅的丝质裹足", "" },
		{ 0, "", "", "" },
		{ 0, "INV_BannerPVP_02", "=ds=#pvpra3#", "=q5=#pvps2#" },
		{ 23318, "INV_Helmet_06",		      "=q3=少校的丝质罩帽", "" },
		{ 23319, "INV_Shoulder_02",		    "=q3=少校的丝质衬肩", "" },
		{ 23305, "INV_Chest_Cloth_28",		"=q3=骑士队长的丝质外套", "" },
		{ 23290, "INV_Gauntlets_06",		  "=q3=骑士中尉的丝质裹手", "" },
		{ 23304, "INV_Pants_11",		      "=q3=骑士队长的丝质护腿", "" },
		{ 23291, "INV_Boots_05",		      "=q3=骑士中尉的丝质便鞋", "" },
		{ 0, "INV_BannerPVP_01", "=ds=#pvpeh3#", "=q5=#pvps1#" },
		{ 16533, "INV_Helmet_08",		      "=q4=督军的丝质罩帽", "" },
		{ 16536, "INV_Shoulder_19",		    "=q4=督军的丝质披肩", "" },
		{ 16535, "INV_Chest_Leather_01",	"=q4=督军的丝质外衣", "" },
		{ 16540, "INV_Gauntlets_19",		  "=q4=将军的丝质护手", "" },
		{ 16534, "INV_Pants_07",		      "=q4=将军的丝质长裤", "" },
		{ 16539, "INV_Boots_05",		      "=q4=将军的丝质长靴", "" },
		{ 0, "", "", "" },
		{ 0, "INV_BannerPVP_01", "=ds=#pvprh3#", "=q5=#pvps2#" },
		{ 23263, "INV_Helmet_06",		      "=q3=勇士的丝质罩帽", "" },
		{ 23264, "INV_Shoulder_02",		    "=q3=勇士的丝质衬肩", "" },
		{ 22886, "INV_Chest_Cloth_28",		"=q3=军团士兵的丝质外套", "" },
		{ 22870, "INV_Gauntlets_06",		  "=q3=血卫士的丝质裹手", "" },
		{ 22883, "INV_Pants_11",		      "=q3=军团士兵的丝质护腿", "" },
		{ 22860, "INV_Boots_05",		      "=q3=血卫士的丝质长靴", "" },
	};

	PVPPriest = {
		{ 0, "INV_BannerPVP_02", "=ds=#pvpea4#", "=q5=#pvps1#" },
		{ 17602, "INV_Helmet_24",		      "=q4=元帅的头饰", "" },
		{ 17604, "INV_Shoulder_02",		    "=q4=元帅的绸缎衬肩", "" },
		{ 17605, "INV_Chest_Cloth_02",		"=q4=元帅的绸缎外衣", "" },
		{ 17608, "INV_Gauntlets_14",		  "=q4=统帅的绸缎手套", "" },
		{ 17603, "INV_Pants_06",		      "=q4=统帅的绸缎短裤", "" },
		{ 17607, "INV_Boots_07",		      "=q4=统帅的绸缎便鞋", "" },
		{ 0, "", "", "" },
		{ 0, "INV_BannerPVP_02", "=ds=#pvpra4#", "=q5=#pvps2#" },
		{ 23316, "INV_Helmet_17",		      "=q3=少校的绸缎头巾", "" },
		{ 23317, "INV_Shoulder_01",		    "=q3=少校的绸缎衬肩", "" },
		{ 23303, "INV_Chest_Leather_01",	"=q3=骑士队长的绸缎外套", "" },
		{ 23288, "INV_Gauntlets_17",		  "=q3=骑士中尉的绸缎裹手", "" },
		{ 23302, "INV_Pants_11",		      "=q3=骑士队长的绸缎护腿", "" },
		{ 23289, "INV_Boots_05",		      "=q3=骑士中尉的绸缎便鞋", "" },
		{ 0, "INV_BannerPVP_01", "=ds=#pvpeh4#", "=q5=#pvps1#" },
		{ 17623, "INV_Helmet_08",		      "=q4=督军的绸缎罩帽", "" },
		{ 17622, "INV_Shoulder_19",		    "=q4=督军的绸缎衬肩", "" },
		{ 17624, "INV_Chest_Leather_01",	"=q4=督军的绸缎长袍", "" },
		{ 17620, "INV_Gauntlets_27",		  "=q4=将军的绸缎手套", "" },
		{ 17625, "INV_Pants_07",		      "=q4=将军的绸缎护腿", "" },
		{ 17618, "INV_Boots_05",		      "=q4=将军的绸缎长靴", "" },
		{ 0, "", "", "" },
		{ 0, "INV_BannerPVP_01", "=ds=#pvprh4#", "=q5=#pvps2#" },
		{ 23261, "INV_Helmet_17",		      "=q3=勇士的绸缎头巾", "" },
		{ 23262, "INV_Shoulder_01",		    "=q3=勇士的绸缎衬肩", "" },
		{ 22885, "INV_Chest_Leather_01",	"=q3=军团士兵的绸缎外套", "" },
		{ 22869, "INV_Gauntlets_17",		  "=q3=血卫士的绸缎裹手", "" },
		{ 22882, "INV_Pants_11",		      "=q3=军团士兵的绸缎护腿", "" },
		{ 22859, "INV_Boots_05",		      "=q3=血卫士的绸缎长靴", "" },
	};

	PVPWarlock = {
		{ 0, "INV_BannerPVP_02", "=ds=#pvpea7#", "=q5=#pvps1#" },
		{ 17578, "INV_Helmet_24",		      "=q4=元帅的头冠", "" },
		{ 17580, "INV_Shoulder_02",		    "=q4=元帅的鬼纹护肩", "" },
		{ 17581, "INV_Chest_Cloth_09",		"=q4=元帅的鬼纹长袍", "" },
		{ 17584, "INV_Gauntlets_14",		  "=q4=统帅的鬼纹手套", "" },
		{ 17579, "INV_Pants_Cloth_09",		"=q4=统帅的鬼纹护腿", "" },
		{ 17583, "INV_Boots_07",		      "=q4=统帅的鬼纹长靴", "" },
		{ 0, "", "", "" },
		{ 0, "INV_BannerPVP_02", "=ds=#pvpra7#", "=q5=#pvps2#" },
		{ 23310, "INV_Helmet_08",		      "=q3=少校的鬼纹罩帽", "" },
		{ 23311, "INV_Shoulder_01",		    "=q3=少校的鬼纹肩饰", "" },
		{ 23297, "INV_Chest_Leather_01",	"=q3=骑士队长的鬼纹外套", "" },
		{ 23282, "INV_Gauntlets_19",		  "=q3=骑士中尉的鬼纹裹手", "" },
		{ 23296, "INV_Pants_06",		      "=q3=骑士队长的鬼纹护腿", "" },
		{ 23283, "INV_Boots_05",		      "=q3=骑士中尉的鬼纹便鞋", "" },
		{ 0, "INV_BannerPVP_01", "=ds=#pvpeh7#", "=q5=#pvps1#" },
		{ 17591, "INV_Helmet_08",		      "=q4=督军的鬼纹罩帽", "" },
		{ 17590, "INV_Shoulder_19",		    "=q4=督军的鬼纹衬肩", "" },
		{ 17592, "INV_Chest_Leather_01",	"=q4=督军的鬼纹长袍", "" },
		{ 17588, "INV_Gauntlets_19",		  "=q4=将军的鬼纹手套", "" },
		{ 17593, "INV_Pants_07",		      "=q4=将军的鬼纹短裤", "" },
		{ 17586, "INV_Boots_05",	      	"=q4=将军的鬼纹长靴", "" },
		{ 0, "", "", "" },
		{ 0, "INV_BannerPVP_01", "=ds=#pvprh7#", "=q5=#pvps2#" },
		{ 23255, "INV_Helmet_08",		     "=q3=勇士的鬼纹罩帽", "" },
		{ 23256, "INV_Shoulder_01",		   "=q3=勇士的鬼纹肩饰", "" },
		{ 22884, "INV_Chest_Leather_01", "=q3=军团士兵的鬼纹外套", "" },
		{ 22865, "INV_Gauntlets_19",		 "=q3=血卫士的鬼纹裹手", "" },
		{ 22881, "INV_Pants_06",		     "=q3=军团士兵的鬼纹护腿", "" },
		{ 22855, "INV_Boots_05",		     "=q3=血卫士的鬼纹长靴", "" },
	};

	PVPRogue = {
		{ 0, "INV_BannerPVP_02", "=ds=#pvpea5#", "=q5=#pvps1#" },
		{ 16455, "INV_Helmet_41",		    "=q4=元帅的皮甲面具", "" },
		{ 16457, "INV_Shoulder_23",		  "=q4=元帅的皮甲肩饰", "" },
		{ 16453, "INV_Chest_Cloth_07",  "=q4=元帅的皮甲", "" },
		{ 16454, "INV_Gauntlets_21",		"=q4=统帅的皮甲护手", "" },
		{ 16456, "INV_Pants_06",		    "=q4=统帅的皮甲护腿", "" },
		{ 16446, "INV_Boots_08",		    "=q4=统帅的皮甲护足", "" },
		{ 0, "", "", "" },
		{ 0, "INV_BannerPVP_02", "=ds=#pvpra5#", "=q5=#pvps2#" },
		{ 23312, "INV_Helmet_09",		    "=q3=少校的皮甲头盔", "" },
		{ 23313, "INV_Shoulder_14",		  "=q3=少校的皮甲护肩", "" },
		{ 23298, "INV_Chest_Leather_05","=q3=骑士队长的皮甲护胸", "" },
		{ 23284, "INV_Gauntlets_15",		"=q3=骑士中尉的皮甲护手", "" },
		{ 23299, "INV_Pants_08",		    "=q3=骑士队长的皮甲护腿", "" },
		{ 23285, "INV_Boots_05",		    "=q3=骑士中尉的皮甲便鞋", "" },
		{ 0, "INV_BannerPVP_01", "=ds=#pvpeh5#", "=q5=#pvps1#" },
		{ 16561, "INV_Helmet_09",		    "=q4=督军的皮甲头盔", "" },
		{ 16562, "INV_Shoulder_07",		  "=q4=督军的皮甲肩铠", "" },
		{ 16563, "INV_Chest_Chain_16",  "=q4=督军的皮甲", "" },
		{ 16560, "INV_Gauntlets_25",		"=q4=将军的皮甲手套", "" },
		{ 16564, "INV_Pants_06",		    "=q4=将军的皮甲护腿", "" },
		{ 16558, "INV_Boots_08",		    "=q4=将军的皮甲战靴", "" },
		{ 0, "", "", "" },
		{ 0, "INV_BannerPVP_01", "=ds=#pvprh5#", "=q5=#pvps2#" },
		{ 23257, "INV_Helmet_09",		    "=q3=勇士的皮甲头盔", "" },
		{ 23258, "INV_Shoulder_14",		  "=q3=勇士的皮甲护肩", "" },
		{ 22879, "INV_Chest_Leather_05","=q3=军团士兵的皮甲护胸", "" },
		{ 22864, "INV_Gauntlets_15",		"=q3=血卫士的皮甲护手", "" },
		{ 22880, "INV_Pants_08",		    "=q3=军团士兵的皮甲护腿", "" },
		{ 22856, "INV_Boots_05",		    "=q3=血卫士的皮甲长靴", "" },
	};

	PVPDruid = {
		{ 0, "INV_BannerPVP_02", "=ds=#pvpea1#", "=q5=#pvps1#" },
		{ 16451, "INV_Helmet_41",		    "=q4=元帅的龙皮头盔", "" },
		{ 16449, "INV_Shoulder_23",		  "=q4=元帅的龙皮肩甲", "" },
		{ 16452, "INV_Chest_Cloth_07",	"=q4=元帅的龙皮胸甲", "" },
		{ 16448, "INV_Gauntlets_21",		"=q4=统帅的龙皮手套", "" },
		{ 16450, "INV_Pants_06",		    "=q4=统帅的龙皮腿甲", "" },
		{ 16459, "INV_Boots_08",		    "=q4=统帅的龙皮战靴", "" },
		{ 0, "", "", "" },
		{ 0, "INV_BannerPVP_02", "=ds=#pvpra1#", "=q5=#pvps2#" },
		{ 23308, "INV_Helmet_09",		    "=q3=少校的龙皮头盔", "" },
		{ 23309, "INV_Shoulder_07",		  "=q3=少校的龙皮护肩", "" },
		{ 23294, "INV_Chest_Leather_07","=q3=骑士队长的龙皮护胸", "" },
		{ 23280, "INV_Gauntlets_25",		"=q3=骑士中尉的龙皮护手", "" },
		{ 23295, "INV_Pants_06",		    "=q3=骑士队长的龙皮护腿", "" },
		{ 23281, "INV_Boots_08",		    "=q3=骑士中尉的龙皮便鞋", "" },
		{ 0, "INV_BannerPVP_01", "=ds=#pvpeh1#", "=q5=#pvps1#" },
		{ 16550, "INV_Helmet_09",		    "=q4=督军的龙皮头盔", "" },
		{ 16551, "INV_Shoulder_07",		  "=q4=督军的龙皮肩饰", "" },
		{ 16549, "INV_Chest_Chain_16",	"=q4=督军的龙皮锁甲", "" },
		{ 16555, "INV_Gauntlets_25",		"=q4=将军的龙皮手套", "" },
		{ 16552, "INV_Pants_06",		    "=q4=将军的龙皮护腿", "" },
		{ 16554, "INV_Boots_08",		    "=q4=将军的龙皮战靴", "" },
		{ 0, "", "", "" },
		{ 0, "INV_BannerPVP_01", "=ds=#pvprh1#", "=q5=#pvps2#" },
		{ 23253, "INV_Helmet_09",		    "=q3=勇士的龙皮头盔", "" },
		{ 23254, "INV_Shoulder_07",		  "=q3=勇士的龙皮护肩", "" },
		{ 22877, "INV_Chest_Leather_07","=q3=军团士兵的龙皮护胸", "" },
		{ 22863, "INV_Gauntlets_25",		"=q3=血卫士的龙皮护手", "" },
		{ 22878, "INV_Pants_06",		    "=q3=军团士兵的龙皮护腿", "" },
		{ 22852, "INV_Boots_08",		    "=q3=血卫士的龙皮长靴", "" },
	};

	PVPShaman = {
		{ 0, "INV_BannerPVP_01", "=ds=#pvpeh6#", "=q5=#pvps1#" },
		{ 16578, "INV_Helmet_09",		   "=q4=督军的锁甲头盔", "" },
		{ 16580, "INV_Shoulder_29",		 "=q4=督军的锁甲肩铠", "" },
		{ 16577, "INV_Chest_Chain_11", "=q4=督军的锁甲", "" },
		{ 16574, "INV_Gauntlets_11",	 "=q4=将军的锁甲护手", "" },
		{ 16579, "INV_Pants_Mail_15",	 "=q4=将军的锁甲护腿", "" },
		{ 16573, "INV_Boots_Plate_06", "=q4=将军的锁甲战靴", "" },
		{ 0, "", "", "" },
		{ 0, "INV_BannerPVP_01", "=ds=#pvprh6#", "=q5=#pvps2#" },
		{ 23259, "INV_Helmet_09",		   "=q3=勇士的锁甲头盔", "" },
		{ 23260, "INV_Shoulder_04",		 "=q3=勇士的锁甲肩铠", "" },
		{ 22876, "INV_Chest_Chain_16", "=q3=军团士兵的锁甲护胸", "" },
		{ 22867, "INV_Gauntlets_11",	 "=q3=血卫士的锁甲护手", "" },
		{ 22887, "INV_Pants_09",		   "=q3=军团士兵的锁甲战靴", "" },
		{ 22857, "INV_Boots_07",		   "=q3=血卫士的锁甲腿铠","" },
	};

	PVPWarrior = {
		{ 0, "INV_BannerPVP_02", "=ds=#pvpea8#", "=q5=#pvps1#" },
		{ 16478, "INV_Helmet_05",		  "=q4=元帅的板甲头盔", "" },
		{ 16480, "INV_Shoulder_20",		"=q4=元帅的板甲护肩", "" },
		{ 16477, "INV_Chest_Plate03",	"=q4=元帅的板甲", "" },
		{ 16484, "INV_Gauntlets_29",	"=q4=统帅的板甲护手", "" },
		{ 16479, "INV_Pants_04",		  "=q4=统帅的板甲护腿", "" },
		{ 16483, "INV_Boots_Plate_09","=q4=统帅的板甲战靴", "" },
		{ 0, "", "", "" },
		{ 0, "INV_BannerPVP_02", "=ds=#pvpra8#", "=q5=#pvps2#" },
		{ 23314, "INV_Helmet_09",		  "=q3=少校的板甲头盔", "" },
		{ 23315, "INV_Shoulder_11",		"=q3=少校的板甲护肩", "" },
		{ 23300, "INV_Chest_Plate16",	"=q3=骑士队长的板甲护胸", "" },
		{ 23286, "INV_Gauntlets_26",	"=q3=骑士中尉的板甲护手", "" },
		{ 23301, "INV_Pants_06",		  "=q3=骑士队长的板甲护腿", "" },
		{ 23287, "INV_Boots_Plate_09","=q3=骑士中尉的板甲战靴", "" },
		{ 0, "INV_BannerPVP_01", "=ds=#pvpeh8#", "=q5=#pvps1#" },
		{ 16542, "INV_Helmet_09",		  "=q4=督军的板甲头盔", "" },
		{ 16544, "INV_Shoulder_11",		"=q4=督军的板甲护肩", "" },
		{ 16541, "INV_Chest_Plate16",	"=q4=督军的板甲", "" },
		{ 16548, "INV_Gauntlets_10",	"=q4=将军的板甲护手", "" },
		{ 16543, "INV_Pants_04",		  "=q4=将军的板甲护腿", "" },
		{ 16545, "INV_Boots_Plate_04","=q4=将军的板甲战靴", "" },
		{ 0, "", "", "" },
		{ 0, "INV_BannerPVP_01", "=ds=#pvprh8#", "=q5=#pvps2#" },
		{ 23244, "INV_Helmet_09",		 "=q3=勇士的板甲头盔", "" },
		{ 23243, "INV_Shoulder_11",	 "=q3=勇士的板甲护肩", "" },
		{ 22872, "INV_Chest_Plate16","=q3=军团士兵的板甲护胸", "" },
		{ 22868, "INV_Gauntlets_26", "=q3=血卫士的板甲护手", "" },
		{ 22873, "INV_Pants_06",		 "=q3=军团士兵的板甲护腿", "" },
		{ 22858, "INV_Boots_Plate_09","=q3=血卫士的板甲战靴", "" },
	};

	PVPPaladin = {
		{ 0, "INV_BannerPVP_02", "=ds=#pvpea4#", "=q5=#pvps1#" },
		{ 16474, "INV_Helmet_05",		 "=q4=元帅的板层甲头盔", "" },
		{ 16476, "INV_Shoulder_20",	 "=q4=元帅的板层甲肩铠", "" },
		{ 16473, "INV_Chest_Plate03","=q4=元帅的板层甲", "" },
		{ 16471, "INV_Gauntlets_29", "=q4=统帅的板层甲手套", "" },
		{ 16475, "INV_Pants_04",		 "=q4=统帅的板层甲腿铠", "" },
		{ 16472, "INV_Boots_Plate_09","=q4=统帅的板层甲战靴", "" },
		{ 0, "", "", "" },
		{ 0, "INV_BannerPVP_02", "=ds=#pvpra4#", "=q5=#pvps2#" },
		{ 23276, "INV_Helmet_05",		 "=q3=少校的板层甲头盔", "" },
		{ 23277, "INV_Shoulder_28",	 "=q3=少校的板层甲护肩", "" },
		{ 23272, "INV_Chest_Plate03","=q3=骑士队长的板层甲护胸", "" },
		{ 23274, "INV_Gauntlets_29", "=q3=骑士中尉的板层甲护手", "" },
		{ 23273, "INV_Pants_06",		 "=q3=骑士队长的板层甲护腿", "" },
		{ 23275, "INV_Boots_Plate_03","=q3=骑士中尉的板层甲马靴", "" },
	};
        
    PVPWeapons1 = {
        { 0, "INV_BannerPVP_02", "=q6=#m7#", "" },
        { 18827, "INV_Axe_24", "=q4=大元帅的手斧", "=ds=#h1# #w1#" },
        { 18830, "INV_Axe_10", "=q4=大元帅的斩石斧", "=ds=#h2# #w1#" },
        { 18838, "INV_Weapon_ShortBlade_26", "=q4=大元帅的匕首 ", "=ds=#h1# #w4#" },
        { 23451, "INV_Weapon_ShortBlade_26", "=q4=大元帅的法师之刃", "=ds=#h1# #w4#" },
        { 18847, "Ability_Rogue_Rupture", "=q4=大元帅的左手指虎", "=ds=#h4# #w13#" },
        { 18843, "INV_Weapon_ShortBlade_07", "=q4=大元帅的右手指虎", "=ds=#h3# #w13#" },
        { 18865, "INV_Mace_13", "=q4=大元帅的惩戒之锤", "=ds=#h1# #w6#" },
        { 23454, "INV_Hammer_02", "=q4=大元帅的战锤", "=ds=#h1# #w6#" },
        { 23455, "INV_Hammer_23", "=q4=大元帅的破坏者", "=ds=#h2# #w6#" },
        { 18867, "INV_Hammer_03", "=q4=大元帅的战锤", "=ds=#h2# #w6#" },
        { 18869, "INV_Spear_08", "=q4=大元帅的长刀", "=ds=#w7#" },
        { 18873, "INV_Staff_14", "=q4=大元帅的手杖", "=ds=#w9#" },
        { 12584, "INV_Sword_11", "=q4=大元帅的长剑", "=ds=#h1# #w10#" },
        { 0, "", "", "" },
        { 0, "INV_BannerPVP_01", "=q6=#m6#", "" },
        { 18828, "INV_Axe_02", "=q4=高阶督军的利斧", "=ds=#h1# #w1#" },
        { 18831, "INV_Axe_21", "=q4=高阶督军的战斧", "=ds=#h2# #w1#" },
        { 18840, "INV_Weapon_ShortBlade_13", "=q4=高阶督军的剃刀", "=ds=#h1# #w4#" },
        { 23466, "INV_Weapon_ShortBlade_26", "=q4=高阶督军的法术之刃", "=ds=#h1# #w4#" },
        { 18848, "INV_Misc_MonsterClaw_04", "=q4=高阶督军的左手爪", "=ds=#h4# #w13#" },
        { 18844, "INV_Misc_MonsterClaw_03", "=q4=高阶督军的右手爪", "=ds=#h3# #w13#" },
        { 18866, "INV_Hammer_20", "=q4=高阶督军的大头棒", "=ds=#h1# #w6#" },
        { 23464, "INV_Hammer_02", "=q4=高阶督军的战锤", "=ds=#h1# #w6#" },
        { 23465, "INV_Mace_09", "=q4=高阶督军的毁灭者", "=ds=#h2# #w6#" },
        { 18868, "INV_Hammer_10", "=q4=高阶督军的粉碎之锤", "=ds=#h2# #w6#" },
        { 18871, "INV_Spear_01", "=q4=高阶督军的赶猪棒", "=ds=#w7#" },
        { 18874, "INV_Misc_Bone_ElfSkull_01", "=q4=高阶督军的战斗法杖", "=ds=#w9#" },
        { 16345, "INV_Sword_11", "=q4=高阶督军的剃刀", "=ds=#h1# #w10#" },
        { 0, "", "", "" },
        };
        
    PVPWeapons2 = {
        { 0, "INV_BannerPVP_02", "=q6=#m7#", "" },
        { 23456, "INV_Sword_05", "=q4=大元帅的迅捷之刃", "=ds=#h1# #w10#" },
        { 18876, "INV_Sword_39", "=q4=大元帅的双刃刀", "=ds=#h2# #w10#" },
        { 18833, "INV_Weapon_Bow_12", "=q4=大元帅的硬弓", "=ds=#w2#" },
        { 18836, "INV_Weapon_Crossbow_04", "=q4=大元帅的强弩", "=ds=#w3#" },
        { 18855, "INV_Weapon_Rifle_08", "=q4=大元帅的手持火炮", "=ds=#w5#" },
        { 18825, "INV_Shield_05", "=q4=大元帅的庇护之盾", "=ds=#w8#" },
        { 23452, "INV_Misc_Book_12", "=q4=大元帅的力量之书", "=ds=#s15#" },
        { 23453, "INV_Misc_Book_13", "=q4=大元帅的恢复之书", "=ds=#s15#" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "INV_BannerPVP_01", "=q6=#m6#", "" },
        { 23467, "INV_Sword_05", "=q4=高阶督军的迅捷之刃", "=ds=#h1# #w10#" },
        { 18877, "INV_Sword_48", "=q4=高阶督军的巨剑", "=ds=#h2# #w10#" },
        { 18835, "INV_Weapon_Bow_08", "=q4=高阶督军的弯弓", "=ds=#w2#" },
        { 18837, "INV_Weapon_Crossbow_10", "=q4=高阶督军的弩", "=ds=#w3#" },
        { 18860, "INV_Weapon_Rifle_06", "=q4=高阶督军的火枪", "=ds=#w5#" },
        { 18826, "INV_Shield_19", "=q4=高阶督军的墙盾", "=ds=#w8#" },
        { 23468, "INV_Misc_Book_15", "=q4=高阶督军的毁灭宝典", "=ds=#s15#" },
        { 23469, "INV_Misc_Book_14", "=q4=高阶督军的治愈之书", "=ds=#s15#" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        };
        
    Legendaries = {
        { 19019, "INV_Sword_39", "=q5=雷霆之怒,逐风者的祝福之剑", "=ds=#h1# #w10#" },
        { 22736, "INV_Sword_61", "=q5=安杜尼苏斯,灵魂的收割者", "=ds=#h1# #w10#" },
        { 17182, "INV_Hammer_Unique_Sulfuras", "=q5=萨弗拉斯,拉格纳罗斯之手", "=ds=#h2# #w6#" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "INV_Misc_QuestionMark", "=q5=埃提耶什,守护者的传说之杖", "=ds=#w9#, =q1=#m1# =ds=#c1#"},
        { 0, "INV_Misc_QuestionMark", "=q5=埃提耶什,守护者的传说之杖", "=ds=#w9#, =q1=#m1# =ds=#c3#"},
        { 22631, "INV_Staff_Medivh", "=q5=埃提耶什,守护者的传说之杖", "=ds=#w9#, =q1=#m1# =ds=#c5#"},
        { 22630, "INV_Staff_Medivh", "=q5=埃提耶什,守护者的传说之杖", "=ds=#w9#, =q1=#m1# =ds=#c8#"},
        };
     
    AVFriendly = {
        { 0, "INV_BannerPVP_02", "=q6=#m7#", "=q5=#b1#" },
        { 17349, "INV_Potion_39", "=q1=超强治疗药剂", "=ds=#e1#" },
        { 17352, "INV_Potion_81", "=q1=超强法力药剂", "=ds=#e1#" },
        { 19032, "INV_Shirt_GuildTabard_01", "=q1=雷矛军服", "=ds=#s7#" },
        { 19307, "INV_Misc_Bandage_12", "=q1=奥特兰克厚符文布绷带", "=ds=#e4#" },
        { 19318, "INV_Drink_11", "=q1=奥特兰克泉水", "=ds=#e3#" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "INV_BannerPVP_01", "=q6=#m6#", "=q5=#b2#" },
        { 17349, "INV_Potion_39", "=q1=超强治疗药剂", "=ds=#e1#" },
        { 17352, "INV_Potion_81", "=q1=超强法力药剂", "=ds=#e1#" },
        { 19031, "INV_Shirt_GuildTabard_01", "=q1=霜狼军服", "=ds=#s7#" },
        { 19307, "INV_Misc_Bandage_12", "=q1=奥特兰克厚符文布绷带", "=ds=#e4#" },
        { 19318, "INV_Drink_11", "=q1=奥特兰克泉水", "=ds=#e3#" },
    };
    
    AVHonored = {
        { 0, "INV_BannerPVP_02", "=q6=#m7#", "=q5=#b1#" },
        { 19084, "INV_Misc_Cape_18", "=q3=雷矛士兵披风", "=ds=#s4#" },
        { 19086, "INV_Misc_Cape_18", "=q3=雷矛先知披风", "=ds=#s4#" },
        { 19094, "INV_Belt_04", "=q3=雷矛布质腰带", "=ds=#s10#, #a1#" },
        { 19093, "INV_Belt_26", "=q3=雷矛皮质束带", "=ds=#s10#, #a2#" },
        { 19092, "INV_Belt_18", "=q3=雷矛锁甲腰带", "=ds=#s10#, #a3#" },
        { 19091, "INV_Belt_35", "=q3=雷矛板甲腰带", "=ds=#s10#, #a4#" },
        { 19097, "INV_Jewelry_Necklace_15", "=q3=雷矛士兵坠饰", "=ds=#s2#" },
        { 19098, "INV_Jewelry_Necklace_08", "=q3=雷矛先知坠饰", "=ds=#s2#" },
        { 19316, "Spell_Frost_IceShard", "=q2=冰线箭矢", "=ds=#e5#" },
        { 19317, "Spell_Frost_FrostBlast", "=q2=冰线枪弹", "=ds=#e6#" },
        { 19301, "INV_Misc_Food_33", "=q1=奥特兰克魔法点心", "=ds=#e2#" },
        { 17348, "INV_Potion_38", "=q1=特效治疗药剂", "=ds=#e1#" },
        { 17351, "INV_Potion_80", "=q1=特效法力药剂", "=ds=#e1#" },
        { 0, "", "", "" },
        { 0, "INV_BannerPVP_01", "=q6=#m6#", "=q5=#b2#" },
        { 19083, "INV_Misc_Cape_18", "=q3=霜狼军团士兵披风", "=ds=#s4#" },
        { 19085, "INV_Misc_Cape_18", "=q3=霜狼顾问披风", "=ds=#s4#" },
        { 19090, "INV_Belt_04", "=q3=霜狼布质腰带", "=ds=#s10#, #a1#" },
        { 19089, "INV_Belt_26", "=q3=霜狼皮甲腰带", "=ds=#s10#, #a2#" },
        { 19088, "INV_Belt_18", "=q3=霜狼锁甲腰带", "=ds=#s10#, #a3#" },
        { 19087, "INV_Belt_35", "=q3=霜狼板甲腰带", "=ds=#s10#, #a4#" },
        { 19095, "INV_Jewelry_Necklace_16", "=q3=霜狼军团士兵坠饰", "=ds=#s2#" },
        { 19096, "INV_Jewelry_Necklace_07", "=q3=霜狼顾问坠饰", "=ds=#s2#" },
        { 19316, "Spell_Frost_IceShard", "=q2=冰线箭矢", "=ds=#e5#" },
        { 19317, "Spell_Frost_FrostBlast", "=q2=冰线枪弹", "=ds=#e6#" },
        { 19301, "INV_Misc_Food_33", "=q1=奥特兰克魔法点心", "=ds=#e2#" },
        { 17348, "INV_Potion_38", "=q1=特效治疗药剂", "=ds=#e1#" },
        { 17351, "INV_Potion_80", "=q1=特效法力药剂", "=ds=#e1#" },
    };
    
    AVRevered = {
        { 0, "INV_BannerPVP_02", "=q6=#m7#", "=q5=#b1#" },
        { 19045, "INV_BannerPVP_02", "=q3=雷矛军旗", "=ds=#e21#" },
        { 19100, "INV_Weapon_ShortBlade_15", "=q3=电能匕首", "=ds=#h1# #w4#" },
        { 19102, "INV_Staff_20", "=q3=细碎法杖", "=ds=#w9#" },
        { 19104, "INV_Hammer_21", "=q3=雷霆战锤", "=ds=#h1# #w6#" },
        { 19320, "INV_Misc_Ammo_Bullet_01", "=q3=豺狼人皮弹药包", "=ds=#e8#" },
        { 19319, "INV_Misc_Quiver_06", "=q3=鹰身人皮箭袋", "=ds=#e9#" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "INV_BannerPVP_01", "=q6=#m6#", "=q5=#b2#" },
        { 19046, "INV_BannerPVP_01", "=q3=霜狼军旗", "=ds=#e21#" },
        { 19099, "INV_Weapon_ShortBlade_06", "=q3=冰川之刃", "=ds=#h1# #w4#" },
        { 19101, "INV_Staff_30", "=q3=雪白法杖", "=ds=#w9#" },
        { 19103, "INV_Axe_22", "=q3=寒霜之咬", "=ds=#h1# #w1#" },
        { 19320, "INV_Misc_Ammo_Bullet_01", "=q3=豺狼人皮弹药包", "=ds=#e8#" },
        { 19319, "INV_Misc_Quiver_06", "=q3=鹰身人皮箭袋", "=ds=#e9#" },
    };
    
    AVExalted = {
        { 0, "INV_BannerPVP_02", "=q6=#m7#", "=q5=#b1#" },
        { 19030, "Ability_Mount_MountainRam", "=q4=雷矛军用坐骑", "=ds=#e7#" },
        { 19312, "INV_Misc_Flower_04", "=q4=生命花环", "=ds=#s15#" },
        { 19315, "INV_Misc_Branch_01", "=q4=塞拉赞恩之触", "=ds=#s15#" },
        { 19308, "INV_Misc_Book_01", "=q4=奥术统御宝典", "=ds=#s15#" },
        { 19311, "INV_Misc_Book_09", "=q4=火焰魔法宝典", "=ds=#s15#" },
        { 19309, "INV_Misc_Book_06", "=q4=暗影力量宝典", "=ds=#s15#" },
        { 19310, "INV_Misc_Book_11", "=q4=冰雪之王宝典", "=ds=#s15#" },
        { 19324, "INV_Sword_29", "=q4=剥夺者", "=ds=#h1# #w4#" },
        { 19323, "INV_Hammer_13", "=q4=无坚不摧之力", "=ds=#h2# #w6#" },
        { 19321, "Spell_Frost_ChillingArmor", "=q4=无法撼动之物", "=ds=#w8#" },
        { 19325, "INV_Jewelry_Ring_35", "=q4=朱里奥指环", "=ds=#s13#" },
        { 21563, "INV_Jewelry_Ring_34", "=q4=罗德里格的指环", "=ds=#s13#" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "INV_BannerPVP_01", "=q6=#m6#", "=q5=#b2#" },
        { 19029, "INV_Misc_Horn_01", "=q4=霜狼嗥叫者的号角", "=ds=#e7#" },
        { 19312, "INV_Misc_Flower_04", "=q4=生命花环", "=ds=#s15#" },
        { 19315, "INV_Misc_Branch_01", "=q4=塞拉赞恩之触", "=ds=#s15#" },
        { 19308, "INV_Misc_Book_01", "=q4=奥术统御宝典", "=ds=#s15#" },
        { 19311, "INV_Misc_Book_09", "=q4=火焰魔法宝典", "=ds=#s15#" },
        { 19309, "INV_Misc_Book_06", "=q4=暗影力量宝典", "=ds=#s15#" },
        { 19310, "INV_Misc_Book_11", "=q4=冰雪之王宝典", "=ds=#s15#" },
        { 19324, "INV_Sword_29", "=q4=剥夺者", "=ds=#h1# #w4#" },
        { 19323, "INV_Hammer_13", "=q4=无坚不摧之力", "=ds=#h2# #w6#" },
        { 19321, "Spell_Frost_ChillingArmor", "=q4=无法撼动之物", "=ds=#w8#" },
        { 19325, "INV_Jewelry_Ring_35", "=q4=朱里奥指环", "=ds=#s13#" },
        { 21563, "INV_Jewelry_Ring_34", "=q4=罗德里格的指环", "=ds=#s13#" },
    };
    
    ABFriendly = {
        { 0, "INV_BannerPVP_02", "=q6=#m7#", "=q5=#b5#" },
        { 20071, "INV_Jewelry_Talisman_05", "=q3=阿拉索护符", "=ds=#s14#" },
        { 17349, "INV_Potion_39", "=q1=超强治疗药剂", "=ds=#e1#" },
        { 17352, "INV_Potion_81", "=q1=超强法力药剂", "=ds=#e1#" },
        { 20226, "INV_Misc_Food_09", "=q1=高地野战军粮", "=ds=#e2#" },
        { 20227, "INV_Misc_Food_08", "=q1=高地标准军粮", "=ds=#e2#" },
        { 20225, "INV_Misc_Food_33", "=q1=高地浓缩军粮", "=ds=#e2#" },
        { 20244, "INV_Misc_Bandage_02", "=q1=高地丝质绷带", "=ds=#e4#" },
        { 20237, "INV_Misc_Bandage_20", "=q1=高地魔纹布绷带", "=ds=#e4#" },
        { 20243, "INV_Misc_Bandage_12", "=q1=高地符文布绷带", "=ds=#e4#" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "INV_BannerPVP_01", "=q6=#m6#", "=q5=#b6#" },
        { 20072, "INV_Jewelry_Talisman_05", "=q3=污染者护符", "=ds=#s14#" },
        { 17349, "INV_Potion_39", "=q1=超强治疗药剂", "=ds=#e1#" },
        { 17352, "INV_Potion_81", "=q1=超强法力药剂", "=ds=#e1#" },
        { 20223, "INV_Misc_Food_09", "=q1=污染者野战军粮", "=ds=#e2#" },
        { 20224, "INV_Misc_Food_08", "=q1=污染者标准军粮", "=ds=#e2#" },
        { 20222, "INV_Misc_Food_33", "=q1=污染者浓缩军粮", "=ds=#e2#" },
        { 20235, "INV_Misc_Bandage_02", "=q1=污染者的丝质绷带", "=ds=#e4#" },
        { 20232, "INV_Misc_Bandage_20", "=q1=污染者的魔纹布绷带", "=ds=#e4#" },
        { 20234, "INV_Misc_Bandage_12", "=q1=污染者的符文布绷带", "=ds=#e4#" },
    };
    
    ABHonored = {
        { 0, "INV_BannerPVP_02", "=q6=#m7#", "=q5=#b5#" },
        { 20043, "INV_Belt_20", "=q3=高地链甲束带", "=ds=#s10#, #a3#" },
        { 20047, "INV_Belt_17", "=q3=高地布质束带", "=ds=#s10#, #a1#" },
        { 20046, "INV_Belt_17", "=q3=高地蜥蜴皮束带", "=ds=#s10#, #a2#" },
        { 20045, "INV_Belt_17", "=q3=高地皮甲束带", "=ds=#s10#, #a2#" },
        { 20042, "INV_Belt_14", "=q3=高地板层甲束带", "=ds=#s10#, #a4#" },
        { 20041, "INV_Belt_14", "=q3=高地板甲束带", "=ds=#s10#, #a4#" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "INV_BannerPVP_01", "=q6=#m6#", "=q5=#b6#" },
        { 20150, "INV_Belt_20", "=q3=污染者的链甲束带", "=ds=#s10#, #a3#" },
        { 20163, "INV_Belt_17", "=q3=污染者的布质束带", "=ds=#s10#, #a1#" },
        { 20171, "INV_Belt_17", "=q3=污染者的蜥蜴皮束带", "=ds=#s10#, #a2#" },
        { 20190, "INV_Belt_17", "=q3=污染者的皮甲束带", "=ds=#s10#, #a2#" },
        { 20195, "INV_Belt_20", "=q3=污染者的锁甲束带", "=ds=#s10#, #a3#" },
        { 20204, "INV_Belt_14", "=q3=污染者的板甲束带", "=ds=#s10#, #a4#" },
    };
    
    ABRevered = {
        { 0, "INV_BannerPVP_02", "=q6=#m7#", "=q5=#b5#" },
        { 20054, "INV_Boots_Cloth_07", "=q3=高地布质长靴", "=ds=#s12#, #a1#" },
        { 20053, "INV_Boots_Cloth_04", "=q3=高地蜥蜴皮长靴", "=ds=#s12#, #a2#" },
        { 20052, "INV_Boots_Cloth_05", "=q3=高地皮甲长靴", "=ds=#s12#, #a2#" },
        { 20050, "INV_Boots_Chain_02", "=q3=高地链甲护胫", "=ds=#s12#, #a3#" },
        { 20049, "INV_Boots_Plate_04", "=q3=高地板层甲护胫", "=ds=#s12#, #a4#" },
        { 20048, "INV_Boots_Plate_04", "=q3=高地板甲护胫", "=ds=#s12#, #a4#" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "INV_BannerPVP_01", "=q6=#m6#", "=q5=#b6#" },
        { 20159, "INV_Boots_Cloth_07", "=q3=污染者的布质长靴", "=ds=#s12#, #a1#" },
        { 20167, "INV_Boots_Cloth_04", "=q3=污染者的蜥蜴皮长靴", "=ds=#s12#, #a2#" },
        { 20186, "INV_Boots_Cloth_05", "=q3=污染者的皮甲长靴", "=ds=#s12#, #a2#" },
        { 20154, "INV_Boots_Chain_02", "=q3=污染者的链甲护胫", "=ds=#s12#, #a3#" },
        { 20199, "INV_Boots_Chain_02", "=q3=污染者的锁甲护胫", "=ds=#s12#, #a3#" },
        { 20208, "INV_Boots_Plate_04", "=q3=污染者的板甲护胫", "=ds=#s12#, #a4#" },
    };
    
    ABExalted = {
        { 0, "INV_BannerPVP_02", "=q6=#m7#", "=q5=#b5#" },
        { 20073, "INV_Misc_Cape_02", "=q4=荣誉卫士披风", "=ds=#s4#" },
        { 20061, "INV_Shoulder_24", "=q4=高地肩饰", "=ds=#s3#, #a1#" },
        { 20060, "INV_Shoulder_24", "=q4=高地蜥蜴皮护肩", "=ds=#s3#, #a2#" },
        { 20059, "INV_Shoulder_24", "=q4=高地皮甲护肩", "=ds=#s3#, #a2#" },
        { 20055, "INV_Shoulder_01", "=q4=高地链甲护肩", "=ds=#s3#, #a3#" },
        { 20058, "INV_Shoulder_01", "=q4=高地板层甲护肩", "=ds=#s3#, #a4#" },
        { 20057, "INV_Shoulder_01", "=q4=高地板甲护肩", "=ds=#s3#, #a4#" },
        { 20070, "INV_Sword_13", "=q4=先知之爪", "=ds=#h1# #w4#" },
        { 20069, "INV_Wand_04", "=q4=铁皮法杖", "=ds=#w9#" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "INV_BannerPVP_01", "=q6=#m6#", "=q5=#b6#" },
        { 20068, "INV_Misc_Cape_02", "=q4=亡灵卫兵披风", "=ds=#s4#" },
        { 20176, "INV_Shoulder_24", "=q4=污染者肩饰", "=ds=#s3#, #a1#" },
        { 20175, "INV_Shoulder_24", "=q4=污染者的蜥蜴皮护肩", "=ds=#s3#, #a2#" },
        { 20194, "INV_Shoulder_24", "=q4=污染者的皮甲护肩", "=ds=#s3#, #a2#" },
        { 20158, "INV_Shoulder_01", "=q4=污染者的链甲护肩", "=ds=#s3#, #a3#" },
        { 20203, "INV_Shoulder_01", "=q4=污染者的锁甲护肩", "=ds=#s3#, #a3#" },
        { 20212, "INV_Shoulder_01", "=q4=污染者的板甲护肩", "=ds=#s3#, #a4#" },
        { 20214, "INV_Sword_13", "=q4=心灵之牙", "=ds=#h1# #w4#" },
        { 20220, "INV_Wand_04", "=q4=铁皮法杖", "=ds=#w9#" },
    };
    
    WSGFriendly = {
        { 0, "INV_BannerPVP_02", "=q6=#m7#", "=q5=#b3#" },
        { 21565, "INV_Misc_Rune_05", "=q3=完美贡献苻文", "=ds=#s14#" },
        { 21567, "INV_Misc_Rune_02", "=q3=义务苻文", "=ds=#s14#" },
        { 17349, "INV_Potion_39", "=q1=超强治疗药剂", "=ds=#e1#" },
        { 17352, "INV_Potion_81", "=q1=超强法力药剂", "=ds=#e1#" },
        { 19062, "INV_Misc_Food_09", "=q1=战歌峡谷野战军粮", "=ds=#e2#" },
        { 19061, "INV_Misc_Food_08", "=q1=战歌峡谷标准军粮", "=ds=#e2#" },
        { 19060, "INV_Misc_Food_33", "=q1=战歌峡谷浓缩军粮", "=ds=#e2#" },
        { 19068, "INV_Misc_Bandage_02", "=q1=战歌峡谷丝制绷带", "=ds=#e4#" },
        { 19067, "INV_Misc_Bandage_20", "=q1=战歌峡谷魔纹布绷带", "=ds=#e4#" },
        { 19066, "INV_Misc_Bandage_12", "=q1=战歌峡谷符文布绷带", "=ds=#e4#" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "INV_BannerPVP_01", "=q6=#m6#", "=q5=#b4#" },
        { 17349, "INV_Potion_39", "=q1=超强治疗药剂", "=ds=#e1#" },
        { 17352, "INV_Potion_81", "=q1=超强法力药剂", "=ds=#e1#" },
        { 19062, "INV_Misc_Food_09", "=q1=战歌峡谷野战军粮", "=ds=#e2#" },
        { 19061, "INV_Misc_Food_08", "=q1=战歌峡谷标准军粮", "=ds=#e2#" },
        { 19060, "INV_Misc_Food_33", "=q1=战歌峡谷浓缩军粮", "=ds=#e2#" },
        { 19068, "INV_Misc_Bandage_02", "=q1=战歌峡谷丝制绷带", "=ds=#e4#" },
        { 19067, "INV_Misc_Bandage_20", "=q1=战歌峡谷魔纹布绷带", "=ds=#e4#" },
        { 19066, "INV_Misc_Bandage_12", "=q1=战歌峡谷符文布绷带", "=ds=#e4#" },
        { 21565, "INV_Misc_Rune_05", "=q3=完美贡献苻文", "=ds=#s14#" },
        { 21567, "INV_Misc_Rune_02", "=q3=义务苻文", "=ds=#s14#" },
    };
    
    WSGHonored = {
        { 0, "INV_BannerPVP_02", "=q6=#m7#", "=q5=#b3#" },
        { 19530, "INV_Misc_Cape_13", "=q3=看守者斗篷", "=ds=#s4#" },
        { 19522, "INV_Jewelry_Ring_28", "=q3=博学者之戒", "=ds=#s13#" },
        { 19514, "INV_Jewelry_Ring_10", "=q3=保护者指环", "=ds=#s13#" },
        { 19538, "INV_Jewelry_Necklace_13", "=q3=哨兵徽章", "=ds=#s2#" },
        { 17348, "INV_Potion_38", "=q1=特效治疗药剂", "=ds=#e1#" },
        { 17351, "INV_Potion_80", "=q1=特效法力药剂", "=ds=#e1#" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "INV_BannerPVP_01", "=q6=#m6#", "=q5=#b4#" },
        { 19526, "INV_Misc_Cape_18", "=q3=战地治疗者披风", "=ds=#s4#" },
        { 19518, "INV_Jewelry_Ring_20", "=q3=顾问之戒", "=ds=#s13#" },
        { 19510, "INV_Jewelry_Ring_21", "=q3=军团士兵指环", "=ds=#s13#" },
        { 19534, "INV_Jewelry_Necklace_14", "=q3=斥候徽章", "=ds=#s2#" },
        { 17348, "INV_Potion_38", "=q1=特效治疗药剂", "=ds=#e1#" },
        { 17351, "INV_Potion_80", "=q1=特效法力药剂", "=ds=#e1#" },
    };
    
    WSGRevered = {
        { 0, "INV_BannerPVP_02", "=q6=#m7#", "=q5=#b3#" },
        { 19570, "INV_Staff_28", "=q3=博学者法杖", "=ds=#w9#" },
        { 19554, "INV_Sword_27", "=q3=保护者之剑", "=ds=#h1# #w10#" },
        { 19546, "INV_Weapon_ShortBlade_14", "=q3=哨兵之刃", "=ds=#h1# #w4#" },
        { 19562, "INV_Weapon_Bow_02", "=q3=侍从之弓", "=ds=#w2#" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "INV_BannerPVP_01", "=q6=#m6#", "=q5=#b4#" },
        { 19566, "INV_Staff_25", "=q3=顾问的木节法杖", "=ds=#w9#" },
        { 19550, "INV_Sword_31", "=q3=军团士兵之剑", "=ds=#h1# #w10#" },
        { 19542, "INV_Weapon_ShortBlade_15", "=q3=斥候之刃", "=ds=#h1# #w4#" },
        { 19558, "INV_Weapon_Bow_06", "=q3=护卫之弓", "=ds=#w2#" },
    };
    
    WSGExalted = {
        { 0, "INV_BannerPVP_02", "=q6=#m7#", "=q5=#b3#" },
        { 19595, "INV_Bracer_13", "=q4=树妖的护腕", "=ds=#s8#, #a1#" },
        { 19578, "INV_Bracer_06", "=q4=狂暴者护腕", "=ds=#s8#, #a4#" },
        { 19587, "INV_Bracer_12", "=q4=巡林者护腕", "=ds=#s8#, #a2#" },
        { 19582, "INV_Bracer_03", "=q4=风语者护腕", "=ds=#s8#, #a3#" },
        { 22749, "INV_Misc_QuestionMark", "=q4=哨兵的皮裤", "=ds=#s11#, #a2#" },
        { 22750, "INV_Misc_QuestionMark", "=q4=哨兵的蜥蜴皮裤", "=ds=#s11#, #a2#" },
        { 22748, "INV_Misc_QuestionMark", "=q4=哨兵的链甲护腿", "=ds=#s11#, #a3#" },
        { 22753, "INV_Misc_QuestionMark", "=q4=哨兵的板层腿甲", "=ds=#s11#, #a4#" },
        { 22672, "INV_Misc_QuestionMark", "=q4=哨兵的板甲护腿", "=ds=#s11#, #a4#" },
        { 19506, "INV_Shirt_GuildTabard_01", "=q1=银翼军服", "=ds=#s7#" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "INV_BannerPVP_01", "=q6=#m6#", "=q5=#b4#" },
        { 19578, "INV_Bracer_06", "=q4=狂暴者护腕", "=ds=#s8#, #a4#" },
        { 19595, "INV_Bracer_13", "=q4=树妖的护腕", "=ds=#s8#, #a1#" },
        { 19587, "INV_Bracer_12", "=q4=巡林者护腕", "=ds=#s8#, #a2#" },
        { 19582, "INV_Bracer_03", "=q4=风语者护腕", "=ds=#s8#, #a3#" },
        { 22747, "INV_Misc_QuestionMark", "=q4=护卫的丝质护腿", "=ds=#s11#, #a1#" },
        { 22740, "INV_Misc_QuestionMark", "=q4=护卫的皮裤", "=ds=#s11#, #a2#" },
        { 22741, "INV_Misc_QuestionMark", "=q4=护卫的蜥蜴皮裤", "=ds=#s11#, #a2#" },
        { 22673, "INV_Misc_QuestionMark", "=q4=护卫的链甲护腿", "=ds=#s11#, #a3#" },
        { 22676, "INV_Misc_QuestionMark", "=q4=护卫的锁甲护腿", "=ds=#s11#, #a3#" },
        { 22651, "INV_Misc_QuestionMark", "=q4=护卫的板甲护腿", "=ds=#s11#, #a4#" },
        { 19505, "INV_Shirt_GuildTabard_01", "=q1=战歌军服", "=ds=#s7#" },
    };
};
