if (GetLocale() == "zhCN") then

------------
-- Layout --
------------
AtlasLootBattlegrounds = {

    AlteracValleyNorth = {
        "";
        "";
        "";
        "";
        "";
        "";
        "";
        "";
        "";
        "";
        "";
        "";
        "";
        "";
        "";
        "";
        "";
        "";
        "";
        "";
        "AVFriendly";
        "AVHonored";
        "AVRevered";
        "AVExalted";
        "PVPSET";
    };
    
    AlteracValleySouth = {
        "";
        "";
        "";
        "";
        "";
        "";
        "";
        "";
        "";
        "";
        "";
        "";
        "";
        "";
        "";
        "";
        "";
        "";
        "";
        "";
        "AVFriendly";
        "AVHonored";
        "AVRevered";
        "AVExalted";
        "PVPSET";
    };
    
    ArathiBasin = {
        "";
        "";
        "";
        "";
        "";
        "";
        "";
        "";
        "ABFriendly";
        "ABHonored";
        "ABRevered";
        "ABExalted";
        "PVPSET";
    };
     
    WarsongGulch = {
        "";
        "";
        "";
        "WSGFriendly";
        "WSGHonored";
        "WSGRevered";
        "WSGExalted";
        "PVPSET";
    };
};

-------------
-- Rewards --
-------------
AtlasLootBGItems = {

    AVFriendly = {
        { 0, "INV_BannerPVP_02", "=q6=联盟",                        "=q5=雷矛卫队" },
        { 17349, "INV_Potion_39", "=q1=超强治疗药剂",               "=ds=药剂" },
        { 17352, "INV_Potion_81", "=q1=超强法力药剂",               "=ds=药剂" },
        { 19032, "INV_Shirt_GuildTabard_01", "=q1=雷矛军服",        "=ds=工会徽章" },
        { 19307, "INV_Misc_Bandage_12", "=q1=奥特兰克厚符文布绷带", "=ds=绷带" },
        { 19318, "INV_Drink_11", "=q1=奥特兰克泉水",                "=ds=饮料" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "INV_BannerPVP_01", "=q6=部落",                        "=q5=霜狼氏族" },
        { 17349, "INV_Potion_39", "=q1=超强治疗药剂",               "=ds=药剂" },
        { 17352, "INV_Potion_81", "=q1=超强法力药剂",               "=ds=药剂" },
        { 19031, "INV_Shirt_GuildTabard_01", "=q1=霜狼军服",        "=ds=工会徽章" },
        { 19307, "INV_Misc_Bandage_12", "=q1=奥特兰克厚符文布绷带", "=ds=绷带" },
        { 19318, "INV_Drink_11", "=q1=奥特兰克泉水",                "=ds=饮料" },
    };
    
    AVHonored = {
        { 0, "INV_BannerPVP_02", "=q6=联盟", "=q5=雷矛卫队" },
        { 19084, "INV_Misc_Cape_18", "=q3=雷矛士兵披风",        "=ds=背部" },
        { 19086, "INV_Misc_Cape_18", "=q3=雷矛先知披风",        "=ds=背部" },
        { 19097, "INV_Jewelry_Necklace_15", "=q3=雷矛士兵坠饰", "=ds=颈部" },
        { 19098, "INV_Jewelry_Necklace_08", "=q3=雷矛先知坠饰", "=ds=颈部" },
        { 19091, "INV_Belt_35", "=q3=雷矛板甲腰带",             "=ds=腰部,板甲" },
        { 19092, "INV_Belt_18", "=q3=雷矛锁甲腰带",             "=ds=腰部,锁甲" },
        { 19093, "INV_Belt_26", "=q3=雷矛皮质束带",             "=ds=腰部,皮甲" },
        { 19094, "INV_Belt_04", "=q3=雷矛布质腰带",             "=ds=腰部,布甲" },
        { 19316, "Spell_Frost_IceShard", "=q2=冰线箭矢",        "=ds=箭" },
        { 19317, "Spell_Frost_FrostBlast", "=q2=冰线枪弹",      "=ds=子弹" },
        { 19301, "INV_Misc_Food_33", "=q1=奥特兰克魔法点心",    "=ds=食物" },
        { 17348, "INV_Potion_38", "=q1=特效治疗药剂",           "=ds=药剂" },
        { 17351, "INV_Potion_80", "=q1=特效法力药剂",           "=ds=药剂" },
        { 0, "", "", "" },
        { 0, "INV_BannerPVP_01", "=q6=部落", "=q5=霜狼氏族" },
        { 19083, "INV_Misc_Cape_18", "=q3=霜狼军团士兵披风",        "=ds=背部" },
        { 19085, "INV_Misc_Cape_18", "=q3=霜狼顾问披风",            "=ds=背部" },
        { 19095, "INV_Jewelry_Necklace_16", "=q3=霜狼军团士兵坠饰", "=ds=颈部" },
        { 19096, "INV_Jewelry_Necklace_07", "=q3=霜狼顾问坠饰",     "=ds=颈部" },
        { 19087, "INV_Belt_35", "=q3=霜狼板甲腰带",                 "=ds=腰部,板甲" },
        { 19088, "INV_Belt_18", "=q3=霜狼锁甲腰带",                 "=ds=腰部,锁甲" },
        { 19089, "INV_Belt_26", "=q3=霜狼皮甲腰带",                 "=ds=腰部,皮甲" },
        { 19090, "INV_Belt_04", "=q3=霜狼布质腰带",                 "=ds=腰部,布甲" },
        { 19316, "Spell_Frost_IceShard", "=q2=冰线箭矢",            "=ds=箭" },
        { 19317, "Spell_Frost_FrostBlast", "=q2=冰线枪弹",          "=ds=子弹" },
        { 19301, "INV_Misc_Food_33", "=q1=奥特兰克魔法点心",        "=ds=食物" },
        { 17348, "INV_Potion_38", "=q1=特效治疗药剂",               "=ds=药剂" },
        { 17351, "INV_Potion_80", "=q1=特效法力药剂",               "=ds=药剂" },
    };
    
    AVRevered = {
        { 0, "INV_BannerPVP_02", "=q6=联盟", "=q5=雷矛卫队" },
        { 19045, "INV_BannerPVP_02", "=q3=雷矛军旗",              "=ds=军旗" },
        { 19100, "INV_Weapon_ShortBlade_15", "=q3=电能匕首",      "=ds=单手匕首" },
        { 19102, "INV_Staff_20", "=q3=细碎法杖",                  "=ds=法杖" },
        { 19104, "INV_Hammer_21", "=q3=雷霆战锤",                 "=ds=单手锤" },
        { 19320, "INV_Misc_Ammo_Bullet_01", "=q3=豺狼人皮弹药袋", "=ds=弹药袋" },
        { 19319, "INV_Misc_Quiver_06", "=q3=鹰身人皮箭袋",        "=ds=箭袋" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "INV_BannerPVP_01", "=q6=部落","=q5=霜狼氏族" },
        { 19046, "INV_BannerPVP_01", "=q3=霜狼军旗",              "=ds=军旗" },
        { 19099, "INV_Weapon_ShortBlade_06", "=q3=冰川之刃",      "=ds=单手匕首" },
        { 19101, "INV_Staff_30", "=q3=雪白法杖",                  "=ds=法杖" },
        { 19103, "INV_Axe_22", "=q3=寒霜之咬",                    "=ds=单手锤" },
        { 19320, "INV_Misc_Ammo_Bullet_01", "=q3=豺狼人皮弹药袋", "=ds=弹药袋" },
        { 19319, "INV_Misc_Quiver_06", "=q3=鹰身人皮箭袋",        "=ds=箭袋" },
    };
    
    AVExalted = {
        { 0, "INV_BannerPVP_02", "=q6=联盟", "=q5=雷矛卫队" },
        { 19030, "Ability_Mount_MountainRam", "=q4=雷矛军用坐骑", "=ds=坐骑" },
        { 19312, "INV_Misc_Flower_04", "=q4=生命花环",            "=ds=副手物品" },
        { 19315, "INV_Misc_Branch_01", "=q4=塞拉赞恩之触",        "=ds=副手物品" },
        { 19308, "INV_Misc_Book_01", "=q4=奥术统御宝典",          "=ds=副手物品" },
        { 19311, "INV_Misc_Book_09", "=q4=火焰魔法宝典",          "=ds=副手物品" },
        { 19309, "INV_Misc_Book_06", "=q4=暗影力量宝典",          "=ds=副手物品" },
        { 19310, "INV_Misc_Book_11", "=q4=冰雪之王宝典",          "=ds=副手物品" },
        { 19324, "INV_Sword_29", "=q4=剥夺者",                    "=ds=单手匕首" },
        { 19323, "INV_Hammer_13", "=q4=无坚不摧之力",             "=ds=双手锤" },
        { 19321, "Spell_Frost_ChillingArmor", "=q4=无法撼动之物", "=ds=盾牌" },
        { 19325, "INV_Jewelry_Ring_35", "=q4=朱里奥指环",         "=ds=手指" },
        { 21563, "INV_Jewelry_Ring_34", "=q4=罗德里格的指环",     "=ds=手指" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "INV_BannerPVP_01", "=q6=部落", "=q5=霜狼氏族" },
        { 19030, "INV_Misc_Horn_01", "=q4=霜狼嗥叫者的号角",      "=ds=坐骑" },
        { 19312, "INV_Misc_Flower_04", "=q4=生命花环",            "=ds=副手物品" },
        { 19315, "INV_Misc_Branch_01", "=q4=塞拉赞恩之触",        "=ds=副手物品" },
        { 19308, "INV_Misc_Book_01", "=q4=奥术统御宝典",          "=ds=副手物品" },
        { 19311, "INV_Misc_Book_09", "=q4=火焰魔法宝典",          "=ds=副手物品" },
        { 19309, "INV_Misc_Book_06", "=q4=暗影力量宝典",          "=ds=副手物品" },
        { 19310, "INV_Misc_Book_11", "=q4=冰雪之王宝典",          "=ds=副手物品" },
        { 19324, "INV_Sword_29", "=q4=剥夺者",                    "=ds=单手匕首" },
        { 19323, "INV_Hammer_13", "=q4=无坚不摧之力",             "=ds=双手锤" },
        { 19321, "Spell_Frost_ChillingArmor", "=q4=无法撼动之物", "=ds=盾牌" },
        { 19325, "INV_Jewelry_Ring_35", "=q4=朱里奥指环",         "=ds=手指" },
        { 21563, "INV_Jewelry_Ring_34", "=q4=罗德里格的指环",     "=ds=手指" },
    };
    
    ABFriendly = {
        { 0, "INV_BannerPVP_02", "=q6=联盟", "=q5=阿拉索联军" },
        { 17349, "INV_Potion_39", "=q1=超强治疗药剂",         "=ds=药剂" },
        { 17352, "INV_Potion_81", "=q1=超强法力药剂",         "=ds=药剂" },
        { 20226, "INV_Misc_Food_09", "=q1=高地野战军粮",      "=ds=食物" },
        { 20227, "INV_Misc_Food_08", "=q1=高地标准军粮",      "=ds=食物" },
        { 20225, "INV_Misc_Food_33", "=q1=高地浓缩军粮",      "=ds=食物" },
        { 20244, "INV_Misc_Bandage_02", "=q1=高地丝质绷带",   "=ds=绷带" },
        { 20237, "INV_Misc_Bandage_20", "=q1=高地魔纹布绷带", "=ds=绷带" },
        { 20243, "INV_Misc_Bandage_12", "=q1=高地符文布绷带", "=ds=绷带" },
        { 20071, "INV_Jewelry_Talisman_05", "=q3=阿拉索护符", "=ds=饰品" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "INV_BannerPVP_01", "=q6=部落", "=q5=污染者 " },
        { 17349, "INV_Potion_39", "=q1=超强治疗药剂",             "=ds=药剂" },
        { 17352, "INV_Potion_81", "=q1=超强法力药剂",             "=ds=药剂" },
        { 20223, "INV_Misc_Food_09", "=q1=污染者野战军粮",        "=ds=食物" },
        { 20224, "INV_Misc_Food_08", "=q1=污染者标准军粮",        "=ds=食物" },
        { 20222, "INV_Misc_Food_33", "=q1=污染者浓缩军粮",        "=ds=食物" },
        { 20235, "INV_Misc_Bandage_02", "=q1=污染者的丝质绷带",   "=ds=绷带" },
        { 20232, "INV_Misc_Bandage_20", "=q1=污染者的魔纹布绷带", "=ds=绷带" },
        { 20234, "INV_Misc_Bandage_12", "=q1=污染者的符文布绷带", "=ds=绷带" },
        { 20072, "INV_Jewelry_Talisman_05", "=q3=污染者护符",     "=ds=饰品" },
    };
    
    ABHonored = {
        { 0, "INV_BannerPVP_02", "=q6=联盟", "=q5=阿拉索联军" },
        { 20043, "INV_Belt_20", "=q3=高地链甲束带",   "=ds=腰部,锁甲" },
        { 20047, "INV_Belt_17", "=q3=高地布质束带",   "=ds=腰部,布甲" },
        { 20046, "INV_Belt_17", "=q3=高地蜥蜴皮束带", "=ds=腰部,皮甲" },
        { 20045, "INV_Belt_17", "=q3=高地皮甲束带",   "=ds=腰部,皮甲" },
        { 20042, "INV_Belt_14", "=q3=高地板层甲束带", "=ds=腰部,板甲" },
        { 20041, "INV_Belt_14", "=q3=高地板甲束带",   "=ds=腰部,板甲" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "INV_BannerPVP_01", "=q6=部落", "=q5=污染者 " },
        { 20150, "INV_Belt_20", "=q3=污染者的链甲束带",   "=ds=腰部,锁甲" },
        { 20163, "INV_Belt_17", "=q3=污染者的布质束带",   "=ds=腰部,布甲" },
        { 20171, "INV_Belt_17", "=q3=污染者的蜥蜴皮束带", "=ds=腰部,皮甲" },
        { 20190, "INV_Belt_17", "=q3=污染者的皮甲束带",   "=ds=腰部,皮甲" },
        { 20195, "INV_Belt_20", "=q3=污染者的锁甲束带",   "=ds=腰部,锁甲" },
        { 20204, "INV_Belt_14", "=q3=污染者的板甲束带",   "=ds=腰部,板甲" },
    };
    
    ABRevered = {
        { 0, "INV_BannerPVP_02", "=q6=联盟", "=q5=阿拉索联军" },
        { 20050, "INV_Boots_Chain_02", "=q3=高地链甲护胫",   "=ds=脚,锁甲" },
        { 20054, "INV_Boots_Cloth_07", "=q3=高地布质长靴",   "=ds=脚,布甲" },
        { 20053, "INV_Boots_Cloth_04", "=q3=高地蜥蜴皮长靴", "=ds=脚,皮甲" },
        { 20052, "INV_Boots_Cloth_05", "=q3=高地皮甲长靴",   "=ds=脚,皮甲" },
        { 20049, "INV_Boots_Plate_04", "=q3=高地板层甲护胫", "=ds=脚,板甲" },
        { 20048, "INV_Boots_Plate_04", "=q3=高地板甲护胫",   "=ds=脚,板甲" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "INV_BannerPVP_01", "=q6=部落", "=q5=污染者 " },
        { 20154, "INV_Boots_Chain_02", "=q3=污染者的链甲护胫",   "=ds=脚,锁甲" },
        { 20159, "INV_Boots_Cloth_07", "=q3=污染者的布质长靴",   "=ds=脚,布甲" },
        { 20167, "INV_Boots_Cloth_04", "=q3=污染者的蜥蜴皮长靴", "=ds=脚,皮甲" },
        { 20186, "INV_Boots_Cloth_05", "=q3=污染者的皮甲长靴",   "=ds=脚,皮甲" },
        { 20199, "INV_Boots_Chain_02", "=q3=污染者的锁甲护胫",   "=ds=脚,锁甲" },
        { 20208, "INV_Boots_Plate_04", "=q3=污染者的板甲护胫",   "=ds=脚,板甲" },
    };
    
    ABExalted = {
        { 0, "INV_BannerPVP_02", "=q6=联盟", "=q5=阿拉索联军" },
        { 20055, "INV_Shoulder_01", "=q4=高地链甲护肩",   "=ds=肩部,锁甲" },
        { 20061, "INV_Shoulder_24", "=q4=高地肩饰",       "=ds=肩部,布甲" },
        { 20060, "INV_Shoulder_24", "=q4=高地蜥蜴皮护肩", "=ds=肩部,皮甲" },
        { 20059, "INV_Shoulder_24", "=q4=高地皮甲护肩",   "=ds=肩部,皮甲" },
        { 20058, "INV_Shoulder_01", "=q4=高地板层甲护肩", "=ds=肩部,板甲" },
        { 20057, "INV_Shoulder_01", "=q4=高地板甲护肩",   "=ds=肩部,板甲" },
        { 20073, "INV_Misc_Cape_02", "=q4=荣誉卫士披风",  "=ds=背部" },
        { 20070, "INV_Sword_13", "=q4=先知之爪",          "=ds=单手匕首" },
        { 20069, "INV_Wand_04", "=q4=铁皮法杖",           "=ds=法杖" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "INV_BannerPVP_01", "=q6=部落", "=q5=污染者 " },
        { 20158, "INV_Shoulder_01", "=q4=污染者的链甲护肩",   "=ds=肩部,锁甲" },
        { 20176, "INV_Shoulder_24", "=q4=污染者肩饰",         "=ds=肩部,布甲" },
        { 20175, "INV_Shoulder_24", "=q4=污染者的蜥蜴皮护肩", "=ds=肩部,皮甲" },
        { 20194, "INV_Shoulder_24", "=q4=污染者的皮甲护肩",   "=ds=肩部,皮甲" },
        { 20203, "INV_Shoulder_01", "=q4=污染者的锁甲护肩",   "=ds=肩部,锁甲" },
        { 20212, "INV_Shoulder_01", "=q4=污染者的板甲护肩",   "=ds=肩部,板甲" },
        { 20068, "INV_Misc_Cape_02", "=q4=亡灵卫兵披风",      "=ds=背部" },
        { 20214, "INV_Sword_13", "=q4=心灵之牙",              "=ds=单手匕首" },
        { 20220, "INV_Wand_04", "=q4=铁皮法杖",               "=ds=法杖" },
    };

    WSGFriendly = {
        { 0, "INV_BannerPVP_02", "=q6=联盟", "=q5=银翼哨兵" },
        { 17349, "INV_Potion_39", "=q1=超强治疗药剂",              "=ds=药剂" },
        { 17352, "INV_Potion_81", "=q1=超强法力药剂",              "=ds=药剂" },
        { 19062, "INV_Misc_Food_09", "=q1=战歌峡谷野战军粮",       "=ds=食物" },
        { 19061, "INV_Misc_Food_08", "=q1=战歌峡谷标准军粮",       "=ds=食物" },
        { 19060, "INV_Misc_Food_33", "=q1=战歌峡谷浓缩军粮",       "=ds=食物" },
        { 19068, "INV_Misc_Bandage_02", "=q1=战歌峡谷丝制绷带",    "=ds=绷带" },
        { 19067, "INV_Misc_Bandage_20", "=q1=战歌峡谷魔纹布绷带",  "=ds=绷带" },
        { 19066, "INV_Misc_Bandage_12", "=q1=战歌峡谷符文布绷带",  "=ds=绷带" },
        { 21565, "INV_Misc_Rune_05", "=q3=完美贡献苻文",           "=ds=饰品" },
        { 21567, "INV_Misc_Rune_02", "=q3=义务苻文",               "=ds=饰品" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "INV_BannerPVP_01", "=q6=部落", "=q5=战歌前锋" },
        { 17349, "INV_Potion_39", "=q1=超强治疗药剂",              "=ds=药剂" },
        { 17352, "INV_Potion_81", "=q1=超强法力药剂",              "=ds=药剂" },
        { 19062, "INV_Misc_Food_09", "=q1=战歌峡谷野战军粮",       "=ds=食物" },
        { 19061, "INV_Misc_Food_08", "=q1=战歌峡谷标准军粮",       "=ds=食物" },
        { 19060, "INV_Misc_Food_33", "=q1=战歌峡谷浓缩军粮",       "=ds=食物" },
        { 19068, "INV_Misc_Bandage_02", "=q1=战歌峡谷丝制绷带",    "=ds=绷带" },
        { 19067, "INV_Misc_Bandage_20", "=q1=战歌峡谷魔纹布绷带",  "=ds=绷带" },
        { 19066, "INV_Misc_Bandage_12", "=q1=战歌峡谷符文布绷带",  "=ds=绷带" },
        { 21565, "INV_Misc_Rune_05", "=q3=完美贡献苻文",           "=ds=饰品" },
        { 21567, "INV_Misc_Rune_02", "=q3=义务苻文",               "=ds=饰品" },
    };
    
    WSGHonored = {
        { 0, "INV_BannerPVP_02", "=q6=联盟", "=q5=银翼哨兵" },
        { 19530, "INV_Misc_Cape_13", "=q3=看守者斗篷",      "=ds=背部" },
        { 19522, "INV_Jewelry_Ring_28", "=q3=博学者之戒",   "=ds=手指" },
        { 19538, "INV_Jewelry_Necklace_13", "=q3=哨兵工会徽章", "=ds=颈部" },
        { 19514, "INV_Jewelry_Ring_10", "=q3=保护者指环",   "=ds=手指" },
        { 17348, "INV_Potion_38", "=q1=特效治疗药剂",       "=ds=药剂" },
        { 17351, "INV_Potion_80", "=q1=特效法力药剂",       "=ds=药剂" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "INV_BannerPVP_01", "=q6=部落", "=q5=战歌前锋" },
        { 19526, "INV_Misc_Cape_18", "=q3=战地治疗者披风",  "=ds=背部" },
        { 19518, "INV_Jewelry_Ring_20", "=q3=顾问之戒",     "=ds=手指" },
        { 19534, "INV_Jewelry_Necklace_14", "=q3=斥候工会徽章", "=ds=颈部" },
        { 19510, "INV_Jewelry_Ring_21", "=q3=军团士兵指环", "=ds=手指" },
        { 17348, "INV_Potion_38", "=q1=特效治疗药剂",       "=ds=药剂" },
        { 17351, "INV_Potion_80", "=q1=特效法力药剂",       "=ds=药剂" },
    };
    
    WSGRevered = {
        { 0, "INV_BannerPVP_02", "=q6=联盟",                  "=q5=银翼哨兵" },
        { 19570, "INV_Staff_28", "=q3=博学者法杖",            "=ds=法杖" },
        { 19562, "INV_Weapon_Bow_02", "=q3=侍从之弓",         "=ds=弓" },
        { 19554, "INV_Sword_27", "=q3=保护者之剑",            "=ds=单手剑" },
        { 19546, "INV_Weapon_ShortBlade_14", "=q3=哨兵之刃",  "=ds=单手匕首" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "INV_BannerPVP_01", "=q6=部落", "=q5=战歌前锋" },
        { 19566, "INV_Staff_25", "=q3=顾问的木节法杖",        "=ds=法杖" },
        { 19558, "INV_Weapon_Bow_06", "=q3=护卫之弓",         "=ds=弓" },
        { 19550, "INV_Sword_31", "=q3=军团士兵之剑",          "=ds=单手剑" },
        { 19542, "INV_Weapon_ShortBlade_15", "=q3=斥候之刃",  "=ds=单手匕首" },
    };
    
    WSGExalted = {
        { 0, "INV_BannerPVP_02", "=q6=联盟", "=q5=银翼哨兵" },
        { 19578, "INV_Bracer_06", "=q4=狂暴者护腕",            "=ds=板甲,手腕" },
        { 19595, "INV_Bracer_13", "=q4=树妖的护腕",            "=ds=布甲,手腕" },
        { 19587, "INV_Bracer_12", "=q4=巡林者护腕",            "=ds=皮甲,手腕" },
        { 19582, "INV_Bracer_03", "=q4=风语者护腕",            "=ds=锁甲,手腕" },
        { 22752, "INV_Pants_Cloth_05", "=q4=哨兵的丝质护腿",   "=ds=腿部,布甲" },
        { 22749, "INV_Pants_Leather_12", "=q4=哨兵的皮裤",     "=ds=腿部,皮甲" },
        { 22750, "INV_Pants_06", "=q4=哨兵的蜥蜴皮裤",         "=ds=腿部,皮甲" },
        { 22748, "INV_Pants_03", "=q4=哨兵的链甲护腿",         "=ds=腿部,锁甲" },
        { 22753, "INV_Pants_Plate_15", "=q4=哨兵的板层腿甲",   "=ds=腿部,板甲" },
        { 22672, "INV_Pants_Plate_20", "=q4=哨兵的板甲护腿",   "=ds=腿部,板甲" },
        { 19506, "INV_Shirt_GuildTabard_01", "=q1=银翼军服",   "=ds=工会徽章" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "", "", "" },
        { 0, "INV_BannerPVP_01", "=q6=部落", "=q5=战歌前锋" },
        { 19578, "INV_Bracer_06", "=q4=狂暴者护腕",            "=ds=板甲,手腕" },
        { 19595, "INV_Bracer_13", "=q4=树妖的护腕",            "=ds=布甲,手腕" },
        { 19587, "INV_Bracer_12", "=q4=巡林者护腕",            "=ds=皮甲,手腕" },
        { 19582, "INV_Bracer_03", "=q4=风语者护腕",            "=ds=锁甲,手腕" },
        { 22747, "INV_Pants_Cloth_05", "=q4=护卫的丝质护腿",   "=ds=腿部,布甲" },
        { 22740, "INV_Pants_Leather_12", "=q4=护卫的皮裤",     "=ds=腿部,皮甲" },
        { 22741, "INV_Pants_06", "=q4=护卫的蜥蜴皮裤",         "=ds=腿部,皮甲" },
        { 22673, "INV_Pants_03", "=q4=护卫的链甲护腿",         "=ds=腿部,锁甲" },
        { 22676, "INV_Pants_03", "=q4=护卫的锁甲护腿",         "=ds=腿部,锁甲" },
        { 22651, "INV_Pants_Plate_20", "=q4=护卫的板甲护腿",   "=ds=腿部,板甲" },
        { 19505, "INV_Shirt_GuildTabard_01", "=q1=战歌军服",   "=ds=工会徽章" },
    };

};

end